<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>








































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <meta http-equiv="content-type" content="text/html; charset=UTF-8" />









































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <title>Gigacom Old Games!</title>
  <meta name="keywords" content="" />








































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <meta name="description" content="Tudo sobre jogos e video games antigos" />








































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <link href="styles.css" rel="stylesheet" type="text/css" media="screen" />






































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <meta content="Gigacom" name="author" />
</head>


<body>








































<div id="content">
<div id="main">
	
<div id="right">
	
<div id="header">
	
<div style="font-style: italic; font-family: Comic Sans MS;" id="logo"><big>
		
</big>
<h1><big><big><a href="../index.html"><br />


















</a></big></big></h1>

























<big>














		





	</big></div>








































	
<div id="menu">
		
<ul>








































			<li id="button1"><a href="../gambiarra/a_gambiarra.html" title="">Gambiarra</a></li>








































			<li id="button2"><a href="../oficina/a_oficina.html" title="">Oficina do Giga</a></li>








































			<li id="button3"><a href="../necroterio/a_necroterio.html" title="">Necrot&eacute;rio</a></li>








































			<li id="button4"><a href="../deunarevista/a_deunarevista.html" title="">Deu na revista!</a></li>








































			<li id="button5"><a target="_blank" href="http://gigacom.freeforums.org/index.php" title="">Trombone</a></li>








































		
</ul>








































	</div>








































	</div>








































	
<h4 style="font-weight: bold;">Como gravar jogos de Saturn em CD-R<br />









</h4>











<p><span style="font-weight: bold;"><img style="width: 77px; height: 79px; float: left;" alt="" src="../images/avatares/avatar_gigacom.jpg" hspace="3" /><span style="font-weight: bold;">:::.</span>&nbsp;</span><span style="font-style: italic; font-weight: bold;">Por Gigacom</span></p>









<p style="text-align: justify;"></p>



<p style="text-align: justify;">
Esse 
assunto &eacute; pouco tratado nos f&oacute;runs/sites e rodeado de mitos. Uns dizem que 
tem que gravar o CD &agrave; velocidade de 1x ou 2x, outros dizem que o CD-R 
tem que ser daqueles com fundo preto, outros ainda afirmam que CD-R acaba 
com o leitor do Saturn. Bem, a boa noticia &eacute; que tudo isso &eacute; balela. 
Os CDs podem ser gravados em qualquer velocidade que a sua gravadora 
permitir, e o Saturn l&ecirc; muito bem qualquer CD-R do mercado sem risco de estragar o
 leitor.<br />







Na internet alguns sites tem uma coletanea inteira dos jogos
 do Saturn dispon&iacute;vel para download, alguns s&atilde;o:<br />







<br />







<!-- m --><a target="_blank" class="postlink" href="http://romhustler.net/">http://romhustler.net/</a><!-- m --><br />







<!-- m --><a target="_blank" class="postlink" href="http://www.coolrom.com/">http://www.coolrom.com/</a><!-- m --><br />







<!-- m --><a target="_blank" class="postlink" href="http://www.sega-saturn.us/beta/news.php">http://www.sega-saturn.us/beta/news.php</a><!-- m --><br />







<br />







As
 imagens dos CDs vem em diversos formatos, sendo nescess&aacute;rio a 
utiliza&ccedil;&atilde;o de pelo menos do <span style="font-style: italic; text-decoration: underline;">Nero</span><span style="text-decoration: underline;"> </span>e do <span style="font-style: italic; text-decoration: underline;">Alcohool 120%</span> para grava&ccedil;&atilde;o dessas
 imagens em CDs.<br />







Outro detalhe a se atentar &eacute; quanto &agrave; nacionalidade 
da imagem do jogo que podem ser basicamente americana, japonesa ou europ&eacute;ia. Portanto, sempre que 
preciso, deve-se fazer a convers&atilde;o desses jogos para a nacionalidade do 
seu Saturn. Existe um programa muito bom e que recomendo para essa 
tarefa, &eacute; o SatHeader (voc&ecirc; pode baix&aacute;-lo a partir desse endere&ccedil;o: <a class="postlink" href="http://www.rysley.com/pages_html/satheader.htm">http://www.rysley.com/pages_html/satheader.htm</a>
). Ser&aacute; preciso tambem um bom software conversor de audio, que
possa converter arquivos mp3 e ogg para Wave, um bom conversor que
suporta esses formartos &eacute; o DbPower (d&aacute; uma googada
a&iacute; que tu acha).<br />







<br />







J&aacute; conseguiu os progamas? &Oacute;timo, agora vamos para uma
aulinha b&aacute;sica sobre formatos de imagens de CD que voc&ecirc;
encontrat&aacute; por a&iacute; em forma de jogo para o Saurn:<br />







<br />







<span style="font-weight: bold;">CUE:</span> arquivos CUE s&atilde;o arquivos de 
texto que indicam para o software que ir&aacute; fazer a grava&ccedil;&atilde;o da imagem, em
 qual parte do CD ele deve inserir os dados. &Eacute; normal voc&ecirc; encontrar uma
 imagem do CD com os dados todos e o CUE anexado. &Eacute; comum mais ainda 
voc&ecirc; encontrar uma imagem de CD com v&aacute;rios arquivos de audio juntos, 
ent&atilde;o a tarefa do CUE ser&aacute; indicar para o Nero por exemplo, que ele 
dever&aacute; gravar o arquivo de dados primeiro no CD, e em seguida o arquivo 
de audio 1, depois o 2 e assim por diante. Os arquivos de audio nas 
imagens do Saturn s&atilde;o as trilhas sonoras do jogo, ou alguma mensagem que
 a fabricante do game deixou ali.<br />







<br />







<span style="font-weight: bold;">BIN:</span> arquivos BIN s&atilde;o a imagem em c&oacute;digo bin&aacute;rio puro do 
CD. S&atilde;o sempre acompanhados de um arquivo CUE, sem ele n&atilde;o pode ser 
gravado corretamente no CD. &Eacute; comum que uma imagem venha com o BIN, o 
CUE e mais alguns arquivos de audio em mp3, wave ou ogg.<br />







<br />







<span style="font-weight: bold;">ISO:</span> na pr&aacute;tica, as imagens em ISO s&atilde;o
 as mais fac&eacute;is de se gravar, por ser compat&iacute;vel com a maior parte de 
softwares para grava&ccedil;&atilde;o de CDs. Por vezes ocorre dele tambem vir 
acompanhado do arquivo CUE e mais alguns de audio.<br />







<br />







<span style="font-weight: bold;">MDS e MDF:</span> esse tipo de arquivo &eacute; o 
utilizado em imagens feitas pelo Alcohool. Basicamente um funciona como 
os dados em si, e o outro semelhante ao CUE.<br />







<br />







<span style="font-weight: bold;">NRG:</span> arquivo de imagem do Nero. &Eacute; 
muito dificil de se encontrar, mas de todos &eacute; o mais simples de se 
gravar, j&aacute; que os arquivos todos, tanto os de dados quanto de audio, vem
 embutido nele.</p>





<div style="text-align: justify;">

</div>





<p style="text-align: justify;"><span style="font-weight: bold;">CDi:</span> formato utilizado pelo
antigo Clone CD, e pelo seu irm&atilde;o mais novo (e caro) Roxio.
&Eacute; um formato maldito, odeio ele, mas alguns jogos do Saturn vem
nesse formato... ent&atilde;o &eacute; bom saber do que se trata.</p>





<div style="text-align: justify;">

</div>





<p style="text-align: justify;">Em muitas imagens dos jogos do Saturn vem o arquivo de dados em ISO
ou BIN, e junto com ele v&aacute;rios arquivos de audio. Esses arquivos
de audio como j&aacute; disse, s&atilde;o os que formam a trilha sonora
do jogo. A maioria sempre vem em formato mp3, justamente para facilitar
o download. Sendo assim, &eacute; nescess&aacute;rio fazer alguns
ajustes antes de gravar a imagem. O primeiro deles, &eacute; converter
os arquivos mp3 em WAVE com 16-Bit est&eacute;reo &agrave; 44.1 khz,
mais ou menos do que isso e o Saturn poder&aacute; n&atilde;o ler o
audio. Feito a convers&atilde;o, &eacute; nescess&aacute;rio
reconfigurar o arquivo CUE para que ele indique ao gravador o nome
exato dos arquivos de audio. Para isso, <span style="font-weight: bold;">abra o SatHeader,</span> clique no menu <span style="font-weight: bold;">Extra</span> e depois em 
<span style="font-weight: bold;">CUE file maker</span>, v&aacute; ent&atilde;o at&eacute; a pasta onde se encontram a imagem do CD e 
os arquivos de audio j&aacute; convertidos (tenha o cuidado de deixar somente 
os arquivos WAVE), e clique em <span style="font-weight: bold;">Generate</span>. O programa dever&aacute; gerar um 
arquivo CUE com as informa&ccedil;&otilde;es corretas para grava&ccedil;&atilde;o do CD, salve esse 
arquivo na mesma pasta da imagem.<br />







<br />







Ap&oacute;s a convers&atilde;o do audio, e a 
cria&ccedil;&atilde;o do arquivo CUE, volte para a tela inicial do SatHeader, e clique
 em <span style="font-weight: bold;">File / Open</span>, e abra o arquivo de dados da imagem (o SatHeader s&oacute; &eacute; 
compat&iacute;vel com BIN, NRG, ISO e CDi). Fazendo isso, o SatHeader dever&aacute; 
exibir todas as informa&ccedil;&otilde;es do jogo, e principalmente, o que nos 
interessa, a nacionalidade da imagem. A nacionalidade aparecer&aacute; &nbsp;do lado em 
<span style="font-weight: bold;">Country Codes</span>. Sempre, em qualquer situa&ccedil;&atilde;o, selecione a nacionalidade 
USA/Canada se o seu Saturn for um Tec Toy, selecionar a nacionalidade 
Brasil poder&aacute; provocar conflitos em v&aacute;rios jogos. Feita a corre&ccedil;&atilde;o da 
nacionalidade (quando preciso), salve a altera&ccedil;&atilde;o, e assim poderemos 
passar para a proxima etapa.<br />







<br />







A grava&ccedil;&atilde;o das imagens depende acima
 de tudo da compatibilidade do software. O Nero por exemplo &eacute; um 
excelente gravador, por&eacute;m n&atilde;o reconhece arquivos em MDF. O Alcohool por 
sua vez, &eacute; o mais indicado, por&eacute;m &eacute; dificil conseguir uma copia 
ilimitada dele. Como o Nero &eacute; o mais conhecido de todos, vamos come&ccedil;ar 
por ele:<br />







Abra o <span style="font-weight: bold;">Nero Express</span>, e clique na op&ccedil;&atilde;o&nbsp;<span style="font-weight: bold;">Copia de disco</span>, 
nela voc&ecirc; poder&aacute; selecionar a op&ccedil;&atilde;o&nbsp;<span style="font-weight: bold;">Gravar imagem</span>, clique nela. Na 
tela do Nero, procure a imagem do jogo (para que apare&ccedil;a todos os 
formatos compat&iacute;vies, na tela de busca selecione&nbsp;<span style="font-weight: bold;">todos os tipos</span>, &eacute; s&oacute; 
olhar com calma que voc&ecirc; acha), depois de achar a imagem, selecione 
QUALQUER velocidade de grava&ccedil;&atilde;o (n&atilde;o importa se ser&aacute; 1x ou 89x) e mande 
queimar o disco.</p>





<div style="text-align: justify;">

</div>





<p style="text-align: justify;"><span style="font-weight: bold;">Obs: </span><span style="font-weight: bold;"><span style="font-style: italic;">a 
velocidade de grava&ccedil;&atilde;o n&atilde;o influi em nada no disco; os programas d&atilde;o a 
op&ccedil;&atilde;o de se escolher a velocidade para se evitar erros na grava&ccedil;&atilde;o em 
computadores lentos ou com alta carga de programas na mem&oacute;ria; portanto,
 se o seu computador &eacute; relativamente novo, n&atilde;o se preocupe quanto &agrave; 
isso, basta que na hora em que estiver gravando voc&ecirc; n&atilde;o v&aacute; jogar Call 
of Duty 4 por exemplo...</span></span></p>





<div style="text-align: justify;">

</div>





<p style="text-align: justify;">Uma dica que pode ser muito &uacute;til para quem s&oacute; tem o
Nero instalado no computador, &eacute; utilizar um programa que simule
um drive de CD virtualmente, como o Daemon Tools (clique <a href="../downloads/daemon_tools.rar">aqui</a>
para
fazer o download). Com ele voc&ecirc; pode, ap&oacute;s fazer as
altera&ccedil;&otilde;es de nacionalidade na imagem, carregar uma
imagem de praticamente qualquer formato (principalmente os n&atilde;o
suportados pelo Nero) no drive virtual, e utilizar o Nero para fazer
uma copia do disco nesse drive virtual para uma midia de CD-R.</p>

<p style="text-align: justify;">Ap&oacute;s a grava&ccedil;&atilde;o, &eacute; s&oacute; colocar o
CD no Saturn, ligar e jogar. Claro, se o seu Saturn n&atilde;o for
desbloqueado o jogo n&atilde;o rodar&aacute; por conta da trava de
seguran&ccedil;a que tem em todo CD original... nesse caso voc&ecirc;
pode usar a t&eacute;cnica Swap Trick (mais detalhes, clique aqui).&nbsp;&nbsp;<big><span style="font-weight: bold;"></span></big></p>

<p style="text-align: center;"><span style="font-weight: bold;">Acesse o <a href="http://gigacom.freeforums.org/index.php" target="_blank">Trombone</a> e comente sobre essa mat&eacute;ria!</span><br />


</p>










<br />














<br />














<br />
































<div style="clear: both;">
	</div>










































	</div>








































	
<div id="left">
	
<div id="left_top"><br />











</div>








































	
			
<div style="text-align: center;"><big><a href="../index.html"><big><span style="font-weight: bold; font-style: italic; text-decoration: underline;"></span></big></a></big>
























				<big><img style="width: 200px; height: 20px;" alt="" src="../images/botoes/indice.png" /><br />













<br />













<a href="../index.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/home.png" /></a><br />













</big><a href="../artigosdiversos/a_artigosdiversos.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/diversos.png" /></a><br />













<br />













<a href="../deunarevista/a_deunarevista.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/deunarevista.png" /></a><br />













<a href="../gambiarra/a_gambiarra.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/gambiarra.png" /></a><br />













<a href="../necroterio/a_necroterio.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/necroterio.png" /></a><br />













<a href="../oficina/a_oficina.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/oficina.png" /></a><br />















<a href="http://gigacom.freeforums.org/index.php"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/trombone.png" /></a><br />













<br />















<a href="../8bits/a_8bits.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/8bits.png" /></a><br />















<a href="../16bits/a_16bits.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/16bits.png" /></a><br />















<a href="a_32bits.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/3264bits.png" /></a><br />















<a href="../portateis/a_portateis.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/portateis.png" /></a><br />













<br />













<a href="../downloads/a_downloads.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/downloads.png" /></a><br />















<a href="../links/a_links.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/linksafiliados.png" /></a><br />















<a href="../historico.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/historico.png" /></a><big><a href="../gambiarra/a_gambiarra.html"><big><span style="font-weight: bold; font-style: italic; text-decoration: underline;"></span></big></a></big><br />















<big><a href="../32bits/a_32bits.html"><big><span style="font-weight: bold; font-style: italic; text-decoration: underline;"></span></big></a></big></div>















<br />













<div style="text-align: center;"><img style="width: 200px; height: 20px;" alt="" src="../images/botoes/vertambem.png" /><br />









</div>













<big><big><span style="font-weight: bold; font-style: italic;"></span></big></big>
<div class="comnews">
			<a href="../16bits/a_16bits.html#"><span style="font-weight: bold; font-style: italic;">construindo - construindo</span></a><br />






























<span style="font-weight: bold; font-style: italic;">construindo - construindo -</span><span style="font-weight: bold; font-style: italic;">construindo - construindo -</span><span style="font-weight: bold; font-style: italic;">construindo - construindo -</span><span style="font-weight: bold; font-style: italic;">construindo - construindo -</span><span style="font-weight: bold; font-style: italic;">construindo - construindo&nbsp;</span>




















<div style="text-align: right;"><a href="../16bits/a_16bits.html#">leia mais</a><br />






























</div>








































		</div>








































	
<div class="comnews">
			<a href="../16bits/a_16bits.html#"><span style="font-weight: bold; font-style: italic;">construindo - construindo</span></a>
<div style="text-align: left;"><span style="font-weight: bold; font-style: italic;">construindo - construindo -</span><span style="font-weight: bold; font-style: italic;">construindo - construindo -</span><span style="font-weight: bold; font-style: italic;">construindo - construindo -</span><span style="font-weight: bold; font-style: italic;">construindo - construindo -</span><span style="font-weight: bold; font-style: italic;">construindo - construindo ...</span>




















<div style="text-align: right;"><a href="../16bits/a_16bits.html#">leia mais</a><br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
</div>






























</div>














































	










		</div>









</div>

































































<div id="footer">
<p>Gigacom Old Games!</p>























<p>Tudo sobre&nbsp;jogos mais antiguinhos e outras coisitas mais.</p>























<br />























</div>







































</div>








































</div>








































<!-- footer ends-->
</body>
</html>
