<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>















































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <meta http-equiv="content-type" content="text/html; charset=UTF-8" />
















































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <title>Gigacom Old Games!</title>
  <meta name="keywords" content="" />















































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <meta name="description" content="Tudo sobre jogos e video games antigos" />















































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <link href="styles.css" rel="stylesheet" type="text/css" media="screen" />













































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <meta content="Gigacom" name="author" />
</head>


<body>















































<div id="content">
<div id="main">
	
<div id="right">
	
<div id="header">
	
<div style="font-style: italic; font-family: Comic Sans MS;" id="logo"><big>
		
</big>
<h1><big><big><a href="../index.html"><br />

























</a></big></big></h1>
































<big>














		





	</big></div>















































	
<div id="menu">
		
<ul>















































			<li id="button1"><a href="../gambiarra/a_gambiarra.html" title="">Gambiarra</a></li>















































			<li id="button2"><a href="../oficina/a_oficina.html" title="">Oficina do Giga</a></li>















































			<li id="button3"><a href="../necroterio/a_necroterio.html" title="">Necrot&eacute;rio</a></li>















































			<li id="button4"><a href="../deunarevista/a_deunarevista.html" title="">Deu na revista!</a></li>















































			<li id="button5"><a target="_blank" href="http://gigacom.freeforums.org/index.php" title="">Trombone</a></li>















































		
</ul>















































	</div>















































	</div>















































	
<h4 style="font-weight: bold;">Saturn - Dragon Force<br />
















</h4>



<span style="font-weight: bold;"><span style="font-weight: bold;"></span></span><span style="font-style: italic; font-weight: bold;"></span><br />



<p style="text-align: justify;">


<img style="width: 77px; height: 79px; float: left;" alt="" src="../images/avatares/avatar_gigacom.jpg" hspace="3" /><span style="font-weight: bold; text-decoration: underline;">Por Gigacom</span><span style="font-weight: bold;"> - </span>&Eacute;
bem sabido que a maior parte dos jogos do Saturn ficaram l&aacute; no
Jap&atilde;o sem nunca terem aterrisado no ocidente, por&eacute;m
outros vieram para essas bandas do planeta, ficaram bem conhecidos mas
acabaram sendo ofuscados por v&aacute;rios motivos (baixa popularidade
do console, grandes lan&ccedil;amentos para o Playstation... etc) e
acabaram por cair no esquecimento. Esse &eacute; o caso de Dragon Force.</p>


<p style="text-align: center;"><img style="width: 461px; height: 190px;" alt="" src="imagens/saturn_dragonforce_06.jpg" /></p>



<p style="text-align: justify;">Trata-se de um game de
estrat&eacute;gia em tempo real, com uma hist&oacute;rinha para
ilustrar tudo, e batalhas &eacute;picas que s&oacute; poderiam rolar no
Saturn (mais pra frente explico, continue lendo). Se me perguntarem
qual a hist&oacute;ria eu s&oacute; vou poder dizer um sincero
<span style="font-weight: bold;">N&Atilde;O SEI<img style="width: 20px; height: 15px;" alt="" src="../images/icones/icon_dontknow.gif" /></span>, pois nesse game isso literalmente &eacute; o de menos, e tambem porque n&atilde;o tive saco pra ficar lendo as
infindav&eacute;is legendas que rola no inicio contando a
hist&oacute;rinha do jogo... mas acho que tem a ver com algo como "o
mal ressurgiu e precisamos lutar contra ele", ou seja, o de praxe<img style="width: 15px; height: 17px;" alt="" src="../images/icones/icon_lol.gif" hspace="1" />.</p>



<p style="text-align: justify;">No inicio&nbsp;do jogo
voc&ecirc; tem a oportunidade de escolher um rei de uma das 8
na&ccedil;&otilde;es para comandar. Cada rei tem um
objetivo como unificar o continente, trazer a paz e por um fim no "mal"
que apareceu, mesmo que para isso seja necess&aacute;rio recrutar
milhares de seus s&uacute;ditos e obrig&aacute;-los a apanhar dos
outros reis em seu glorioso nome<img style="width: 15px; height: 15px;" alt="" src="../images/icones/icon_devil.gif" hspace="1" />. Chique n&atilde;o<img style="width: 15px; height: 17px;" alt="" src="../images/icones/icon_mrgreen.gif" hspace="1" />?</p>



<p style="text-align: justify;">Mas o jogo n&atilde;o &eacute;
s&oacute; quebra pau, e &eacute; a&iacute; que aparece um dos trunfos
dele, a estrategia. Para conquistar, defender, fortificar cidades e
outras coisas mais, voc&ecirc; ter&aacute; a sua
disposi&ccedil;&atilde;o generais de guerra para executar essas
tarefas. Cada general tem uma classe especifica de
especializa&ccedil;&atilde;o (um &eacute; guerreiro, outro &eacute; um
mago, aquele nojento ali &eacute; um necromante vagabundo...) e um tipo
de tropa ao seu comando, que n&atilde;o necess&aacute;riamente precisa
ser da mesma classe do general. Portanto, pode rolar de voc&ecirc; ver
uma ranger dando ordens para um exercito de magos, ou um general
guerreiro tendo que se virar com um exercito de zumbis... mas via de
regra, as coisas s&atilde;o mais ou menos dentro do esperado, s&oacute;
de vez em quando &eacute; que aparecem uns doido meio malucos no
caminho<img style="width: 15px; height: 15px;" alt="" src="../images/icones/icon_confused.gif" hspace="1" />. Enfim, esses generais s&atilde;o os que conduzem os exercitos,
conquistam e mantem controle sobre um dos v&aacute;rios castelos
espalhados pelo continente, e consequentemente mantem controle sobre
uma determinada regi&atilde;o que ocupam.&nbsp;</p>



<p style="text-align: justify;"><img style="width: 320px; height: 240px; float: left;" alt="" src="imagens/saturn_dragonforce_03.jpg" />
Os castelos todos est&atilde;o interligados por caminhos
predeterminados e imutav&eacute;is, e por esses caminhos os exercitos
inimigos ou aliados caminham. Como o jogo&nbsp;corre em tempo real,
&eacute; preciso ficar de olho nesses caminhos para que voc&ecirc;
n&atilde;o seja surpreendido, pois vai que c&ecirc; decidi pegar
at&eacute; os velhinhos de uma cidade para formar um baita dum exercito
para conquistar aquele castelo hyper fortificado do vizinho, e nesse
meio tempo aparece um general gaiato do vizinho do outro lado e
encontra sua querida cidade mal guarnecida?</p>

<p style="text-align: justify;"> Outra coisa
interessante &nbsp;&eacute;
que ao iniciar voc&ecirc; tem ao seu dispor 2 ou 3
generais, mas conforme vence batalhas, voc&ecirc; pode capturar
generais inimigos e convenc&ecirc;-los a lutar do seu lado. Assim,
&eacute; possivel aumentar o seu exercito e deixar alguns generais de
prontid&atilde;o nas cidades para proteg&ecirc;-las, enquanto um outro
exercito seu se dedica
nas batalhas por exemplo. E se o jogador se de mal e ao inv&eacute;s de
capturar generais acaba por perder os que tem, ainda h&aacute; a chance
de procurar por mais generais dentro das cidades que domina, mas
ser&aacute; preciso escolher bem quem ir&aacute; fazer a busca por
essas pessoas, pois ao inv&eacute;s de achar voc&ecirc; pode &eacute;
acabar assustando os carinhas com talento do seu reino. O rei da
na&ccedil;&atilde;o tambem &eacute; um general e pode liderar
exercitos, por&eacute;m se ele perder um embate... fudeu, &eacute; game
over na hora.</p>



<p style="text-align: justify;">Outra coisita interessante aqui &eacute; a politica. Veja: se o carinha que d&aacute; em cima da sua
namorada &eacute; seu inimigo, ent&atilde;o alie-se com a ex namorada
dele<img style="width: 15px; height: 15px;" alt="" src="../images/icones/icon_devil.gif" hspace="1" />! &Eacute; mais ou menos o que ocorre no game. &Eacute; possivel
conquistar a amizade de outros reinos e faz&ecirc;-los de aliados em
sua empreitada, aumentando a sua ar&eacute;a de influ&ecirc;ncia e o
seu exercito. &Eacute; preciso tambem ficar de olho na moral dos seus
generais, pois aqueles que est&atilde;o sempre conseguindo vitorias nas
batalhas ir&atilde;o precisar de coisas al&eacute;m de um "muito
obrigado, valeu por ter quase&nbsp;morrido ontem por mim". Rola um
esqueminha de premia&ccedil;&atilde;o e gradua&ccedil;&atilde;o nesse
sentido. Voc&ecirc; pode presentear os generais ou promov&ecirc;-los
para que comandem mais tropas e obtenham mais prestigio.</p>



<p style="text-align: justify;">J&aacute; falei de como o jogo funciona
mais ou menos... e convenhamos, n&atilde;o &eacute; s&oacute; por
originalidade ou forma de se jogar que um game fica conhecido,
h&aacute; outras coisas como gr&aacute;ficos, som, jogabilidade... e
a&iacute; &eacute; que acontece a m&aacute;gica toda. O Saturn tem uma
capacidade no minimo peculiar para manipular gr&aacute;ficos em
sprites. Reza a lenda que o Saturn consegue gerar e manter em movimento
milhares de sprites ao mesmo tempo contanto que esses graficos caibam
todos na mem&oacute;ria.
Ah t&aacute;, pra ninguem ficar boiando, sprites s&atilde;o figuras de
desenhos que geralmente comp&otilde;em joguinhos 2D como Sonic, Mario,
Street Fighter... Continuando: tal capacidade era &uacute;nica do
Saturn
na gera&ccedil;&atilde;o de video games daquela &eacute;poca (N64 e
Playstation ficavam anos luz de dist&acirc;ncia nesse quesito dele) e
em Dragon Force &eacute; o que a gente mais v&ecirc; rolar. Apenas
pense: quando &eacute; que voc&ecirc; viu pela primeira vez um jogo de
estrategia, onde era possivel colocar 100 unidades de uma s&oacute;
vez, todas batalhando ao mesmo tempo e se movimentando numa boa sem
lerdeira alguma? Pois &eacute;, em Dragon Force
isso ocorre numa boa, e o Saturninho nem xia enquanto comanda tranquilo
esse tanto de coisa ao mesmo tempo.&nbsp;</p>



<div style="text-align: center;"></div>



<p style="text-align: center;"><img style="width: 320px; height: 240px;" alt="" src="imagens/saturn_dragonforce_01.jpg" /><img style="width: 320px; height: 240px;" alt="" src="imagens/saturn_dragonforce_02.jpg" /></p>



<p style="text-align: center;"><span style="font-weight: bold; color: rgb(255, 0, 0);">Algumas cenas de batalhas pequenas. Sim, pequenas, em cada imagem aparece&nbsp;<br />

uns 90 e tantos bonequinhos</span> <span style="font-weight: bold; color: rgb(255, 0, 0);">mas ha batalhas com at&eacute; 200 soldados<img style="width: 15px; height: 15px;" alt="" src="../images/icones/icon_ooooh.gif" hspace="1" />.</span><br />



</p>



<p style="text-align: justify;">Antes de rolar o fight, &eacute;
possivel escolher a forma&ccedil;&atilde;o do exercito e a primeira
a&ccedil;&atilde;o a ser tomada quando come&ccedil;a a batalha. Por
exemplo, se voc&ecirc; decide mandar uma tropa de magos contra uma
tropa de cavaleiros, ser&aacute; mais sensato deixar os magos em
fileira, parados no mesmo lugar e lan&ccedil;ando magias enquanto a
cavalaria avan&ccedil;a. Ou voc&ecirc; vai mesmo querer ver o que
acontece quando um maguinho tenta bater num cavaleiro com um
peda&ccedil;o de pau (t&aacute;, bast&atilde;o para os f&atilde;s de
RPG ou varinha para os f&atilde;s de Harry Potter)? Os generais tambem
batalham, e possuem movimentos especiais como m&aacute;gias, golpes do
tipo "mata tudo", "arrast&atilde;o" e por a&iacute; vai, o que pode ser
decisivo em uma batalha, pois um general sozinho pode dar um belo
prejuizo no general inimigo e suas 100 unidades usando magias poderosas<img style="width: 15px; height: 15px;" alt="" src="../images/icones/icon_ooooh.gif" hspace="1" />.</p>

<p style="text-align: justify;">Como o jogo &eacute; bem extenso (voc&ecirc; vai precisar de&nbsp;umas horinhas para zerar<img style="width: 15px; height: 17px;" alt="" src="../images/icones/icon_mrgreen.gif" hspace="1" />)h&aacute;
a possibilidade de salvar o progresso na mem&oacute;ria do Saturn,
por&eacute;m &eacute; preciso ter quase metade da mem&oacute;ria
disponivel s&oacute; para o Dragon Force. Quem tem o Nights sabe como
&eacute;... alguns jogos mais antigos do Saturn consumem um
espa&ccedil;o absurdo para os arquivos de save deles, e Dragon Force
&eacute; um desses. O jogo &eacute; inteiramente compat&iacute;vel com
o cartucho de backup do Saturn, sendo que se esse cartucho estiver no
console, haver&aacute; a op&ccedil;&atilde;o de salvar o progresso
&agrave; qualquer momento sem precisar chegar ao final de um turno.</p>

<p style="text-align: justify;">Reza a lenda havia v&aacute;rias
vers&otilde;es de Dragon Force disponiveis no mercado. Na verdade,
h&aacute; somente um Dragon Force, por&eacute;m a arte do encarte pode
variar de CD para CD. Isso foi proposital e &eacute; apenas uma
mudan&ccedil;a cosm&eacute;tica, portanto repito: o jogo &eacute; o
mesmo n&atilde;o importa que tipo de desenho na capa ele tenha.</p>

<p style="text-align: justify;">Resumindo... Dragon Force &eacute; um
jog&atilde;o que absolutamente todos deveriam conhecer. Infelizmente
com o passar dos anos ele acabou sendo esquecido, mas muitos que o
conheceram em seus dias de gloria ainda hoje lembram com carinho e
saudades das incriveis batalhas que s&oacute; existem aqui. E para
finalizar, mais algumas imagens que contam mais detalhes desse game:</p>

<p style="text-align: justify;"><img style="width: 320px; height: 240px;" alt="" src="imagens/saturn_dragonforce_04.jpg" /><img style="width: 314px; height: 240px;" alt="" src="imagens/saturn_dragonforce_08.jpg" /></p>
<p style="text-align: justify;"><img style="width: 320px; height: 233px;" alt="" src="imagens/saturn_dragonforce_09.jpg" /><img style="width: 310px; height: 235px;" alt="" src="imagens/saturn_dragonforce_07.jpg" /></p>
<p style="text-align: center; font-weight: bold; color: rgb(255, 0, 0);">Cut scenes. Sempre que rola uma historinha elas aparecem aos montes.</p>
<p style="text-align: center;"><img style="width: 640px; height: 861px;" alt="" src="imagens/saturn_dragonforce_00.jpg" /></p>
<p style="text-align: center;"><span style="font-weight: bold; color: rgb(255, 0, 0);">Propaganda em uma revista estrangeira. A Sega investiu um bocado para promover o jogo</span><br style="font-weight: bold; color: rgb(255, 0, 0);" />
<span style="font-weight: bold; color: rgb(255, 0, 0);">mas a fama veio sozinha por conta da qualidade do jogo.</span></p>
<p style="text-align: center;"><img style="width: 312px; height: 235px;" alt="" src="imagens/saturn_dragonforce_10.jpg" hspace="1" /><img style="width: 315px; height: 237px;" alt="" src="imagens/saturn_dragonforce_11.jpg" /></p>
<p style="text-align: center;"><img style="width: 308px; height: 227px;" alt="" src="imagens/saturn_dragonforce_12.jpg" hspace="1" /><img style="width: 302px; height: 226px;" alt="" src="imagens/saturn_dragonforce_13.jpg" /></p>
<p style="text-align: center;"><span style="font-weight: bold; color: rgb(255, 0, 0);">Segata SanshirOOOOOOOOOOOOO! Em uma perfomance &uacute;nica, incomparav&eacute;l e REAL durante</span><br style="font-weight: bold; color: rgb(255, 0, 0);" />
<span style="font-weight: bold; color: rgb(255, 0, 0);">uma batalha de Dragon Force. Na verdade, ele fez um videozinho pra promover o Dragon Force 2</span><img style="width: 15px; height: 17px; font-weight: bold; color: rgb(255, 0, 0);" alt="" src="../images/icones/icon_mrgreen.gif" /><span style="font-weight: bold; color: rgb(255, 0, 0);">.</span></p>
<div style="text-align: justify;">



<br />







</div>



<p style="text-align: justify;"><big><span style="font-weight: bold;"></span></big></p>








<p style="text-align: center;"><span style="font-weight: bold;">Acesse o <a href="http://gigacom.freeforums.org/index.php" target="_blank">Trombone</a> e comente sobre essa mat&eacute;ria!</span><br />






</p>





















<br />





















<br />







































<div style="clear: both;">
	</div>

















































	</div>















































	
<div id="left">
	
<div id="left_top"><br />


















</div>















































	
			
<div style="text-align: center;"><big><a href="../index.html"><big><span style="font-weight: bold; font-style: italic; text-decoration: underline;"></span></big></a></big>
























				<big><img style="width: 200px; height: 20px;" alt="" src="../images/botoes/indice.png" /><br />




















<br />




















<a href="../index.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/home.png" /></a><br />




















</big><a href="../artigosdiversos/a_artigosdiversos.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/diversos.png" /></a><br />




















<br />




















<a href="../deunarevista/a_deunarevista.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/deunarevista.png" /></a><br />




















<a href="../gambiarra/a_gambiarra.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/gambiarra.png" /></a><br />




















<a href="../necroterio/a_necroterio.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/necroterio.png" /></a><br />




















<a href="../oficina/a_oficina.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/oficina.png" /></a><br />






















<a href="http://gigacom.freeforums.org/index.php"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/trombone.png" /></a><br />




















<br />






















<a href="../8bits/a_8bits.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/8bits.png" /></a><br />






















<a href="../16bits/a_16bits.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/16bits.png" /></a><br />






















<a href="a_32bits.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/3264bits.png" /></a><br />






















<a href="../portateis/a_portateis.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/portateis.png" /></a><br />




















<br />




















<a href="../downloads/a_downloads.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/downloads.png" /></a><br />






















<a href="../links/a_links.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/linksafiliados.png" /></a><br />






















<a href="../historico.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/historico.png" /></a><big><a href="../gambiarra/a_gambiarra.html"><big><span style="font-weight: bold; font-style: italic; text-decoration: underline;"></span></big></a></big><br />






















<big><a href="../32bits/a_32bits.html"><big><span style="font-weight: bold; font-style: italic; text-decoration: underline;"></span></big></a></big></div>






















<br />




















<div style="text-align: center;"><img style="width: 200px; height: 20px;" alt="" src="../images/botoes/vertambem.png" /><br />
















</div>




















<big><big><span style="font-weight: bold; font-style: italic;"></span></big></big>
<div class="comnews">
			<span style="font-weight: bold; font-style: italic; text-decoration: underline;">Mega Drive - Telebradesco</span><br />





<br />





































<span style="font-weight: normal;"> Que tal acessar&nbsp;a sua conta do banco, com
todo o conforto e comodidade de sua casa? Para isso, o pai de familia
iria precisar do&nbsp;</span><span style="font-weight: normal;">Telebradesco</span><span style="font-weight: normal;">,
um cartucho especial fabricado com exclusividade pela Tec Toy para o
Bradesco; e tambem iria precisar pegar emprestado o Mega Drive do
muleque para acessar...</span><span style="font-weight: bold; font-style: italic;"></span>




















<div style="text-align: right;"><a href="../16bits/16bits_telebradesco.html">leia mais</a><br />



</div>















































		</div>















































	
<div class="comnews">
			<a href="../16bits/a_16bits.html#"><span style="font-weight: bold; font-style: italic;"></span></a><br />







</div>
















</div>








































































<div id="footer">
<p>Gigacom Old Games!</p>






























<p>Tudo sobre&nbsp;jogos mais antiguinhos e outras coisitas mais.</p>






























<br />






























</div>














































</div>















































</div>















































<!-- footer ends-->
</body>
</html>
