<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>






































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <meta http-equiv="content-type" content="text/html; charset=UTF-8" />







































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <title>Gigacom Old Games!</title>
  <meta name="keywords" content="" />






































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <meta name="description" content="Tudo sobre jogos e video games antigos" />






































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <link href="styles.css" rel="stylesheet" type="text/css" media="screen" />




































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <meta content="Gigacom" name="author" />
</head>


<body>






































<div id="content">
<div id="main">
	
<div id="right">
	
<div id="header">
	
<div style="font-style: italic; font-family: Comic Sans MS;" id="logo"><big>
		
</big>
<h1><big><big><a href="../index.html"><br />
















</a></big></big></h1>























<big>














		





	</big></div>






































	
<div id="menu">
		
<ul>






































			<li id="button1"><a href="../gambiarra/a_gambiarra.html" title="">Gambiarra</a></li>






































			<li id="button2"><a href="../oficina/a_oficina.html" title="">Oficina do Giga</a></li>






































			<li id="button3"><a href="../necroterio/a_necroterio.html" title="">Necrot&eacute;rio</a></li>






































			<li id="button4"><a href="../deunarevista/a_deunarevista.html" title="">Deu na revista!</a></li>






































			<li id="button5"><a target="_blank" href="http://gigacom.freeforums.org/index.php" title="">Trombone</a></li>






































		
</ul>






































	</div>






































	</div>






































	
<h4 style="font-weight: bold;">PC FX - Um bom 32 bits<br />







</h4>









<p style="font-weight: bold;"><span style="font-weight: bold;"><img style="width: 77px; height: 79px; float: left;" alt="" src="../images/avatares/avatar_edi.jpg" hspace="3" /> &nbsp;:::.</span> <span style="font-style: italic;">Por Edi</span></p>






<p style="font-weight: bold;">&nbsp;:::.<span style="font-style: italic;"> fonte:</span> <b><a class="genmed" href="http://edireviews.blogspot.com/">http://edireviews.blogspot.com/</a></b></p>








<p style="font-weight: bold; text-align: justify;">&nbsp;Contribui&ccedil;&atilde;o
do nosso amigo Edi, de uma an&aacute;lise do PC-FX, um console
pouquissimo conhecido por essas bandas, mas que mesmo assim tem sua
historia para contar. E como n&atilde;o conhe&ccedil;o pinad&iacute;ba alguma sobre esse console (pelo menos at&eacute; agora <img style="width: 15px; height: 17px;" alt="" src="../images/icones/icon_lol.gif" /> ), segue na integra:</p>






<p style="font-weight: bold; text-align: center;">__________________________________________________</p>






<p style="text-align: justify;">Eu acho interessante a maioria dos sistemas de video game, mas existem 
muitos que a maioria desconhece. Eu resolvi ent&atilde;o divulgar um sistema 
que apesar do seus defeitos, &eacute; um &oacute;timo console e tem parte importante na
 hist&oacute;ria dos games. A pesquisa foi dificil porque n&atilde;o existem artigos 
em portug&ecirc;s detalhando esse sistema. Leiam e vejam o que voc&ecirc;s acham!</p>






<p style="text-align: justify;"><span style="font-weight: bold; text-decoration: underline;">Historia</span></p>






<p style="text-align: justify;"><img style="width: 289px; height: 400px; float: left;" alt="" src="imagens/PC_FX_01.png" hspace="3" vspace="3" /> O PC-FX &eacute; um console de v&iacute;deo game 
lan&ccedil;ado no Jap&atilde;o em 23 de dezembro de 1994 pela NEC Corporation. &Eacute; o 
sucessor de 32 bits do NEC PC-Engine, conhecido nos Estados Unidos como 
Turbografx-16.&nbsp;O PC-FX usa 
CD-ROMs como meio de armazenamento, na sequ&ecirc;ncia da expans&atilde;o lan&ccedil;ado 
para o seu antecessor, que originalmente usava HuCards. O controle &eacute; 
semelhante ao controle de 6 bot&otilde;es do Mega Drive devido ao 
posicionamento dos bot&otilde;es, e id&ecirc;ntico ao controle do PC-Engine DUO-RX, 
exceto&nbsp;pela altera&ccedil;&atilde;o do seletor de <span style="font-style: italic;">tiro r&aacute;pido</span> para sele&ccedil;&atilde;o de 
<span style="font-style: italic;">modos</span>.</p>






<p style="text-align: justify;">O projeto do PC-FX foi incomum para consoles na &eacute;poca, pois fica na 
posi&ccedil;&atilde;o vertical como uma torre de computador, enquanto outros consoles 
contempor&acirc;neos costumavam ser planos. Outra caracter&iacute;stica interessante 
s&atilde;o as tr&ecirc;s portas de expans&atilde;o que s&atilde;o relativamente pouco utilizadas em
 consoles, e sua inclus&atilde;o aumentou o pre&ccedil;o sem oferecer uma grande 
contribui&ccedil;&atilde;o ao usu&aacute;rio final. No entanto, foi um dos primeiros consoles
 a ter como opcional um Mouse que fez com que jogos de estrat&eacute;gia como 
<span style="font-style: italic;">Farland Story FX</span> e <span style="font-style: italic;">Power Dolls FX</span> ficassem mais acess&iacute;veis para jogar na
 TV.</p>






<p style="text-align: justify;"><span style="font-weight: bold;"> </span>Ao contr&aacute;rio de quase qualquer outro console (com exe&ccedil;&atilde;o do 3DO), o PC-FX 
tem dispon&iacute;vel uma placa de PC interna compat&iacute;vel com o antigo Nec PC-98
 e com o DOS. Esta placa de computador veio com dois CDs de software para 
ajudar os usu&aacute;rios a programar jogos para o PC-FX. No entanto, havia 
problemas de compatibilidade impedido que jogos desenvolvidos com este 
software realmente rodassem no console.</p>






<p style="text-align: justify;">O PC-FX foi concebido com base em um novo kit de 32 bits desenvolvido 
pela NEC chamado de&nbsp;<span style="font-weight: bold;">Iron Man</span>. Iron Man foi concebido em 1992, quando o
 PC-Engine ainda era muito popular no Jap&atilde;o. Foi por volta dessa mesma 
&eacute;poca que as primeiras unidades de demonstra&ccedil;&atilde;o foram apresentadas e em 
meados de 1992, a NEC come&ccedil;ou a discutir um lan&ccedil;amento iminente de um 
sistema baseado na placa Iron Man, com os seus muitos desenvolvedores de 
jogos terceiros. Muitos desenvolvedores de jogos do PC-Engine pareciam 
chateados e desinteressados, pois o mercado do PC-Engine continuava a 
crescer, e como resultado a NEC parou de trabalhar na placa Iron Man e 
continuou a fazer modifica&ccedil;&otilde;es no PC-Engine. Por volta de 1993, a 
plataforma 3DO de 32 bits foi lan&ccedil;ada e com muito interesse dos 
desenvolvedores de jogos, da Sega e da Sony, foram anunciados o Sega 
Saturn e o Sony PlayStation, que estariam prontos para o mercado japon&ecirc;s 
no final de 1994. E a Bandai tamb&eacute;m estava preparando o lan&ccedil;amento do
 seu sistema <span style="font-style: italic;">Playdia</span>. Agora, em uma corrida para manter a base de 
desenvolvimento e sucesso como foi o do PC-Engine, a NEC tinha que tomar 
uma decis&atilde;o. Em vez de gastar o tempo necess&aacute;rio para desenvolver uma 
nova plataforma mais poderosa, capaz de fazer frente aos seus 
concorrentes, eles decidiram utilizar naquela &eacute;poca a arquitetura do 
Iron Man no PC-FX. O resultado foi que a NEC encerrou o seu projeto com 
um sistema de fraca pot&ecirc;ncia que n&atilde;o impressionou nem os programadores, 
nem consumidores, nem conseguiu liberar a expans&atilde;o 3D e levou &agrave; sua 
morte.</p>






<p style="text-align: justify;"><img style="width: 291px; height: 164px; float: right;" alt="" src="imagens/PC_FX_02.png" hspace="3" />A brilhante qualidade do PC-FX, por&eacute;m, foi a capacidade de descomprimir 
30 imagens JPEG por segundo durante a reprodu&ccedil;&atilde;o de &aacute;udio gravado 
digitalmente (essencialmente uma forma de Motion JPEG). Isto resultou no
 PC-FX uma qualidade em processar FMV (Full Motion V&iacute;deo) muito superior
 aos outros concorrentes de quinta gera&ccedil;&atilde;o, fazendo com que jogos de 
qualidade nesse genero fossem lan&ccedil;ados, mas esse estilo de jogo n&atilde;o 
foi muito bem aceito pelos consumidores que esperavam belas convers&otilde;es 
de Arcade e grandes sequencias em 3D dos jogos de PC-Engine.</p>






<p style="text-align: justify;">Contudo, a NEC se tornou muito mais liberal do que a maioria das 
empresas no que diz respeito aos t&iacute;tulos que permitiu lan&ccedil;amentos para a
 plataforma, em uma tentativa de conseguir apoiar seu desenvolvimento. 
Como resultado, o PC-FX ganhou uma grande reputa&ccedil;&atilde;o por sua abund&acirc;ncia 
de jogos em hentai e t&iacute;tulos de simula&ccedil;&atilde;o de namoro. Tem tamb&eacute;m alguns 
jogos de a&ccedil;&atilde;o padr&atilde;o e um modesto n&uacute;mero de jogos de RPGs e estrat&eacute;gia, 
mas a maioria dos jogos exigem um certo n&iacute;vel de conhecimento no idioma
 japon&ecirc;s para se jogar ou muita paci&ecirc;ncia. No entanto a maioria dos jogos 
s&atilde;o Text Adventure, o que pode tornar mais f&aacute;cil para aqueles com 
conhecimento limitado de japon&ecirc;s,&nbsp;a apreciar os jogos.</p>






<p style="text-align: justify;">No total foram lan&ccedil;ados 62 jogos oficiais para o sistema. Os t&iacute;tulos na 
data de lan&ccedil;amento (23 de dezembro de 1994) foram Graduation 2: Neo Generation FX, Battle Heat e 
Team Innocent, e o ultimo jogo lan&ccedil;ado 
foi First Kiss Monogatari em 24 de abril de 1998. O sistema e todos os 
t&iacute;tulos foram lan&ccedil;ados somente no Jap&atilde;o. Uma s&eacute;rie de discos de 
demonstra&ccedil;&atilde;o tamb&eacute;m foram liberados com publica&ccedil;&otilde;es que permitiam ao 
usu&aacute;rio reproduzir o disco no PC-Engine ou no pr&oacute;rpio PC-FX.</p>






<p style="text-align: justify;">N&atilde;o havia nenhuma prote&ccedil;&atilde;o contra c&oacute;pia de qualquer um dos jogos de 
PC-FX, porque na &eacute;poca em que o sistema foi lan&ccedil;ado, os gravadores de 
CD e CD-R tinham um alto valor de aquisi&ccedil;&atilde;o.</p>






<p style="text-align: justify;"><img style="width: 221px; height: 190px; float: left;" alt="" src="imagens/PC_FX_03.png" hspace="3" vspace="3" />O PC-FX foi descontinuado no in&iacute;cio de 1998. No momento da interrup&ccedil;&atilde;o 
da produ&ccedil;&atilde;o do console, de acordo com o NEC, o PC-FX tinha vendido um 
pouco menos de 100.000 unidades. Dai n&oacute;s podemos tirar nossas pr&oacute;rpias conclus&otilde;es e os fabricantes de 
v&iacute;deo games tamb&eacute;m. O que realmente matou o PC-FX, n&atilde;o foi a aus&ecirc;ncia de
 jogos tridimensionais e convers&otilde;es de &Aacute;rcade, mas sim, a pouca 
variedade de jogos. Se a Nec tivesse lan&ccedil;ado o PC-FX nos EUA, seu 
sucesso talvez seria maior com a tradu&ccedil;&atilde;o de alguns jogos para o ingl&ecirc;s e
 o interesse de outras softhouses para desenvolvimento de jogos.</p>






<p style="text-align: justify;">O&nbsp;<em>Best Seller</em> do Nec PC-FX&nbsp;foi Kishin Douji Zenki FX: 
Vajura Fight, que vendeu praticamente 1 jogo por console fabricado, o 
que &eacute; um bom n&uacute;mero. Vale salientar tamb&eacute;m que a NEC tentou empurrar o 
PC-FX sem ajuda da Hudson Soft, e alem de Kishin Douji Zenki, seus 
outros dois jogos mais vendidos tamb&eacute;m eram da Hudson Soft.</p>






<p><span style="font-weight: bold; text-decoration: underline;">Alguns fatos e rumores sobre o sistema</span></p>






<p style="text-align: justify;"><u>FX-Fighter</u> - Este t&iacute;tulo foi uma demonstra&ccedil;&atilde;o do que o PC-FX 
poderia fazer antes que ele realmente torna-se dispon&iacute;vel. N&atilde;o se 
sabe se ele foi um verdadeiro jogo ou apenas uma imagem em FMV de alguns
 lutadores pol&iacute;gonais muito bem feitos, mas de acordo com o 
demonstrativo apresentado na Tokyo Toy Show 1994, parecia que era 
jog&aacute;vel. Tudo parecia bem para os gr&aacute;ficos computadorizados, por&eacute;m, o 
motivo foi que o jogo teria ultrapassado o espa&ccedil;o de armazenamento do 
CD-ROM, devido a muitas cenas de alta qualidade em FMV.</p>






<table style="width: 464px; height: 326px; text-align: left; margin-left: auto; margin-right: auto;" border="0" cellpadding="2" cellspacing="2">






  <tbody>






    <tr>






      <td style="white-space: nowrap; text-align: center;"><img style="width: 200px; height: 150px;" alt="" src="imagens/PC_FX_05.png" /></td>






      <td style="text-align: center;" nowrap="nowrap"><img style="width: 200px; height: 150px;" alt="" src="imagens/PC_FX_06.png" /></td>






    </tr>






    <tr>






      <td style="text-align: center;" nowrap="nowrap"><img style="width: 200px; height: 150px;" alt="" src="imagens/PC_FX_07.png" /></td>






      <td style="text-align: center;" nowrap="nowrap"><img style="width: 200px; height: 150px;" alt="" src="imagens/PC_FX_08.png" /></td>






    </tr>






  
  
  
  
  
  
  </tbody>
</table>






<p></p>






<p>FX Fighter nunca foi lan&ccedil;ado no mercado aberto. O jogo que foi 
demonstrado na Tokyo Toy Show de 1994 inha apenas dois personagens, mas 
tinha sido relatado que entre 3 a 4 personagens estavam sendo 
finalizados. A jogabilidade era baseada&nbsp;no jogo mais tarde lan&ccedil;ado com o nome de 
Battle Heat, que tamb&eacute;m usou FMV para representar movimentos, 
no entanto, parecia que FX Fighter n&atilde;o tinha um sistema de jogo bastante
 elaborado.</p>






<p style="text-align: justify;"><img style="width: 200px; height: 136px; float: right;" alt="" src="imagens/PC_FX_09.png" hspace="3" /><u>Lords of Thunder FX</u> -&nbsp;Pouco antes e logo depois do lan&ccedil;amento do 
PC-FX, a NEC liberou algumas fotos para revistas especializadas em v&iacute;deo 
game, mostrando um dos chefes de fase do jogo de PC-Engine 
Lords of Thunder com gr&aacute;ficos poligonais. Estas fotos foram suficientes 
para levar as pessoas a falar sobre este sistema. N&atilde;o se sabe se as 
fotos apresentadas se tornaram um jogo real, ou se mesmo pronto ele 
nunca foi apresentado ao p&uacute;blico.</p>






<p></p>






<p style="text-align: justify;"><u>Super Star Soldier 3D</u> - O mesmo lote de fotos que a Nec liberou, 
tamb&eacute;m teve o que parecia ser um tipo diferente de Shooter para o PC-FX.
 O nome Super Star Soldier 3D foi anexado &agrave;s fotos, tornando-se assim um
 jogo que nunca mais foi visto. Este t&iacute;tulo aparentava ser uma suposta 
continua&ccedil;&atilde;o da s&eacute;rie Super Star Soldier feita para o PC-Engine, por&eacute;m, 
com sprites mais detalhados e alguns elementos em 3D. As fotos da 
renderiza&ccedil;&atilde;o do navio era tudo o que estava dispon&iacute;vel e, como vemos 
agora, nunca a NEC trouxe este t&iacute;tulo para o p&uacute;blico.</p>






<p style="text-align: justify;"><u>Hi-Ten Bomberman</u> - Hi-Ten Bomberman foi um jogo originalmente 
planejado para ser lan&ccedil;ado no PC-FX, no entanto, devido &agrave;s diretrizes de
 publica&ccedil;&atilde;o da NEC, Hi-Ten Bomberman nunca foi lan&ccedil;ado para o console. O
 jogo, em sua forma original nunca foi disponibilizado para venda, mas 
no entanto fez uma apari&ccedil;&atilde;o no Hudson Soft Caravan em 1993 como parte de
 uma competi&ccedil;&atilde;o. Hi-Ten Bomberman foi uma vers&atilde;o de 10 jogadores do 
popular jogo de PC-Engine Bomberman, e foi formatado para jogar em HDTV 
Wide Screen. Foi o primeiro jogo feito para esse formato. Voc&ecirc; pode 
jogar com muitos personagens diferentes, como Bonk ou Bomberman homem 
ou mulher e outros mais. Acredita-se que a Hudson Soft liberou mais 
tarde essa vers&atilde;o, um pouco refeita, como Saturn Bomberman, que inclui o
 modo de jogo de dez jogadores em HDTV Wide Screen. Saturn Bomberman &eacute; 
basicamente o que a vers&atilde;o PC-FX deveria ter sido.&nbsp;</p>






<table style="width: 383px; height: 326px; text-align: left; margin-left: auto; margin-right: auto;" border="1" cellpadding="2" cellspacing="2">






  <tbody>






    <tr>






      <td nowrap="nowrap"><img style="width: 200px; height: 150px;" alt="" src="imagens/PC_FX_10.png" /></td>






      <td nowrap="nowrap"><img style="width: 200px; height: 150px;" alt="" src="imagens/PC_FX_11.png" /></td>






    </tr>






    <tr>






      <td nowrap="nowrap"><img style="width: 200px; height: 150px;" alt="" src="imagens/PC_FX_12.png" /></td>






      <td nowrap="nowrap"><img style="width: 200px; height: 150px;" alt="" src="imagens/PC_FX_13.png" /></td>






    </tr>






  
  
  
  
  
  
  </tbody>
</table>






<p style="text-align: justify;"></p>






<p style="text-align: justify;"><u>Tengai Makyou III: NAMIDA</u> - Tengai Makyou tamb&eacute;m conhecido como 
Far East of Eden no ocidente, &eacute; uma das s&eacute;ries de RPG mais popular no 
Jap&atilde;o, sendo lan&ccedil;ado em v&aacute;rias plataformas ao longo dos anos, e a vers&atilde;o 
do PC-FX teria continuado a saga. Anunciado em 1995, Tengai Makyou III: 
Namida era muito esperado pelos f&atilde;s do PC-FX, mas foi cancelada devido &agrave;
 eventual falha do sistema. Isso foi muito infeliz por que o jogo foi 
relatado em um est&aacute;gio avan&ccedil;ado de desenvolvimento. Os f&atilde;s do PC-FX no 
Jap&atilde;o, fizeram v&aacute;rias tentativas para convencer a Hudson Soft para liberar
 o jogo, mas a Hudson Soft afirmou que a previs&atilde;o de vendas do t&iacute;tulo 
seria muito baixa e que eles precisavam fazer um lucro. Esse jogo foi 
lan&ccedil;ado em 2005 em uma forma totalmente refeita para PS2 e cancelado 
para o Nintendo Game Cube.</p>






<p style="text-align: center;"><img style="width: 320px; height: 240px;" alt="" src="imagens/PC_FX_14.png" /></p>






<p style="text-align: justify;"><span style="font-weight: bold; text-decoration: underline;">Especifica&ccedil;&otilde;es t&eacute;cnicas</span></p>






<ul>






  
  
  
  
  
  
  <div style="text-align: left;"><li><u>CPU</u> </li>







  </div>






  
  
  
  
  
  
  <div style="text-align: left;">Microprocessador 32 Bits NEC V810 
RISC </div>






  
  
  
  
  
  
  <div style="text-align: left;">Frequencia do rel&oacute;rgio: 
21.5MHz</div>






  
  
  
  
  
  
  <div style="text-align: left;">MIPS: 15.5</div>






  
  
  
  
  
  
  <div style="text-align: left;"></div>






  
  
  
  
  
  
  <div style="text-align: left;">
  <li><u>MEM&Oacute;RIA</u></li>







  </div>






  
  
  
  
  
  
  <div style="text-align: left;">RAM Principal: 2MB</div>






  
  
  
  
  
  
  <div style="text-align: left;">VRAM: 1.25MB</div>






  
  
  
  
  
  
  <div style="text-align: left;">Dados do cache de mem&oacute;ria do CD-ROM: 256KB</div>






  
  
  
  
  
  
  <div style="text-align: left;">Back-up RAM: 32KB</div>






  
  
  
  
  
  
  <div style="text-align: left;">ROM: 1MB</div>






  
  
  
  
  
  
  <div style="text-align: left;"></div>






  
  
  
  
  
  
  <div style="text-align: left;">
  <li><u>V&Iacute;DEO</u></li>







  </div>






  
  
  
  
  
  
  <div style="text-align: left;">Tipo de sa&iacute;da de televis&atilde;o: NTSC</div>






  
  
  
  
  
  
  <div style="text-align: left;">Sa&iacute;da de v&iacute;deo: 1.0Vp-p 75 ohm </div>






  
  
  
  
  
  
  <div style="text-align: left;">*&nbsp;Sa&iacute;da de Super V&iacute;deo</div>






  
  
  
  
  
  
  <div style="text-align: left;">* Sinal de brilho: 1.0Vp-p 75 ohm</div>






  
  
  
  
  
  
  <div style="text-align: left;">* Sinal de cores: 0.286Vp-p 75 ohm</div>






  
  
  
  
  
  
  <div style="text-align: left;"></div>






  
  
  
  
  
  
  <div style="text-align: left;">
  <li>&nbsp;<u>GR&Aacute;FICOS</u> </li>







  </div>






M&aacute;ximo de cores na tela: 16,777,000 Resolu&ccedil;&atilde;o: 640x480 Paralaxe 
M&aacute;ximo: 9 layers Efeitos: Rota&ccedil;&atilde;o, amplia&ccedil;&atilde;o, redu&ccedil;&atilde;o, cellophane, fade,
 priority. Compress&atilde;o de imagem: JPEG w/Run compress&atilde;o de comprimento, 
full-screen/true color, descompress&atilde;o a 30 frames por segundo, 
compat&iacute;vel com Kodak Photo CD.<br />






 

  <li>&nbsp;<u>SOM</u><br />







16-Bit Stereo w/2 canais ADPCM&nbsp;e 6&nbsp;canais auxiliares&nbsp;de 44.1kHz.<br />







Saida de Audio: 1.0 Vrms (0db)<br />







Frequencia Sonora: 20Hz~20kHz </li>






  <li>DRIVE DE CD <br />







Padr&atilde;o 2x CD-ROM drive compativel com CDs de 8mm e 12mm</li>






  <li>ENTRADAS/EXPANS&Otilde;ES:<br />







2 terminais para controle<br />







EXT1 (para cart&atilde;o de mem&oacute;ria)<br />







EXT2 (para fun&ccedil;&otilde;es extra)<br />







EXT3 (para expans&atilde;o da mem&oacute;ria principal)</li>






  <li>&nbsp;DIMENS&Otilde;ES:<br />







132mm (largura) x 267mm (comprimento) x 244mm (altura)</li>






  <li>&nbsp;FORMATO: <br />







FX-CD, CD-DA, CD+G, CD+EG, Photo CD</li>






  <li>&nbsp;CONSUMO DE ENERGIA<br />







16W / AC 100V</li>






  <li>PESO: <br />







Aproximadamente 2.9kg</li>






</ul>






<p style="text-align: justify; font-weight: bold; text-decoration: underline;">Acess&oacute;rios</p>






<p style="text-align: justify;"><u>NEC PC-FX Controller</u> &ndash; O controle do PC-FX possui um direcional 
com 8 dire&ccedil;&otilde;es, bot&atilde;o Select e Run como no PC-Engine, e seis bot&otilde;es de 
a&ccedil;&atilde;o como o controle do PC-Engine Duo-RX e mais dois seletores que 
servem para mudar as fun&ccedil;&otilde;es dos bot&otilde;es para alguns jogos.</p>






<p style="text-align: center;"><img style="width: 320px; height: 146px;" alt="" src="imagens/PC_FX_15.png" /></p>






<p style="text-align: justify;"><u>NEC PC-FX FX-BMP</u> - O FX-BMP &eacute; o m&oacute;dulo de expans&atilde;o de mem&oacute;ria 
para o PC-FX. O PC-FX s&oacute; tinha 32KB de RAM de backup e por causa de 
todos os RPG/Simul&ccedil;&atilde;o lan&ccedil;ados para o sistema, a mem&oacute;ria extra do FX-BMP
 era obrigat&oacute;ria.</p>






<p style="text-align: center;"><img style="width: 225px; height: 132px;" alt="" src="imagens/PC_FX_16.png" /><br />





</p>






<p style="text-align: justify;"><u>NEC PC-FX Mouse</u> - O mouse do PC-FX veio a calhar para os jogos 
que usavam o estilo ponto-e-clique, tais como a s&eacute;rie Freak Anime, 
alguns RPG e v&aacute;rios jogos de estrat&eacute;gia e simula&ccedil;&atilde;o. Jogos que suportam o
 mouse est&atilde;o marcados com o &iacute;cone do mouse na caixa do CD.</p>






<p style="text-align: center;"><img style="width: 225px; height: 132px;" alt="" src="imagens/PC_FX_17.png" /><br />





</p>






<p style="text-align: justify;"><u>NEC PC-FX SCSI Adapter</u> - O adaptador SCSI do PC-FX permite que os 
donos&nbsp;dos computadores da s&eacute;rie NEC-9800, utilizem o drive de CD do 
PC-FX como um drive de CD-ROM externo.</p>






<p style="text-align: center;"><img style="width: 225px; height: 132px;" alt="" src="imagens/PC_FX_18.png" /><br />





</p>






<p style="text-align: justify;"><u>NEC PC-FXGA/98IF</u> - O PC-FXGA foi um acess&oacute;rio lan&ccedil;ado pela NEC 
que permitia aos usu&aacute;rios com bons conhecimentos de programa&ccedil;&atilde;o, 
desenvolvessem jogos para a plataforma. Haviam grupos no Jap&atilde;o, que dedicaram-se a fazer projetos para o 
PC-FX e jogos demo. Por causa da barreira do idioma, o desenvolvimento dessa tecnologia nunca se epandiu para os 
propriet&aacute;rios do PC-FX nos EUA e pa&iacute;ses da Europa.</p>






<p style="text-align: center;"><img style="width: 225px; height: 264px;" alt="" src="imagens/PC_FX_19.png" /><br />





</p>










<p style="text-align: justify;">&Eacute; isso a&iacute; pessoal. Foi bem dif&iacute;cil traduzir e fazer com que houvesse uma
 coer&ecirc;ncia. Se tiver algum erro ou falta de informa&ccedil;&atilde;o gostaria que me 
enviassem um <a href="mailto:edireviews@gmail.com">e-mail</a> ok? As 
figuras e boa parte do texto foram extra&iacute;das de <a href="http://www.pcenginefx.com/PC-FX/">PC-FX
 World</a>, <a href="http://www.vgmuseum.com/systems/pcfx/">V&iacute;deo
 Game Museum</a>&nbsp;.
 Voc&ecirc; pode baixar o emulador e alguns jogos de PC-FX se cadastrando no <a href="http://segaforever.forum-livre.com/forum.htm">F&oacute;rum
 SEGA-Forever</a>.&nbsp;</p>


<p style="text-align: center;"><span style="font-weight: bold;">Acesse o <a href="http://gigacom.freeforums.org/index.php" target="_blank">Trombone</a> e comente sobre essa mat&eacute;ria!</span> <big><span style="font-weight: bold;"></span></big><br />





</p>








<br />












<br />












<br />






























<div style="clear: both;">
	</div>








































	</div>






































	
<div id="left">
	
<div id="left_top"><br />









</div>






































	
			
<div style="text-align: center;"><big><a href="../index.html"><big><span style="font-weight: bold; font-style: italic; text-decoration: underline;"></span></big></a></big>
























				<big><img style="width: 200px; height: 20px;" alt="" src="../images/botoes/indice.png" /><br />











<br />











<a href="../index.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/home.png" /></a><br />











</big><a href="../artigosdiversos/a_artigosdiversos.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/diversos.png" /></a><br />











<br />











<a href="../deunarevista/a_deunarevista.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/deunarevista.png" /></a><br />











<a href="../gambiarra/a_gambiarra.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/gambiarra.png" /></a><br />











<a href="../necroterio/a_necroterio.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/necroterio.png" /></a><br />











<a href="../oficina/a_oficina.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/oficina.png" /></a><br />













<a href="http://gigacom.freeforums.org/index.php"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/trombone.png" /></a><br />











<br />













<a href="../8bits/a_8bits.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/8bits.png" /></a><br />













<a href="../16bits/a_16bits.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/16bits.png" /></a><br />













<a href="a_32bits.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/3264bits.png" /></a><br />













<a href="../portateis/a_portateis.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/portateis.png" /></a><br />











<br />











<a href="../downloads/a_downloads.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/downloads.png" /></a><br />













<a href="../links/a_links.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/linksafiliados.png" /></a><br />













<a href="../historico.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/historico.png" /></a><big><a href="../gambiarra/a_gambiarra.html"><big><span style="font-weight: bold; font-style: italic; text-decoration: underline;"></span></big></a></big><br />













<big><a href="../32bits/a_32bits.html"><big><span style="font-weight: bold; font-style: italic; text-decoration: underline;"></span></big></a></big></div>













<br />











<div style="text-align: center;"><img style="width: 200px; height: 20px;" alt="" src="../images/botoes/vertambem.png" /><br />







</div>











<big><big><span style="font-weight: bold; font-style: italic;"></span></big></big>
<div class="comnews">
			<a href="../16bits/a_16bits.html#"><span style="font-weight: bold; font-style: italic;">construindo - construindo</span></a><br />




























<span style="font-weight: bold; font-style: italic;">construindo - construindo -</span><span style="font-weight: bold; font-style: italic;">construindo - construindo -</span><span style="font-weight: bold; font-style: italic;">construindo - construindo -</span><span style="font-weight: bold; font-style: italic;">construindo - construindo -</span><span style="font-weight: bold; font-style: italic;">construindo - construindo&nbsp;</span>




















<div style="text-align: right;"><a href="../16bits/a_16bits.html#">leia mais</a><br />




























</div>






































		</div>






































	
<div class="comnews">
			<a href="../16bits/a_16bits.html#"><span style="font-weight: bold; font-style: italic;">construindo - construindo</span></a>
<div style="text-align: left;"><span style="font-weight: bold; font-style: italic;">construindo - construindo -</span><span style="font-weight: bold; font-style: italic;">construindo - construindo -</span><span style="font-weight: bold; font-style: italic;">construindo - construindo -</span><span style="font-weight: bold; font-style: italic;">construindo - construindo -</span><span style="font-weight: bold; font-style: italic;">construindo - construindo ...</span>




















<div style="text-align: right;"><a href="../16bits/a_16bits.html#">leia mais</a><br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />

<br />
<br />

<br />

</div>




























</div>












































	










		</div>







</div>































































<div id="footer">
<p>Gigacom Old Games!</p>





















<p>Tudo sobre&nbsp;jogos mais antiguinhos e outras coisitas mais.</p>





















<br />





















</div>





































</div>






































</div>






































<!-- footer ends-->
</body>
</html>
