<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>





































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <meta http-equiv="content-type" content="text/html; charset=UTF-8" />






































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <title>Gigacom Old Games!</title>
  <meta name="keywords" content="" />





































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <meta name="description" content="Tudo sobre jogos e video games antigos" />





































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <link href="styles.css" rel="stylesheet" type="text/css" media="screen" />



































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <meta content="Gigacom" name="author" />
</head>


<body>





































<div id="content">
<div id="main">
	
<div id="right">
	
<div id="header">
	
<div style="font-style: italic; font-family: Comic Sans MS;" id="logo"><big>
		
</big>
<h1><big><big><a href="../index.html"><br />















</a></big></big></h1>






















<big>














		





	</big></div>





































	
<div id="menu">
		
<ul>





































			<li id="button1"><a href="../gambiarra/a_gambiarra.html" title="">Gambiarra</a></li>





































			<li id="button2"><a href="a_oficina.html" title="">Oficina do Giga</a></li>





































			<li id="button3"><a href="../necroterio/a_necroterio.html" title="">Necrot&eacute;rio</a></li>





































			<li id="button4"><a href="../deunarevista/a_deunarevista.html" title="">Deu na revista!</a></li>





































			<li id="button5"><a target="_blank" href="http://gigacom.freeforums.org/index.php" title="">Trombone</a></li>





































		
</ul>





































	</div>





































	</div>





































	
<h4 style="font-weight: bold;">Como restaurar a apar&ecirc;ncia do Master I/II e III<br />







</h4>










<p style="font-weight: bold;"><img style="width: 77px; height: 79px; float: left;" alt="" src="../images/avatares/avatar_gigacom.jpg" hspace="3" /><span style="font-weight: bold;">:::.</span><span style="font-style: italic;"> Por Gigacom</span></p>










<p style="text-align: justify;"></p>

<p style="text-align: justify;"><br />

Sabe quando voc&ecirc; vai numa feira do tipo&nbsp;<span style="font-weight: bold; font-style: italic;">mercad&atilde;o das pulgas</span>, e v&ecirc; 
aquele cara que catou um Master System no lixo de uma casa, e que tava 
sendo usado como adorno para o jardim, e te oferece o coitado do Master 
por R$5,00? Imposs&iacute;vel resisitir n&atilde;o &eacute; mesmo? E aquele outro Master que
 voc&ecirc; encontrou largado &agrave;s baratas e poeira no fundo duma caixa naquela 
banquinha na feira, e que o feirante t&aacute; "doando" por R$10,00? Em 
situa&ccedil;&otilde;es assim, a &uacute;nica coisa que nos obriga a evitar comprar um 
console &eacute; justamente o estado dele. A boa noticia al&eacute;m do pre&ccedil;o, &eacute; que 
com um pouco de dedica&ccedil;&atilde;o e trabalho, d&aacute; pra deixar muito video game 
surrado de cara limpa e brilhando, com um aspecto muito bom e feliz <img style="width: 15px; height: 15px;" alt="" src="../images/icones/icon_biggrin.gif" /> ! Abaixo 
segue algumas dicas de restaura&ccedil;&atilde;o:<br />



<br />



<span style="font-weight: bold; text-decoration: underline;">Master System I e II:</span> esse grande console (tanto na 
qualidade quanto no tamanho mesmo <img style="width: 15px; height: 17px;" alt="" src="../images/icones/icon_mrgreen.gif" />
) tende a sofrer com acumulo de poeira e de insetos em seu interior.
Isso se deve ao fato de haver v&aacute;rios furos na carca&ccedil;a que
serve como ventila&ccedil;&atilde;o, mas que nas horas de abandono
viram uma verdadeira porta para a entrada para poeira e bicho. O
primeiro passo, &eacute; logicamente abrir e desmontar o console. Logo
de cara, quando se abre ele, se d&aacute; de frente &agrave; uma chapa
met&aacute;lica cobrindo toda a placa m&atilde;e do video game, tanto
por cima como por baixo. Essa placa sofre oxida&ccedil;&atilde;o com
facilidade, at&eacute; mesmo em contato com a m&atilde;o. Desparafuse
essa placa, e de prefer&ecirc;ncia com uma luva, ou mesmo com um pano
seco, e remova ela com cuidado, pois tende tambem a amassar com
facilidade, e deixe-a em um canto separado. Retire a placa m&atilde;e
depois de remover os dois parafusos que a prendem na parte
pl&aacute;stica do console. Esses dois parafusos s&atilde;o os que
est&atilde;o em cada lado do slot de entrada de cartuchos. Depois
retire a chapa met&aacute;lica de baixo da placa m&atilde;e, e assim o
Master estar&aacute; completamente desmontado pronto para o banho.
Agora vamos &agrave; limpeza:<br />



<br />



<span style="font-weight: bold;">1&ordm; </span>Pegue um balde ou uma
bacia e enche-a bem. Voc&ecirc; tambem pode usar um tanque cheio de
&aacute;gua se quiser. Coloque sab&atilde;o ralado (voc&ecirc; pode
usar OMO tambem, mas sab&atilde;o ralado tende a dar resultados
melhores, al&eacute;m de ser bem mais facil de se tirar que OMO),
dissolva bem o sab&atilde;o, e coloque a parte pl&aacute;stica do video
game dentro da &aacute;gua. Mexa um pouco e deixe tudo ali de molho por
uns 10 ou 15 minutos.<br />



<br />



<span style="font-weight: bold;">2&ordm; </span>Enquanto o
pl&aacute;stico t&aacute; de molho, pegue um pincel novo e limpo, com
cerdas longas e macias, e v&aacute; limpando com cuidado a poeira entre
os circuitos na placa m&atilde;e; algu&eacute;m poder&aacute; dizer: <span style="font-weight: bold; font-style: italic;">mas pincel acumular&aacute; eletricidade estatica! Pode queimar a placa!</span> Bem, isso 
n&atilde;o deixa de ser uma verdade, <span style="font-weight: bold; text-decoration: underline;">SE VOC&Ecirc; VARRER A PLACA COMO ALGU&Eacute;M QUE 
VARRE A CAL&Ccedil;ADA!</span>&nbsp;<img style="width: 15px; height: 17px;" alt="" src="../images/icones/icon_evil.gif" /> Limpe tudo com calma e devagar, que n&atilde;o haver&aacute; acumulo 
de carga e nem risco algum.<br />



<br />



<span style="font-weight: bold;">3&ordm; </span>As chapas metalicas
voc&ecirc; poder&aacute; limpar com um pano seco. Por&eacute;m
h&aacute; casos em que a chapa esta t&atilde;o oxidada, e tem tanta
poeira grudada que apenas passar o pano n&atilde;o ir&aacute; resolver.
Nesse caso, pegue uma esponja de cozinha, e com a parte abrasiva, lixe
com cuidado a parte corro&iacute;da, al&eacute;m de melhorar a
situa&ccedil;&atilde;o, ir&aacute; tirar a sujeira que estiver ali.
&Eacute; claro, se a corros&atilde;o estiver em um estagio muito
avan&ccedil;ado, o jeito ser&aacute; remov&ecirc;-la e deixar ela fora
do console mesmo...<br />



<br />



<span style="font-weight: bold;">4&ordm; </span>Volte
 at&eacute; o balde com as partes plasticas do Master, coloque um pouco da &aacute;gua com sab&atilde;o<span style="text-decoration: underline;"></span> numa esponja macia, e v&aacute; limpando a parte plastica por
 inteiro. Nos furos e fendas de entrada de ar, use uma escora de dente 
por exemplo para retirar os residuos de poeira. Enxague tudo, e repita a
 opera&ccedil;&atilde;o, tendo o cuidado de passar a escova nas quinas e dobras da 
parte interna do pl&aacute;stico, que &eacute; justamente as partes onde a poeira&nbsp;<span style="font-weight: bold;">gruda</span>. 
Enxague novamente.<br />



<br />



<span style="font-weight: bold;">5&ordm; </span>Ap&oacute;s
 o enxague, d&ecirc; uma sacudida de leve no plastico para tirar o 
acumulo de &aacute;gua. Coloque tudo dentro de uma bacia grande, e deixe a 
bacia em um local arejado com sol, <span style="font-weight: bold;">MAS N&Atilde;O COLOQUE EM HIPOTESE ALGUMA&nbsp;DIRETO NO SOL!</span>
Apenas deixe num lugar &agrave; sombra, arejado mas quente o suficiente
para que a &aacute;gua evapore. Deixe secar por alguns minutos, e para
ter certeza de que ir&aacute; tudo estar seco mesmo, aproveite a
&aacute;gua com sab&atilde;o para lavar umas cuecas e meias, pendure no
mesmo local onde estar&aacute; o Master. Muito provavelmente, assim que
as cuecas e meias estiverem secas, o Master tambem dever&aacute; estar
sequinho <img style="width: 15px; height: 17px;" alt="" src="../images/icones/icon_mrgreen.gif" /> .<br />



<br />



<span style="font-weight: bold;">6&ordm; </span>Ap&oacute;s tudo seco e
bem limpo, monte com calma o Master System, com o cuidado de n&atilde;o
deixar nenhum parafuso de fora. Durante a montagem, caso n&atilde;o
tenha experi&ecirc;ncia, nunca force o encaixe de algo de qualquer
forma, pois poder&aacute; quebrar ou ama&ccedil;ar alguma pe&ccedil;a
de plastico ou mesmo as chapas de metal. Tenha paci&ecirc;ncia e
cuidado. Ap&oacute;s tudo montado, passe uma toalha macia em todo o
plastico para dar aquele brilho, ligue novamente o video game, tire uma
foto do seu trabalho e divirta-se! Ah! S&oacute; para frisar...
n&atilde;o tente passar nada em cima do console para deix&aacute;-lo
mais brilhante... usar silicone, lustre para plasticos, serol,
purpurina, tinta de cabelo, &oacute;leo de cozinha... enfim, usar
qualquer coisa poder&aacute; estragar completamente a apar&ecirc;ncia
do console, e de forma at&eacute; irreversivel! Portanto, tenha cuidado!<br />



<br />



<span style="font-weight: bold; text-decoration: underline;">Master 
System III:</span>
internamente esse console tem v&aacute;rias vers&otilde;es, mesmo entre
aqueles modelos considerados cl&aacute;ssicos. Em uns a placa
m&atilde;e recheia bem o espa&ccedil;o interno, em outros a placa
principal &eacute; do tamanho aproximado de dois celulares um do lado
do outro. Invariavelmente, desmont&aacute;-lo &eacute; uma tarefa
simples at&eacute; o ponto em que chegamos na fonte interna do
console... essa fonte &eacute; meio complicada de se remover, e
n&atilde;o recomendo a remo&ccedil;&atilde;o da mesma para quem
n&atilde;o tem experi&ecirc;ncia, ou n&atilde;o quer arriscar estragar
o console. Portanto, procure desmontar e tirar somente a placa
m&atilde;e, e limpar ali dentro com um pincel qualquer residuo de
poeira ou sujeira. E para dar um <span style="font-weight: bold;">grau</span>
na apar&ecirc;ncia do console, voc&ecirc; pode limpar a parte de cima
de pl&aacute;stico dele, da mesma forma como se faz em um Master I/II.</p>



<p style="text-align: justify;">Uma coisa que costuma encardir com mais
facilidade no Master III &eacute; o bot&atilde;o de pause. Como
&eacute; um bot&atilde;o branco, tende a sofrer com mudan&ccedil;a de
colora&ccedil;&atilde;o com o passar do tempo, n&atilde;o raro ficando
com uma cor e apar&ecirc;ncia suja, mesmo mantendo-o livre de poeira.
Para limp&aacute;-lo e trazer a brancura de volta (ou pelo menos
deix&aacute;-lo menos encardido), vire a parte superior do
pl&aacute;stico que comp&otilde;e a parte de cima do console, e logo
abaixo do bot&atilde;o pause voc&ecirc; ver&aacute; que ele &eacute;
preso por duas travinhas de pl&aacute;stico; pressione-as para dentro e
empurre o bot&atilde;o de dentro para fora, assim voc&ecirc;
ter&aacute; somente essa pe&ccedil;a livre para poder limp&aacute;-la
da melhor forma poss&iacute;vel. Recomendo que deixe essa pe&ccedil;a
de molho em um pote com agua, OMO e se poss&iacute;vel um pouco de
Vanish s&oacute; para garantir. Depois de alguns minutos voc&ecirc;
ter&aacute; o bendinto bot&atilde;o mais limpinho e pronto para
ornamentar da melhor forma poss&iacute;vel o Master novamente.</p>


<p style="text-align: justify; text-decoration: underline;"><span style="font-weight: bold;">Testado e aprovado!</span></p>


<p style="text-align: justify;">Um amigo nosso (o grande Vlad_djkax) seguiu essas dicas de limpeza e veja o resultado:</p>


<p style="text-align: center;"></p>


<table style="width: 100px; text-align: left; margin-left: auto; margin-right: auto;" border="0" cellpadding="2" cellspacing="2">


  <tbody>


    <tr>


      <td style="white-space: nowrap;"><img style="width: 240px; height: 180px;" alt="" src="imagens/limpeza_master_3_00.jpg" /></td>


      <td nowrap="nowrap"><img style="width: 240px; height: 180px;" alt="" src="imagens/limpeza_master_3_01jpg.jpg" /></td>


    </tr>


    <tr>


      <td style="text-align: center; color: rgb(255, 0, 0);" nowrap="nowrap"><span style="font-weight: bold;">Antes da limpeza...</span></td>


      <td style="text-align: center; color: rgb(255, 0, 0);" nowrap="nowrap"><span style="font-weight: bold;">E depois. Notem como ficou mais</span><br style="font-weight: bold;" />


      <span style="font-weight: bold;">bonito e com a tampa brilhante.</span></td>


    </tr>


  
  
  </tbody>
</table>


<br />



<p style="text-align: justify;">&Eacute; isso pessoal. A limpeza de
qualquer Master System pode fazer milagres na apar&ecirc;ncia dele, e
trazer orgulho para o dono. &Eacute; mais ou menos como um carro...
depois de um lustre, a lata velha se mostra uma vez mais como &eacute;
bonita.<span style="font-weight: bold;"></span><span style="font-weight: bold;"><br />



</span></p>



<br />



<p style="text-align: justify;"></p>
<div style="text-align: center;"><span style="font-weight: bold;">Acesse o <a href="http://gigacom.freeforums.org/index.php" target="_blank">Trombone</a> e comente sobre essa mat&eacute;ria!</span></div>







<br />











<br />











<br />





























<div style="clear: both;">
	</div>







































	</div>





































	
<div id="left">
	
<div id="left_top"><br />








</div>





































	
			
<div style="text-align: center;"><big><a href="../index.html"><big><span style="font-weight: bold; font-style: italic; text-decoration: underline;"></span></big></a></big>
























				<big><img style="width: 200px; height: 20px;" alt="" src="../images/botoes/indice.png" /><br />










<br />










<a href="../index.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/home.png" /></a><br />










</big><a href="../artigosdiversos/a_artigosdiversos.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/diversos.png" /></a><br />










<br />










<a href="../deunarevista/a_deunarevista.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/deunarevista.png" /></a><br />










<a href="../gambiarra/a_gambiarra.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/gambiarra.png" /></a><br />










<a href="../necroterio/a_necroterio.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/necroterio.png" /></a><br />










<a href="a_oficina.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/oficina.png" /></a><br />












<a href="http://gigacom.freeforums.org/index.php"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/trombone.png" /></a><br />










<br />












<a href="../8bits/a_8bits.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/8bits.png" /></a><br />












<a href="../16bits/a_16bits.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/16bits.png" /></a><br />












<a href="../32bits/a_32bits.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/3264bits.png" /></a><br />












<a href="../portateis/a_portateis.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/portateis.png" /></a><br />










<br />










<a href="../downloads/a_downloads.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/downloads.png" /></a><br />












<a href="../links/a_links.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/linksafiliados.png" /></a><br />












<a href="../historico.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/historico.png" /></a><big><a href="../gambiarra/a_gambiarra.html"><big><span style="font-weight: bold; font-style: italic; text-decoration: underline;"></span></big></a></big><br />












<big><a href="../32bits/a_32bits.html"><big><span style="font-weight: bold; font-style: italic; text-decoration: underline;"></span></big></a></big></div>












<br />










<div style="text-align: center;"><img style="width: 200px; height: 20px;" alt="" src="../images/botoes/vertambem.png" /><br />






</div>










<big><big><span style="font-weight: bold; font-style: italic;"></span></big></big>
<div class="comnews">
			
<div class="comnews">
			<a href="../16bits/a_16bits.html#"><span style="font-weight: bold; font-style: italic;">construindo - construindo</span></a>
<span style="font-weight: bold; font-style: italic;">construindo - construindo -</span><span style="font-weight: bold; font-style: italic;">construindo - construindo -</span><span style="font-weight: bold; font-style: italic;">construindo - construindo -</span><span style="font-weight: bold; font-style: italic;">construindo - construindo -</span><span style="font-weight: bold; font-style: italic;">construindo - construindo ...</span><br />






<div style="text-align: right;">&nbsp;<a href="../16bits/a_16bits.html#">leia mais</a></div>






</div>






</div>





































	
<div class="comnews">
			<a href="#"></a><br />






</div>
















</div>






























































<div id="footer">
<p>Gigacom Old Games!</p>




















<p>Tudo sobre&nbsp;jogos mais antiguinhos e outras coisitas mais.</p>




















<br />




















</div>




































</div>





































</div>





































<!-- footer ends-->
</body>
</html>
