<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>




































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <meta http-equiv="content-type" content="text/html; charset=UTF-8" />





































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <title>Gigacom Old Games!</title>
  <meta name="keywords" content="" />




































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <meta name="description" content="Tudo sobre jogos e video games antigos" />




































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <link href="styles.css" rel="stylesheet" type="text/css" media="screen" />


































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <meta content="Gigacom" name="author" />
</head>


<body>




































<div id="content">
<div id="main">
	
<div id="right">
	
<div id="header">
	
<div style="font-style: italic; font-family: Comic Sans MS;" id="logo"><big>
		
</big>
<h1><big><big><a href="../index.html"><br />














</a></big></big></h1>





















<big>














		





	</big></div>




































	
<div id="menu">
		
<ul>




































			<li id="button1"><a href="../gambiarra/a_gambiarra.html" title="">Gambiarra</a></li>




































			<li id="button2"><a href="a_oficina.html" title="">Oficina do Giga</a></li>




































			<li id="button3"><a href="../necroterio/a_necroterio.html" title="">Necrot&eacute;rio</a></li>




































			<li id="button4"><a href="../deunarevista/a_deunarevista.html" title="">Deu na revista!</a></li>




































			<li id="button5"><a target="_blank" href="http://gigacom.freeforums.org/index.php" title="">Trombone</a></li>




































		
</ul>




































	</div>




































	</div>




































	
<h4 style="font-weight: bold;">Entendendo o Dreamcast<br />






</h4>









<p style="font-weight: bold;"><img style="width: 77px; height: 79px; float: left;" alt="" src="../images/avatares/avatar_gigacom.jpg" hspace="3" /><span style="font-weight: bold;">:::.</span><span style="font-style: italic;"> Por Gigacom</span></p>









<p style="text-align: justify;"><span style="font-weight: normal;"></span></p>


<p style="text-align: justify;"><span style="font-weight: normal;"></span></p>


<p style="text-align: justify;"><span style="font-weight: normal;">&Eacute;
muito &uacute;til saber como foi projetado um console, e conhecer bem
as pe&ccedil;as dele antes de fazer qualquer manuten&ccedil;&atilde;o,
seja ela uma simples limpeza, ou mesmo troca de algum componente do
hardware. Ent&atilde;o, vou explicar aqui da melhor forma
poss&iacute;vel, como o Dreamcast pode ser desmontado e reparado, sem
ser danificado, assim como as principais fun&ccedil;&otilde;es de cada
componente.</span></p>



<p style="font-weight: bold; text-decoration: underline; text-align: justify;"><span style="font-weight: normal;">Pe&ccedil;as internas e desmontagem</span></p>



<p style="text-align: justify;"><span style="font-weight: normal;">Quem
j&aacute; mexeu com montagem de computador, pode ter percebido algumas
coisas simples que s&atilde;o padr&otilde;es nos hardwares de
computadores, como por exemplo, uma regrinha de ouro que diz: cada
pe&ccedil;a tem somente uma maneira de se encaixar, e o proprio encaixe
impossibilita que ele seja feito de maneira errada. &Eacute; aquele
negocio, se voc&ecirc; vai conectar o cabo de dados de um HD SATA ou
IDE, ele s&oacute; vai entrar no HD da forma correta, n&atilde;o
adianta for&ccedil;ar o cabo ou o conector, ele n&atilde;o vai entrar,
ou ent&atilde;o vai se estripular todo! A mesma coisa ocorre no Dream,
ou seja, cada pe&ccedil;a tem o local de seu encaixe, e a pe&ccedil;a
s&oacute; encaixa de uma maneira.</span></p>



<p><span style="font-weight: normal;">As pe&ccedil;as de encaixe no Dream, por ordem de desmontagem, s&atilde;o:</span></p>



<p align="center" style="text-align: justify;"><span style="font-weight: normal;"><span style="font-weight: bold; text-decoration: underline;">Fonte:</span>
&eacute; uma placa com diversos capacitores, que possui na extremidade
que fica na traseira do console a entrada para o cabo de energia, e um
plugue para conectar o switch liga/desliga do console. Na outra
extremidade, h&aacute; um plugue plastico com 6 pontos, sendo que 3
pontos desses tem uma voltagem especifica (3,3V, 5V e 12V) e outros três
servem de terra (ground). Para remover a fonte, &eacute;
necess&aacute;rio retirar dois parafusos que a encaixam (um em cada
ponta da placa), em seguida &eacute; preciso retirar o plugue do swicht
liga/desliga, e remover a placa puxando-a para cima. Nunca a remova
puxando s&oacute; um dos lados! Isso pode quebrar o plugue plastico que
liga a placa ao console, ou mesmo quebrar os pinos da placa m&atilde;e
que se conectam &agrave; fonte!!!</span></p>

<div align="center">
  <table style="width: 0px; text-align: left; margin-left: auto; margin-right: auto;" border="1" cellpadding="2" cellspacing="2">
    
    <tbody>
      
      <tr>
        
        <td nowrap="nowrap"><img style="border: 3px solid ; width: 488px; height: 170px;" alt="" src="imagens/dreamcast_desmontado_02.jpg" /></td>
    </tr>
      
      <tr style="color: rgb(255, 0, 0);" align="center">
        
        <td nowrap="nowrap"><span style="font-weight: bold;">Fonte do Dreamcast. Notar o fusivel ao lado da entrada do cabo de energia.</span><br style="font-weight: bold;" />
          
          <span style="font-weight: bold;">Quando queima, &eacute;&nbsp;facil substitu&iacute;-lo.</span> </td>
    </tr>
      </tbody>
  </table>
</div>
<p style="text-align: justify;"><span style="font-weight: normal;"></span></p>



<p style="text-align: justify;"><span style="font-weight: normal;"><span style="font-weight: bold; text-decoration: underline;">Drive de CD/GD rom:</span>
&eacute; uma pe&ccedil;a constitu&iacute;da pelo leitor de CD/GD disc,
uma placa controladora que monitora e executa as fun&ccedil;&otilde;es
do drive pedidas pela CPU do Dream, e uma chapa de metal que molda e
protege todo o dispositivo. Essa chapa de metal &eacute; parafusada em
tr&ecirc;s pontos na chapa de metal que cobre toda a placa m&atilde;e
do console. Basta remover esses parafusos, e puxar o drive para cima,
da mesma forma que a fonte, dessa forma n&atilde;o haver&aacute;
problema algum. Tenha apenas o cuidado de apoiar a parte de cima do
leitor, ela &eacute; solta e presa apenas pelos fios de dados do leitor
que est&atilde;o ligados &agrave; placa controladora.</span></p>

<table style="width: 408px; height: 398px; text-align: left; margin-left: auto; margin-right: auto;" border="1" cellpadding="2" cellspacing="2">

  <tbody>

    <tr>

      <td nowrap="nowrap"><img style="border: 3px solid ; width: 389px; height: 339px;" alt="" src="imagens/dreamcast_desmontado_01.jpg" /></td>

    </tr>

    <tr style="color: rgb(255, 0, 0);" align="center">

      <td nowrap="nowrap"><span style="font-weight: bold;">O drive de CD/GD do Dreamcast. Remov&ecirc;-lo e instalar de volta<br />

&nbsp;&eacute; simples</span> <span style="font-weight: bold;">como comer algod&atilde;o doce.</span></td>

    </tr>

  
  </tbody>
</table>

<p style="text-align: justify;"><span style="font-weight: normal;"></span></p>



<p style="text-align: justify;"><span style="font-weight: normal;"><span style="font-weight: bold; text-decoration: underline;">Cooler:</span>
&eacute; o ventiladorzinho do Dream, &eacute; o dito cujo que faz o
Dream assobiar feito um curi&oacute; rouco com dor de barriga. Ele tem
um plugue pequeno e meio delicado, que &eacute; ligado &agrave;
plaquinha de entrada dos controles. Desencaixe o plugue que est&aacute;
conectado nessa placa, retire os dois parafusos que prendem o cooler na
parte plastica do Dream, e pronto, n&atilde;o h&aacute; mais nada a se
fazer.</span></p>

<table style="width: 537px; height: 214px; text-align: left; margin-left: auto; margin-right: auto;" border="1" cellpadding="2" cellspacing="2">

  <tbody>

    <tr>

      <td style="text-align: center;" nowrap="nowrap"><img style="border: 3px solid ; width: 169px; height: 147px;" alt="" src="imagens/dreamcast_desmontado_04.jpg" /></td>

      <td nowrap="nowrap"><br />

      </td>

    </tr>

    <tr>

      <td style="text-align: center;" nowrap="nowrap"><img style="border: 3px solid ; width: 473px; height: 169px;" alt="" src="imagens/dreamcast_desmontado_04_1.jpg" /></td>

      <td nowrap="nowrap"></td>

    </tr>

    <tr>

      <td style="text-align: center; color: rgb(255, 0, 0);" nowrap="nowrap"><span style="font-weight: bold;">Cooler do Dreamcast. Essas s&atilde;o imagens da segunda vers&atilde;o do cooler. A primeira era feita</span><br style="font-weight: bold;" />

      <span style="font-weight: bold;">de metal, e ainda mais barulhenta que essa a&iacute;</span><img style="width: 15px; height: 15px; font-weight: bold;" alt="" src="../images/icones/icon_confused.gif" hspace="1" /><span style="font-weight: bold;">.</span></td>

      <td nowrap="nowrap"></td>

    </tr>

  
  </tbody>
</table>

<p style="text-align: justify;"><span style="font-weight: normal;"></span></p>



<p align="center" style="text-align: justify;"><span style="font-weight: normal;"><span style="font-weight: bold; text-decoration: underline;">Placa de entrada dos controles:</span>
principal causa de muitos problemas no Dream... essa plaquinha tem
diversas func&otilde;es. Al&eacute;m de servir de ponto de entrada para
os quatro controles, ela &nbsp;possui o led que indica se o Dream
est&aacute; ligado ou n&atilde;o, tem uma bateria ML2032 que serve para
alimentar a BIOS do console para que este n&atilde;o perca as
configura&ccedil;&otilde;es iniciais e de data e hora, e tambem
&eacute; a respons&aacute;vel pelo contato do cooler &agrave; CPU,
servindo de ponte entre ambos. Essa plaquinha costuma apresentar
problemas com frequ&ecirc;ncia... mas geralmente, s&oacute; realizando
a substitui&ccedil;&atilde;o dela &eacute; que se resolve os porblemas
todos de forma eficaz... mas h&aacute; outros meios que vou comentar em
outros artigos. Para remov&ecirc;-la, puxe o cabo flat (o cabo branco
achatado) da placa m&atilde;e do Dream. Puxe com cuidado, apoiando os
dedos na parte plana do cabo.</span></p>

<div align="center">
  <table style="width: 0px; text-align: left; margin-left: auto; margin-right: auto;" border="1" cellpadding="2" cellspacing="2">
    
    <tbody>
      
      <tr>
        
        <td nowrap="nowrap"><img style="border: 3px solid ; width: 383px; height: 144px;" alt="" src="imagens/dreamcast_desmontado_03.jpg" /></td>
    </tr>
      
      <tr align="center">
        
        <td nowrap="nowrap"><span style="font-weight: bold; color: rgb(255, 0, 0);">Plaquinha de entrada dos controles. A pe&ccedil;a em azul &eacute; a bateria, que &eacute;</span><br style="font-weight: bold; color: rgb(255, 0, 0);" />
          
          <span style="font-weight: bold; color: rgb(255, 204, 0);"><span style="color: rgb(255, 0, 0);">respons&aacute;vel por alimentar a BIOS e salvar as configura&ccedil;&otilde;es do Dream</span>.</span></td>
    </tr>
      </tbody>
  </table>
</div>
<p style="text-align: center;"><span style="font-weight: normal;"></span></p>



<p align="center" style="text-align: justify;"><span style="font-weight: normal;"><span style="font-weight: bold; text-decoration: underline;">Placa m&atilde;e:</span> e eis que chegamos ao c&eacute;rebro e principais org&atilde;os do console.
A placa m&atilde;e do Dream &eacute; coberta por uma chapa de zinco.
Essa chapa além de servir como dissipador de calor, serve para evitar que o aparelho emita ou receba qualquer
tipo de radia&ccedil;&atilde;o que possa provocar o mal funcionamento
do console, ou de outros aparelhos eletr&ocirc;nicos que n&atilde;o
sejam o Dreamcast. Na verdade, a exist&ecirc;ncia de uma
prote&ccedil;&atilde;o como essa &eacute; exigida pelas leis de
diversos pa&iacute;ses, principalmente as r&iacute;gidas leis
americanas (a FCC &eacute; que regula essas normas por l&aacute;). Como
a chapa &eacute; bem grande, ela &eacute; presa em diversos pontos por
parafusos. Remov&aacute;-os todos, e retire essa chapa de metal
levantando-a para cima com cuidado. A placa sai facilmente,
por&eacute;m se ela n&atilde;o estiver sa&iacute;ndo, certifique-se de
que n&atilde;o h&aacute; nenhum parafuso a prendendo no pl&aacute;stico
do console. Ap&oacute;s remover a chapa de metal superior, voc&ecirc;
ver&aacute; a placa m&atilde;e, e logo abaixo uma outra chapa de metal
que j&aacute; dever&aacute; estar solta. Essas chapas cobrem toda a
placa m&atilde;e, ficando esta como um hamburguer dentro de um
sandu&iacute;che do Big Mac.<br />



Para encaixar todas as pe&ccedil;as novamente, &eacute; s&oacute;
seguir o processo inverso de desmontagem (meio &oacute;bvio n&eacute;? <img style="width: 15px; height: 17px;" alt="" src="../images/icones/icon_rolleyes.gif" /> ).</span></p>

<div align="center">
  <table style="width: 0px; text-align: left; margin-left: auto; margin-right: auto;" border="1" cellpadding="2" cellspacing="2">
    
    <tbody>
      
      <tr align="center">
        
        <td nowrap="nowrap"><a href="imagens/dreamcast_desmontado_05.jpg"><img style="border: 2px solid ; width: 461px; height: 346px;" alt="" src="imagens/dreamcast_desmontado_05_1.jpg" /></a></td>
    </tr>
      
      <tr style="color: rgb(255, 0, 0);" align="center">
        
        <td nowrap="nowrap"><span style="font-weight: bold;">Placa m&atilde;e, a alma do Dream. Os processadores nessa foto est&atilde;o sem as borrachas</span><br style="font-weight: bold;" />
          
          <span style="font-weight: bold;">t&eacute;rmicas, responsaveis por auxiliar a passar o calor, para a chapa de metal que a cobre</span><br style="font-weight: bold;" />
          
          <span style="font-weight: bold;">e tambem serve de dissipador de calor.</span></td>
    </tr>
      
      <tr align="center">
        
        <td nowrap="nowrap"><img style="border: 3px solid ; width: 234px; height: 217px;" alt="" src="imagens/dreamcast_desmontado_06.jpg" /></td>
    </tr>
      
      <tr>
        
        <td nowrap="nowrap">
          
          <div style="text-align: center; font-weight: bold; color: rgb(255, 204, 0);"><span style="color: rgb(255, 0, 0);">Close da CPU e GPU do Dream. Nesta foto as borrachas* t&eacute;rmicas </span><br style="color: rgb(255, 0, 0);" />
            <span style="color: rgb(255, 0, 0);">
              n&atilde;o foram removidas.</span><br />
            </div>
    
      <br />
          
          
          <div style="text-align: justify;">
            <div align="justify"></div>
          </div>      </td>
    </tr>
      </tbody>
  </table>
</div>
<p style="text-align: justify;"><span style="font-weight: normal;"></span>** n&atilde;o s&atilde;o bem borrachas... &eacute; um material molenga que se desfaz &agrave; toa. A import&acirc;ncia dele &eacute; vital para o funcionamento do console. Sem isso, o aparelho fica resetando sozinho por
conta do superaquecimento. O nome desta borracha é elastômero térmico, e é bastante conhecido no mercado como adesivo térmico. </p>



<p style="text-align: justify;"><span style="font-weight: normal;"><span style="font-weight: bold; text-decoration: underline;">Partes pl&aacute;sticas</span></span></p>



<p style="text-align: justify;"><span style="font-weight: normal;">O
pl&aacute;stico do Dream &eacute; do tipo ABS injetado em molde,
possuindo grande resist&ecirc;ncia &agrave; impactos, calor e
arranh&otilde;es (t&aacute;, nem tanto para arranh&otilde;es).
Infelizmente, esse pl&aacute;stico tem o horrivel costume de amarelar
com o tempo... isso ocorre por rea&ccedil;&otilde;es quimicas que
acontecem com o pl&aacute;stico quando este entra em contato com
sujeira, e recebe algum tipo de radia&ccedil;&atilde;o, como a UV
(ultra violeta). Traduzindo: se voc&ecirc; pegar um Dream, e
abandon&aacute;-lo na beira de uma janela, quando ele acumular poeira e
receber a luz do sol, depois de uns dias ele vai t&aacute; t&atilde;o
amarelo que at&eacute; macaco vai pensar que &eacute; uma banana
gigante <img style="width: 15px; height: 15px;" alt="" src="../images/icones/icon_confused.gif" />&nbsp;.</span></p>



<p style="text-align: justify;"><span style="font-weight: normal;">&Eacute;
meio complicado remover esse amarel&atilde;o... uma lavagem costuma
ajudar, mas nem sempre d&aacute; o resultado esperado. Mas n&atilde;o
vamos falar sobre isso agora, pois voc&ecirc; pode ver dicas de limpeza
do Dream clicando aqui. O mais importanta a saber &eacute; que, depois
do Dream ser desmontado, os buracos onde os parafusos das placas
s&atilde;o colocados, podem quebrar facilmente, pois ficam
frag&eacute;is com o tempo. Tambem na tampa do drive de CD, tem algumas
molas e pe&ccedil;as de metal que servem de trava e sistema de
engrenagem para levantar e fechar a tampa. Voc&ecirc; pode remover
essas pe&ccedil;as se quiser, mas n&atilde;o recomendo (pois &eacute;
um saco coloc&aacute;-las de volta no lugar).</span></p>



<p style="text-align: justify;"><span style="font-weight: normal;">A
pior coisa que pode acontecer nessas pe&ccedil;as, &eacute; alguma
delas quebrar... como s&atilde;o pe&ccedil;as que trabalham sob
constante press&atilde;o, super bond nem sempre costuma ser eficaz nos
reparos, exigindo uma cirurgia para arrumar tudo de fato <img style="width: 15px; height: 17px;" alt="" src="../images/icones/icon_lol.gif" />
. &Eacute; s&eacute;rio, tem como fazer isso! &nbsp;Mas tambem
n&atilde;o vou falar sobre agora (estamos conversando apenas sobre como
funciona o Dream basicamente).</span></p>



<p style="text-align: justify;"><span style="font-weight: normal;"><span style="font-weight: bold; text-decoration: underline;">Parafusos</span></span></p>







<p style="text-align: justify;"><span style="font-weight: bold;"> </span>Quando
voc&ecirc; for desmontat um Dream, procure memorizar onde fica cada
parafuso, e separ&aacute;-los conforme os tira de cada lugar. Isso digo
porque nem todos os parafusos s&atilde;o do mesmo tamanho ou cor.
Alguns mais curtos geralmente n&atilde;o s&atilde;o pintados, e
s&atilde;o usados apenas para prender a chapa do drive de CD/GD
&agrave; chapa de metal da placa m&atilde;e... outros prendem apenas o
cooler. Portanto, quando for desmontar um Dream, deixe os parafusos que
prendem cada componente junto com eles, para n&atilde;o dar problema na
hora da montagem.<br />

</p>



<p style="text-align: justify;">&Eacute; isso pessoal. Basicamente o
que foi dito acima &eacute; o suficiente para ajudar qualquer um com um
m&iacute;nimo de ju&iacute;zo na cabe&ccedil;a, a como desmontar o
Dream sem lascar com alguma coisa dele. Vale lembrar que para todo e
qualquer tipo de reparo, &eacute; necess&aacute;rio utilizar as
ferramentas adequadas. &nbsp;Use chaves philips que se encaixem
perfeitamente em cada parafuso, n&atilde;o force e nem use algo maior
ou menor do que o necess&aacute;rio, para evitar danos aos parafusos e
demais problemas. Procure fazer a desmontagem em uma mesa grande e sem
pano ou forro. Uma mesa de granito ou madeira, &eacute; mais que
suficiente. Tenha tambem bastante paci&ecirc;ncia. Leva tempo desmontar
tudo, leva mais tempo para montar de novo, e tudo deve ser feito com
cuidado e aten&ccedil;&atilde;o. Fazendo assim, voc&ecirc;
conseguir&aacute; tratar o seu Dream, e prolongar a sua vida sem
prejudic&aacute;-lo.</p>



<p style="text-align: justify;"></p>
<div style="text-align: center;"><span style="font-weight: bold;">Acesse o <a href="http://gigacom.freeforums.org/index.php" target="_blank">Trombone</a> e comente sobre essa mat&eacute;ria!</span></div>
<p style="text-align: justify;">
</p>










<br />










<br />




























<div style="clear: both;">
	</div>






































	</div>




































	
<div id="left">
	
<div id="left_top"><br />







</div>




































	
			
<div style="text-align: center;"><big><a href="../index.html"><big><span style="font-weight: bold; font-style: italic; text-decoration: underline;"></span></big></a></big>
























				<big><img style="width: 200px; height: 20px;" alt="" src="../images/botoes/indice.png" /><br />









<br />









<a href="../index.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/home.png" /></a><br />









</big><a href="../artigosdiversos/a_artigosdiversos.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/diversos.png" /></a><br />









<br />









<a href="../deunarevista/a_deunarevista.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/deunarevista.png" /></a><br />









<a href="../gambiarra/a_gambiarra.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/gambiarra.png" /></a><br />









<a href="../necroterio/a_necroterio.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/necroterio.png" /></a><br />









<a href="a_oficina.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/oficina.png" /></a><br />











<a href="http://gigacom.freeforums.org/index.php"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/trombone.png" /></a><br />









<br />











<a href="../8bits/a_8bits.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/8bits.png" /></a><br />











<a href="../16bits/a_16bits.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/16bits.png" /></a><br />











<a href="../32bits/a_32bits.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/3264bits.png" /></a><br />











<a href="../portateis/a_portateis.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/portateis.png" /></a><br />









<br />









<a href="../downloads/a_downloads.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/downloads.png" /></a><br />











<a href="../links/a_links.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/linksafiliados.png" /></a><br />











<a href="../historico.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/historico.png" /></a><big><a href="../gambiarra/a_gambiarra.html"><big><span style="font-weight: bold; font-style: italic; text-decoration: underline;"></span></big></a></big><br />











<big><a href="../32bits/a_32bits.html"><big><span style="font-weight: bold; font-style: italic; text-decoration: underline;"></span></big></a></big></div>











<br />









<div style="text-align: center;"><img style="width: 200px; height: 20px;" alt="" src="../images/botoes/vertambem.png" /><br />





</div>









<big><big><span style="font-weight: bold; font-style: italic;"></span></big></big>
<div class="comnews">
			
<div class="comnews">
			<a href="../16bits/a_16bits.html#"><span style="font-weight: bold; font-style: italic;">construindo - construindo</span></a>
<span style="font-weight: bold; font-style: italic;">construindo - construindo -</span><span style="font-weight: bold; font-style: italic;">construindo - construindo -</span><span style="font-weight: bold; font-style: italic;">construindo - construindo -</span><span style="font-weight: bold; font-style: italic;">construindo - construindo -</span><span style="font-weight: bold; font-style: italic;">construindo - construindo ...</span><br />





<div style="text-align: right;">&nbsp;<a href="../16bits/a_16bits.html#">leia mais</a></div>





</div>





</div>




































	
<div class="comnews">
			<a href="#"></a><br />





</div>















</div>





























































<div id="footer">
<p>Gigacom Old Games!</p>



















<p>Tudo sobre&nbsp;jogos mais antiguinhos e outras coisitas mais.</p>



















<br />



















</div>



































</div>




































</div>




































<!-- footer ends-->
</body>
</html>
