<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>





















































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <meta http-equiv="content-type" content="text/html; charset=UTF-8" />






















































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <title>Gigacom Old Games!</title>
  <meta name="keywords" content="" />





















































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <meta name="description" content="Tudo sobre jogos e video games antigos" />





















































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <link href="styles.css" rel="stylesheet" type="text/css" media="screen" />



















































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <meta content="Gigacom" name="author" />
  <style type="text/css">
<!--
.style1 {
	color: #FF0000;
	font-weight: bold;
}
-->
  </style>
</head>


<body>





















































<div id="content">
<div id="main">
	
<div id="right">
	
<div id="header">
	
<div style="font-style: italic; font-family: Comic Sans MS;" id="logo"><big>
		
</big>
<h1><big><big><a href="../index.html"><br />































</a></big></big></h1>






































<big>	</big></div>





















































	
<div id="menu">
		
<ul>





















































			<li id="button1"><a href="../gambiarra/a_gambiarra.html" title="">Gambiarra</a></li>





















































			<li id="button2"><a href="a_oficina.html" title="">Oficina do Giga</a></li>





















































			<li id="button3"><a href="../necroterio/a_necroterio.html" title="">Necrot&eacute;rio</a></li>





















































			<li id="button4"><a href="../deunarevista/a_deunarevista.html" title="">Deu na revista!</a></li>





















































			<li id="button5"><a target="_blank" href="http://gigacom.freeforums.org/index.php" title="">Trombone</a></li>
</ul>
	</div>
	</div>





















































	
<h4 style="font-weight: bold;">Sega CD - Trocando o leitor ótico <br />
</h4>















































<p style="text-align: justify; font-weight: bold; font-style: italic;"><img style="width: 77px; height: 79px; float: left;" alt="" src="../images/avatares/avatar_gigacom.jpg" hspace="3" />:::. <span style="text-decoration: underline;">Por Gigacom</span>-
O primeiro SEGA CD que tive comprei por uma bagatela, bem baratinho
(nem lembro quanto foi de t&atilde;o barato), por&eacute;m o Sega CD
j&aacute; veio com defeito, n&atilde;o lia CD algum, por isso foi
barato... ent&atilde;o me desafiei a arrumar esse console. E n&atilde;o
&eacute; que consegui? Saiba agora o que fazer para dar novos olhos
&agrave; esse aparelho!<span style="font-weight: normal;"><span style="font-weight: bold;"></span></span><span style="font-style: italic;"></span></p>









<p style="font-weight: bold; text-align: center;"><span style="font-weight: normal;">_________________________________________________________________________________</span></p>









<p style="text-align: justify;"><span style="font-weight: normal;">Ha
muito tempo atr&aacute;s, possuir um Mega Drive n&atilde;o era coisa
pra qualquer um, ter ent&atilde;o um Mega Drive e um Sega CD ao mesmo
tempo, era coisa que s&oacute; alguns poucos muleques sortudos podiam
experimentar. Ainda hoje o Sega CD &eacute; vendido por a&iacute; por
pre&ccedil;os nada agradav&eacute;is, apesar de acess&iacute;veis.
Todavia, a maior parte dos aparelhos que se encontram no mercado
s&atilde;o muito velhos e n&atilde;o raro j&aacute; est&atilde;o com o
leitor &oacute;tico pelas ultimas.</span></p>
<p style="text-align: justify;"><span style="font-weight: normal;">A
boa noticia &eacute; que tem como trocar o leitor &oacute;tico do Sega
CD sem muita dificuldade, bastando de antem&atilde;o saber qual o
modelo do leitor que est&aacute; no seu SCD e
troc&aacute;-lo por outro novo.H&aacute; dois modelos de unidades, uma
&eacute; a KSS-240a, fabricado pela Sony, e a outra que n&atilde;o
costuma aparecer muito por a&iacute; &eacute; a Samsung SOH-04t . Eu
particularmente suspeito que o leitor da Samsung seja uma copia do
leitor da Sony (eles s&atilde;o iguaizinhos!). H&aacute; ainda um outro
modelo de unidade &oacute;tica que pode aparecer, que &eacute; a KSS-200a/b
(tambem muito parecida com as outras).</span></p>
<div style="text-align: center;">
  <p><span style="font-weight: normal;"><img style="width: 212px; height: 181px;" alt="" src="imagens/scd_ceguin_00.jpg" /></span><br />
      <span style="font-weight: normal;"><span style="font-weight: bold; color: rgb(204, 0, 0);">Leitor KSS-240a, é o mais comum e o</span></span><span style="font-weight: normal;"><span style="font-weight: bold; color: rgb(204, 0, 0);">pre&ccedil;o dela gira em torno duns R$30,00</span></span><br />
        <span style="font-weight: normal;"></span></p>
  </div>
<p style="text-align: justify;"><span style="font-weight: normal;"><br />
Via de regra, a maior parte dos SCDs usam a KSS-240a. &Eacute; possivel
identificar o modelo do leitor do seu SCD olhando apenas a label que
sempre vem grudada no leitor mostrando qual &eacute; o modelo dele. Mas
se essa label n&atilde;o estiver presente, voc&ecirc; pode simplesmente
comparar a sua unidade com uma das citadas acima. </span></p>
<p style="text-align: justify;"><span style="font-weight: normal;">De
qualquer forma, n&atilde;o ha mais a fabrica&ccedil;&atilde;o dessas
unidades pelas empresas que as criaram, s&oacute; &eacute;
poss&iacute;vel encontrar no Brasil vers&otilde;es alternativas
fabricadas na China, mas que normalmente funcionam sem muito problema,
por&eacute;m o formato do leitor &oacute;tico pode ser diferente do que
est&aacute; no seu SCD, apesar de o modelo ser o mesmo. No meu caso, comprei um leitor xing-ling por 27 reais, mas ao tentar encaix&aacute;-lo na unidade vi que
o leitor n&atilde;o entrava bem no espa&ccedil;o vazio onde </span>estava o outro leitor. A solução foi cerrar a base de metal com uma serra elétrica em uma extremidade para poder encaixar o leitor (solução meio bruta, mas funciona), infelizmente não havia outra alternativa.</p>
<p style="text-align: justify;">A troca em si não tem mistério, tira-se o leitor com defeito, substitui pelo novo. Porém há três detalhes importantissimos nessa operação:</p>
<p style="text-align: justify;"><strong>1º NUNCA</strong>, repito, <strong>NUNCA</strong> toque os contatos eletricos do leitor! Veja, se num leitor original tocar os condutores, partes eletricas e não isoladas do leitor já compromete o funcionamento dele, imagine se fizer isso num treco xing-ling. Pois é, a maior parte das pessoas que se aventuram a trocar o leitor ótico de qualquer coisa, acabam por inutilizar o leitor novo por conta disso. A causa é que esse dispositivo é extremamente sensível à descargas eletricas, que tambem podem ocorrer por estática. Portanto, fica a dica, na hora que for comprar o leitor na loja, tome cuidado para tocar somente nas partes de plástico do leitor.</p>
<p style="text-align: justify;"><strong>2º Todo leitor ótico de CD</strong>, não importa qual seja o aparelho, <strong>vem com uma solda de proteção</strong> que liga o terra à corrente, antes que esta passe pelo circuito do leitor. Essa solda de proteção é para evitar que ocorra danos justamente pelo que falei logo acima. É preciso remover essa solda antes de ligar o aparelho com o leitor novo, senão o mesmo nunca irá funcionar. No caso dos leitores KSS 240a, a solda fica justamente onde está indicado na imagem abaixo:</p>
<p align="center" style="text-align: center;"><span class="style1"><img src="imagens/scd_ceguin_01.jpg" alt="" width="311" height="269" /> </span></p>
<p align="center" class="style1" style="text-align: center;">A solda de segurança fica justamente no meio desses dois pontos de solda.</p>
<p align="justify" style="text-align: justify;">Só é preciso remover o excesso de solda que liga esses dois pontos. Removendo, o leitor estará apto a funionar no aparelho.</p>
<p align="justify" style="text-align: justify;"><strong>3º NUNCA</strong>, nem que sua mãe lhe ameace de dar uma surra com uma havaina de pau, <strong>NUNCA</strong> mexa nos trimpots do Sega CD e do leitor! Para quem não sabe, trimpots são potenciometros regulavéis, e no Sega CD há trimpots parecidos com parafusos amarelos soldados na placa mãe e no leitor. Eles são os responsáveis por regular a potência e o foco do leitor, mas esses valores não se alteram se o modelo do leitor ótico for o mesmo. Em raros casos, se mexe nesses reguladores para auxiliar o leitor a continuar funcionando quando este já dá sinais de cansaço (sinais pessoal, apenas sinais, quando o Sega CD já não está lendo nada direito, o jeito é trocar o leitor ótico, não há outro remédio). Não recomendo mexer neles pois eles são de dificil regulagem, e da forma como vem de fabrica, já estão ideais para funcionar da melhor forma possivel. Caso você já tenha feito a merda de desrregular essas belezinhas, leia o artigo <a href="oficina_scd_configurando_unidade_otica.html">Sega CD - Ajustando a unidade ótica</a> aqui tambem na seção Oficina. </p>
<p style="text-align: justify;">Seguindo essas dicas, não há muito mais o que falar. O negocio é trocar, e por para funcionar. Claro, pode ser que você dê o azar (como quase todo mundo) de comprar um leitor que não esteja bom. Como falei no inicio, o KSS 240a só é fabricado por empresas xing-ling, e são feitos com uma qualidade pra lá de duvidosa. Então, evite comprar esses leitores em sites da internet, ao invés disso, procure uma loja de eletrônica em sua cidade. Acredite, por maior ou menor que seja a tribo onde você vive, sempre há uma loja de eletrônica escondida em alguma rua obscura do comércio local. Essas unidades tambem são bastante comuns (graças a Deus, a Sony conseguiu colocar ela em uma penca de aparelhos de som) e portanto não são dificeis de se comprar. Comprando em uma loja, você poderá trocar o leitor facilmente caso ele não funcione. E só para reforçar, a maior parte das pessoas dá o azar de comprar um leitor estragado... eu já vi pelo menos umas 5 pessoas dando esse azar, inclusive eu. Aliás, até hoje não vi um cristão que conseguisse comprar logo de cara um leitor bom... </p>
<p style="text-align: justify;">Em caso de duvidas, ou caso você queira algum socorro, acesse o trombone, que conversamos por lá. </p>
<p style="font-weight: bold; text-align: center;"><big><big><span style="font-weight: bold; color: rgb(255, 0, 0); text-decoration: underline;"></span></big></big><big><big><span style="font-weight: bold; color: rgb(255, 0, 0); text-decoration: underline;"></span></big></big></p>







<p style="font-weight: bold; text-align: center;"><span style="font-weight: bold;">Acesse o <a href="http://gigacom.freeforums.org/index.php" target="_blank">Trombone</a> e comente sobre essa mat&eacute;ria!</span></p>























  <big><span style="font-weight: bold;"></span></big>	</div>





















































	
<div id="left">
	
<div id="left_top"><br />
























</div>





















































	
			
<div style="text-align: center;"><big><a href="../index.html"><big><span style="font-weight: bold; font-style: italic; text-decoration: underline;"></span></big></a></big>
























				<big><img style="width: 200px; height: 20px;" alt="" src="../images/botoes/indice.png" /><br />


























<br />


























<a href="../index.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/home.png" /></a><br />


























</big><a href="../artigosdiversos/a_artigosdiversos.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/diversos.png" /></a><br />


























<br />


























<a href="../deunarevista/a_deunarevista.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/deunarevista.png" /></a><br />


























<a href="../gambiarra/a_gambiarra.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/gambiarra.png" /></a><br />


























<a href="../necroterio/a_necroterio.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/necroterio.png" /></a><br />


























<a href="a_oficina.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/oficina.png" /></a><br />




























<a href="http://gigacom.freeforums.org/index.php"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/trombone.png" /></a><br />


























<br />




























<a href="../8bits/a_8bits.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/8bits.png" /></a><br />




























<a href="../16bits/a_16bits.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/16bits.png" /></a><br />




























<a href="../32bits/a_32bits.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/3264bits.png" /></a><br />




























<a href="../portateis/a_portateis.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/portateis.png" /></a><br />


























<br />


























<a href="../downloads/a_downloads.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/downloads.png" /></a><br />




























<a href="../links/a_links.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/linksafiliados.png" /></a><br />




























<a href="../historico.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/historico.png" /></a><big><a href="../gambiarra/a_gambiarra.html"><big><span style="font-weight: bold; font-style: italic; text-decoration: underline;"></span></big></a></big><br />




























<big><a href="../32bits/a_32bits.html"><big><span style="font-weight: bold; font-style: italic; text-decoration: underline;"></span></big></a></big></div>




























<br />


























<div style="text-align: center;"><img style="width: 200px; height: 20px;" alt="" src="../images/botoes/vertambem.png" /><br />






















</div>


























<big><big><span style="font-weight: bold; font-style: italic;"></span></big></big>
<div class="comnews">
			
<div class="comnews">
			<span style="font-weight: bold; font-style: italic; text-decoration: underline;">Restaurando controle de SNES</span><span style="font-weight: normal;"><br />









 Aqui, vou apresentar a
restaura&ccedil;&atilde;o de um controle de SNES que comprei em p&eacute;ssimo
estado numa feirinha da minha cidade, e que agora est&aacute; lindinho
funcionando perfeitamente. Confira as dicas, e fa&ccedil;a uma
restaura&ccedil;&atilde;o voc&ecirc; tamb&eacute;m<img style="width: 15px; height: 15px;" alt="" src="../images/icones/icon_biggrin.gif" hspace="2" />.</span>
















&nbsp;<br />







<div style="text-align: right;"><a href="oficina_restaurar_controle_snes.html">leia mais</a><br />







</div>







<br />







<span style="font-weight: bold; font-style: italic;">Restaurando um controle de PSX</span><br />







Peguei o mais feinho e judiado dos
controles para fazer esse artigo. O coitado estava encardido na parte
de cima, e debaixo dele encontrei arranh&otilde;es nas partes de apoio
da m&atilde;o, e bastante sujeira acumulada nas inscri&ccedil;&otilde;es.
O conector do cabo estava muito arranhado e sujo tambem, o cabo
ent&atilde;o nem se fala... sujava a m&atilde;o s&oacute; de pegar














<div style="text-align: right;">&nbsp;<a href="oficina_psx_restaurar_controle.html">leia mais</a><br />







<br />







</div>






















</div>






















</div>





















































	
<div class="comnews">
			<a href="#"></a><br />






















</div>
































</div>














































































<div id="footer">
<p>Gigacom Old Games!</p>




































<p>Tudo sobre&nbsp;jogos mais antiguinhos e outras coisitas mais.</p>




































<br />




































</div>




















































</div>





















































</div>





















































<!-- footer ends-->
</body>
</html>
