<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>



















































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <meta http-equiv="content-type" content="text/html; charset=UTF-8" />




















































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <title>Gigacom Old Games!</title>
  <meta name="keywords" content="" />



















































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <meta name="description" content="Tudo sobre jogos e video games antigos" />



















































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <link href="styles.css" rel="stylesheet" type="text/css" media="screen" />

















































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <meta content="Gigacom" name="author" />
</head>


<body>



















































<div id="content">
<div id="main">
	
<div id="right">
	
<div id="header">
	
<div style="font-style: italic; font-family: Comic Sans MS;" id="logo"><big>
		
</big>
<h1><big><big><a href="../index.html"><br />





























</a></big></big></h1>




































<big>














		





	</big></div>



















































	
<div id="menu">
		
<ul>



















































			<li id="button1"><a href="../gambiarra/a_gambiarra.html" title="">Gambiarra</a></li>



















































			<li id="button2"><a href="a_oficina.html" title="">Oficina do Giga</a></li>



















































			<li id="button3"><a href="../necroterio/a_necroterio.html" title="">Necrot&eacute;rio</a></li>



















































			<li id="button4"><a href="../deunarevista/a_deunarevista.html" title="">Deu na revista!</a></li>



















































			<li id="button5"><a target="_blank" href="http://gigacom.freeforums.org/index.php" title="">Trombone</a></li>



















































		
</ul>



















































	</div>



















































	</div>



















































	
<h4 style="font-weight: bold;">PSX - Como restaurar a apar&ecirc;ncia de um joystick<br />





















</h4>





















<p style="font-weight: bold; text-align: justify; font-style: italic;"><img style="width: 77px; height: 79px; float: left;" alt="" src="../images/avatares/avatar_gigacom.jpg" hspace="3" />Por Gigacom</p>











<p style="font-weight: bold; text-align: justify; font-style: italic;"></p>











<p style="font-weight: bold; text-align: justify;"><span style="font-weight: normal;"></span></p>








<p style="text-align: justify; font-style: italic; font-weight: bold;"><span style="font-weight: normal;"><span style="font-weight: bold;">A primeira vez em que joguei num Playstation foi bem na &eacute;poca do
inicio da carreira dele, no fim de 1995. Algumas poucas locadoras de
video games possu&iacute;am esse console, que diga-se de passagem, n&atilde;o
era dos mais baratos se comparado com o Meguinha e SNES que dominavam a
cena</span><img style="width: 15px; height: 15px; font-weight: bold;" alt="" src="../images/icones/icon_loser.gif" hspace="1" /><span style="font-weight: bold;">. A primeira vez em que joguei no cinz&atilde;o, foi com aquele
primeiro controlinho bem simples, mas com um visual diferente de tudo
at&eacute; ent&atilde;o. Esse controle n&atilde;o possui os direcionais
anal&oacute;gicos que mais tarde viraram o padr&atilde;o da
s&eacute;rie Playstation, tambem n&atilde;o possui dispositivo algum
para fazer o joystick vibrar. Ele &eacute; menor, bem mais leve e bem
mais dificil de se achar por a&iacute; que o Dualshock.</span></span></p>






<p style="text-align: justify; font-weight: bold; font-style: italic;">Enfim, lembrando daqueles longiquos
anos, fui procurar um Playstation exatamente igual &agrave;quele que
jogava de vez em quando na locadora, e felizmente dei a sorte de achar
um, meio amarelado &eacute; claro... mas que possu&iacute;a dois daqueles
controlinhos pra jogar. Quando o pacote chegou em casa, vi que os
controles nunca foram limpos! Ou seja, a nhaca e sujeira de mais de 15
anos esteve acumulada ali sem que ninguem tivesse a desc&ecirc;ncia de
limpar<img style="width: 15px; height: 15px;" alt="" src="../images/icones/icon_ooooh.gif" hspace="1" />, mas como agora eles vieram parar nas minhas m&atilde;os,
n&atilde;o deu outra, foram direto para a mesa branca receber a devida
higi&ecirc;niza&ccedil;&atilde;o<img style="width: 15px; height: 17px;" alt="" src="../images/icones/icon_mrgreen.gif" hspace="1" />. Acompanhe agora as dicas de como
restaurar esse raro controle<img style="width: 15px; height: 17px;" alt="" src="../images/icones/icon_cool.gif" hspace="1" />.</p>






<p style="text-align: center;">__________________________________________________________________</p>






<p style="text-align: justify;">Peguei o mais feinho e judiado dos
controles para fazer esse artigo. O coitado estava encardido na parte
de cima, e debaixo dele encontrei arranh&otilde;es nas partes de apoio
da m&atilde;o, e bastante sujeira acumulada nas inscri&ccedil;&otilde;es.
O conector do cabo estava muito arranhado e sujo tambem, o cabo
ent&atilde;o nem se fala... sujava a m&atilde;o s&oacute; de pegar:</p>






<p style="text-align: center;"><img style="width: 305px; height: 265px;" alt="" src="imagens/psx_restauracao_controle_00.JPG" /><img style="width: 362px; height: 265px;" alt="" src="imagens/psx_restauracao_controle_01.JPG" /><br />





<span style="font-weight: bold; color: rgb(255, 0, 0);">Ok ok...
n&atilde;o sou o melhor fotografo do mundo, mas d&aacute; pra ver a
sujeira do conector e da traseira do controle numa boa.</span></p>





<p style="text-align: justify;">A primeira parte do processo todo, obvio, &eacute; desmontar o treco. Ha muitas pe&ccedil;as,
bot&otilde;es e parafusos nesses joysticks da Sony, felizmente assim
como ocorre em outros consoles, as pe&ccedil;as se encaixam apenas nos
seus devidos lugares, n&atilde;o ficando em posi&ccedil;&otilde;es
erradas, mas mesmo assim &eacute; preciso aten&ccedil;&atilde;o tanto
na desmontagem como principalmente na montagem.&nbsp;</p>





<p style="text-align: center;"><img style="width: 501px; height: 306px;" alt="" src="imagens/psx_restauracao_controle_02.JPG" /></p>





<p style="text-align: justify;">O cabo n&atilde;o &eacute; do tipo que
se pode desplugar, ele &eacute; soldado na placa do joystick. O meu
conselho aqui &eacute; tomar cuidado para que as soldas n&atilde;o
sejam partidas, pois &eacute; comum em aparelhos eletr&ocirc;nicos
antigos a solda se quebrar ou sair do lugar s&oacute; de mover o
capacitor, fio ou qualquer outra coisa que a solda esteja segurando.
Notar tambem aqui a posi&ccedil;&atilde;o dos fios que ligam os
bot&otilde;es L1R1 e L2R2 &agrave; placa, que passam atr&aacute;s de um
dos pontor onde &eacute; atarrachado os parafusos. Esses fios devem
ficar nesse mesmo lugar na hora de montar novamente o controle.</p>





<p style="text-align: justify;">Voc&ecirc; vai notar tambem que os
bot&otilde;se L1 e R1 ficam grudados &agrave; plaquinha junto com as
borrachinhas de contato por uma pe&ccedil;a de pl&aacute;stico.
&Eacute; possivel remover essa placa, pois ele se encaixa usando apenas
press&atilde;o. Pressione o conector do plastico e remova essa
pe&ccedil;a para ter acesso &agrave;s borrachinhas dos bot&otilde;es L
e R. Na imagem abaixo, o conector &agrave; esquerda ainda est&aacute;
preso &agrave; placa, o da direita j&aacute; foi removido.</p>





<p style="text-align: center;"><img style="width: 503px; height: 320px;" alt="" src="imagens/psx_restauracao_controle_03.JPG" /></p>





<p style="text-align: justify;">Os bot&otilde;es L2 e R2 ficam
parafusados &agrave; parte traseira do controle. N&atilde;o &eacute;
preciso remov&ecirc;-los para realizar a limpeza, mas caso a coisa
esteja feia a&iacute;, desparafuse a pe&ccedil;a de pl&aacute;stico que prende
os bot&otilde;es para retir&aacute;-los. Cuidado apenas para n&atilde;o
perder esses parafusos e nem coloc&aacute;-los em outro lugar. Note que
a cor deles &eacute; dourada, diferente de todos os outros parafusos do
controle.</p>





<p style="text-align: center;"><img style="width: 364px; height: 283px;" alt="" src="imagens/psx_restauracao_controle_04.JPG" /></p>





<p style="text-align: justify;"><span style="font-weight: normal;"></span>Bem...
se voc&ecirc; chegou at&eacute; aqui, ver&aacute; que apesar de
pequeno, ha uma infinidade de pe&ccedil;as que compoem esse joystick.
Claro que a maior cautela nesse trabalho todo &eacute; o cuidado em
manter segura e bem a vista todas as pe&ccedil;as para que nenhuma se
perca. Agora, separe as partes pl&aacute;sticas, os bot&otilde;es e as
borrachas, elas dever&atilde;o ser lavadas para voltarem a ter a
apar&ecirc;ncia devida.</p>






<p style="text-align: center; font-weight: bold; color: rgb(255, 0, 0);"><img style="width: 505px; height: 353px;" alt="" src="imagens/psx_restauracao_controle_05.JPG" /><br />




Contando... uma, duas, tr&ecirc;s...dezenove pecinhas<img style="width: 15px; height: 15px;" alt="" src="../images/icones/icon_eek.gif" hspace="1" />!!! Aaaarr&ecirc;!!!</p>





<p style="text-align: justify;">A parte mais legal de tudo &eacute; a
lavagem mesmo. Aqui n&atilde;o tem segredo, basta usar as mesmas coisas
que sua m&atilde;e usa para limpar o panel&atilde;o de almo&ccedil;o do
domingo e seus dentes cheio de casca de feij&atilde;o preto:
sab&atilde;o, esponja de lavar lou&ccedil;a e uma escovinha velha.</p>





<p style="text-align: justify;">Primeiro, lave a carca&ccedil;a do
controle com bastante &aacute;gua e sab&atilde;o. Use a parte macia da
esponja para tirar as manchas de sujeira, a escovinha para limpar as
reentran&ccedil;as, e a parte aspera da esponja use com cautela mas sem
medo para remover a sujeira dos arranhos mais profundos. Sim meus
caros, n&atilde;o ha sacril&eacute;gio algum nisso, usando a parte
aspera da esponja, voc&ecirc; pode retirar com facilidade toda aquela
sujeira marrom que fica impregnada nos sulcos dos arranhos, pois usando
apenas a escova, essa sujeira n&atilde;o ir&aacute; sair nunca! Na foto
abaixo d&aacute; pra ver com mais clareza o resultado desse processo de
limpeza, principalmente no sumi&ccedil;o da sujeira na parte arranhada
da traseira do controle, veja como ficou bem limpo.</p>





<p style="text-align: center;"><img style="width: 507px; height: 380px;" alt="" src="imagens/psx_restauracao_controle_06.JPG" /><br />





<span style="font-weight: bold; color: rgb(255, 0, 0);">Os arranhos aparentemente at&eacute; somem, mas na verdade eles apenas assumem</span><br style="font-weight: bold; color: rgb(255, 0, 0);" />





<span style="font-weight: bold; color: rgb(255, 0, 0);">a mesma cor do resto do controle, j&aacute; que a sujeira vai embora num instante, lindo n&atilde;o<img style="width: 15px; height: 15px;" alt="" src="../images/icones/icon_peace.gif" hspace="1" />?</span></p>





<p style="text-align: justify;">Agora vem a limpeza dos bot&otilde;es,
borrachas e outras pecinhas. Coloque-as todas em um escorredor de
macarr&atilde;o por exemplo, assim voc&ecirc; poder&aacute; limpar
todas as pe&ccedil;as e enxagu&aacute;-las numa boa, sem medo de que
algo v&aacute; parar no fundo do ralo. Use a parte macia da esponja e a
escova para limpar reentran&ccedil;as, cuidado ao limpar as borrachas,
pois elas se rasgam facilmente, &eacute; melhor at&eacute;
limp&aacute;-las apenas com a ponta dos dedos.</p>





<p style="text-align: center;"><img style="width: 479px; height: 359px;" alt="" src="imagens/psx_restauracao_controle_07.JPG" /></p>





<p style="text-align: justify;">Depois de limpar todas essas
pe&ccedil;as, seque-as bem e deixe de lado por enquanto. Agora &eacute;
a vez da placa do controle receber uma limpeza. Normalmente, depois de
um bom tempo de uso, aparecem umas manchas brancas entre os contatos e
trilhas da placa do controle. Essas manchas podem ser facilmente
removidas utilizando alc&oacute;ol. As borrachas dos bot&otilde;es tambem
costumam soltar um pouco de sujeira em cima da placa, sendo esta a
principal causa de falha do funcionamento dos bot&otilde;es. Para
resolver esse tipo de problema, basta utilizar um pano limpo umedecido
em alcool para remover o excesso de sujeira de cima dos contatos onde
os bot&otilde;es ficam. Para limpar o cabo e o conector do controle o
procedimento &eacute; o mesmo adotado na limpeza do resto,
pegue a esponja, limpe o cabo e tambem o conector, enchague depois.
N&atilde;o se preocupe com &aacute;gua acumulada dentro do conector,
basta que depois voc&ecirc; seque-o bem, sendo que para retirar a
&aacute;gua que fica dentro do conector, basta sacudi-lo batendo em uma
toalha dobrada, voc&ecirc; vai ver que toda a &aacute;gua dentro dele
ir&aacute; sair, e se ainda assim estiver com duvida se ficou algo
l&aacute; dentro, ponha o cabo pra secar perto do sol, mas &agrave;
sombra, que qualquer gota de &aacute;gua vai se evaporar de l&aacute;
rapidinho.</p>





<p style="text-align: center;"><img style="width: 384px; height: 181px;" alt="" src="imagens/psx_restauracao_controle_08.JPG" /></p>






<p style="text-align: center; font-weight: bold; color: rgb(255, 0, 0);">A direita, onde fica o direcional, foi executada&nbsp;a limpeza dos contatos.<br />




Veja a diferen&ccedil;a comparando com o outro lado que n&atilde;o foi limpo.</p>





<p style="text-align: justify;">Tudo limpo e seco, vem agora a
remontagem. Os bot&otilde;es se encaixam apenas nas suas partes
respectivas, por&eacute;m &eacute; preciso prestar
aten&ccedil;&atilde;o nos bot&otilde;es L e R, para que n&atilde;o
fiquem de cabe&ccedil;a para baixo. Lembre-se que acima do bot&atilde;o
direcional, fica uma pe&ccedil;a em formato de X que serve para prender
o direcional no lugar dele.</p>





<p style="text-align: center;"><img style="width: 451px; height: 338px;" alt="" src="imagens/psx_restauracao_controle_09.JPG" /><br />




<span style="font-weight: bold; color: rgb(255, 0, 0);">Os bot&otilde;es nos encaixes. Notar a pecinha em formato de X.</span></p>





<p style="text-align: justify;">Recoloque a placa com cuidado no lugar
dela, assim como os cabos dos bot&otilde;es L e R (veja a foto&nbsp;l&aacute; em cima no inicio
do texto). Parafuse novamente os bot&otilde;es L2 e R2 no lugar deles,
e reencaixe os bot&otilde;es L1 e R1 junto com a borracha na placa do
controle. Remonte tudo, d&ecirc; uma boa olhada para ver se n&atilde;o
ficou nenhuma falha ou folga nos bot&otilde;es, e estando tudo certo
parafuse o controle, e aprecie o resultado.</p>





<p style="text-align: center;"><img style="width: 507px; height: 380px;" alt="" src="imagens/psx_restauracao_controle_10.JPG" /></p>





<p style="text-align: center;"><img style="width: 507px; height: 380px;" alt="" src="imagens/psx_restauracao_controle_11.JPG" /></p>





<p style="text-align: center; font-weight: bold; color: rgb(255, 0, 0);">Enfim, limpinho. At&eacute; parece novo. Vai dizer que n&atilde;o vale a pena dar uma limpada no controle<img style="width: 15px; height: 15px;" alt="" src="../images/icones/icon_peace.gif" hspace="1" />?</p>





<p style="font-weight: bold; text-align: justify;"><span style="font-weight: normal;"><br />





</span></p>






<br />






<p style="font-weight: bold; text-align: center;"><span style="font-weight: bold;">Acesse o <a href="http://gigacom.freeforums.org/index.php" target="_blank">Trombone</a> e comente sobre essa mat&eacute;ria!</span>
</p>





















&nbsp;&nbsp;<big><span style="font-weight: bold;"></span></big>









































	</div>



















































	
<div id="left">
	
<div id="left_top"><br />






















</div>



















































	
			
<div style="text-align: center;"><big><a href="../index.html"><big><span style="font-weight: bold; font-style: italic; text-decoration: underline;"></span></big></a></big>
























				<big><img style="width: 200px; height: 20px;" alt="" src="../images/botoes/indice.png" /><br />
























<br />
























<a href="../index.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/home.png" /></a><br />
























</big><a href="../artigosdiversos/a_artigosdiversos.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/diversos.png" /></a><br />
























<br />
























<a href="../deunarevista/a_deunarevista.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/deunarevista.png" /></a><br />
























<a href="../gambiarra/a_gambiarra.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/gambiarra.png" /></a><br />
























<a href="../necroterio/a_necroterio.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/necroterio.png" /></a><br />
























<a href="a_oficina.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/oficina.png" /></a><br />


























<a href="http://gigacom.freeforums.org/index.php"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/trombone.png" /></a><br />
























<br />


























<a href="../8bits/a_8bits.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/8bits.png" /></a><br />


























<a href="../16bits/a_16bits.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/16bits.png" /></a><br />


























<a href="../32bits/a_32bits.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/3264bits.png" /></a><br />


























<a href="../portateis/a_portateis.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/portateis.png" /></a><br />
























<br />
























<a href="../downloads/a_downloads.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/downloads.png" /></a><br />


























<a href="../links/a_links.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/linksafiliados.png" /></a><br />


























<a href="../historico.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/historico.png" /></a><big><a href="../gambiarra/a_gambiarra.html"><big><span style="font-weight: bold; font-style: italic; text-decoration: underline;"></span></big></a></big><br />


























<big><a href="../32bits/a_32bits.html"><big><span style="font-weight: bold; font-style: italic; text-decoration: underline;"></span></big></a></big></div>


























<br />
























<div style="text-align: center;"><img style="width: 200px; height: 20px;" alt="" src="../images/botoes/vertambem.png" /><br />




















</div>
























<big><big><span style="font-weight: bold; font-style: italic;"></span></big></big>
<div class="comnews">
			
<div class="comnews">
			<span style="font-weight: bold; font-style: italic; text-decoration: underline;">Restaurando controle de SNES</span><span style="font-weight: normal;"><br />



 Aqui, vou apresentar a
restaura&ccedil;&atilde;o de um controle de SNES que comprei em p&eacute;ssimo
estado numa feirinha da minha cidade, e que agora est&aacute; lindinho
funcionando perfeitamente. Confira as dicas, e fa&ccedil;a uma
restaura&ccedil;&atilde;o voc&ecirc; tamb&eacute;m<img style="width: 15px; height: 15px;" alt="" src="../images/icones/icon_biggrin.gif" hspace="2" />.</span>
















<div style="text-align: right;">&nbsp;<a href="oficina_restaurar_controle_snes.html">leia mais</a><br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





<br />





</div>




















</div>




















</div>



















































	
<div class="comnews">
			<a href="#"></a><br />




















</div>






























</div>












































































<div id="footer">
<p>Gigacom Old Games!</p>


































<p>Tudo sobre&nbsp;jogos mais antiguinhos e outras coisitas mais.</p>


































<br />


































</div>


















































</div>



















































</div>



















































<!-- footer ends-->
</body>
</html>
