<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>


















































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <meta http-equiv="content-type" content="text/html; charset=UTF-8" />



















































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <title>Gigacom Old Games!</title>
  <meta name="keywords" content="" />


















































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <meta name="description" content="Tudo sobre jogos e video games antigos" />


















































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <link href="styles.css" rel="stylesheet" type="text/css" media="screen" />
















































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <meta content="Gigacom" name="author" />
</head>


<body>


















































<div id="content">
<div id="main">
	
<div id="right">
	
<div id="header">
	
<div style="font-style: italic; font-family: Comic Sans MS;" id="logo"><big>
		
</big>
<h1><big><big><a href="../index.html"><br />




























</a></big></big></h1>



































<big>














		





	</big></div>


















































	
<div id="menu">
		
<ul>


















































			<li id="button1"><a href="../gambiarra/a_gambiarra.html" title="">Gambiarra</a></li>


















































			<li id="button2"><a href="a_oficina.html" title="">Oficina do Giga</a></li>


















































			<li id="button3"><a href="../necroterio/a_necroterio.html" title="">Necrot&eacute;rio</a></li>


















































			<li id="button4"><a href="../deunarevista/a_deunarevista.html" title="">Deu na revista!</a></li>


















































			<li id="button5"><a target="_blank" href="http://gigacom.freeforums.org/index.php" title="">Trombone</a></li>


















































		
</ul>


















































	</div>


















































	</div>


















































	
<h4 style="font-weight: bold;">Diversos - Reparo nos conectores dos cartuchos<br />




















</h4>












































<p style="text-align: justify; font-weight: bold; font-style: italic;"><img style="width: 82px; height: 107px; float: left;" alt="" src="../images/avatares/avatar_corredor_x.gif" hspace="3" />:::. <span style="text-decoration: underline;">Por Corredor X</span> -&nbsp;<span style="font-weight: normal;"><span style="font-weight: bold;"></span></span><span style="font-style: italic;">ATEN&Ccedil;&Atilde;O: o X n&atilde;o se responsabiliza por
 qualquer dano que voc&ecirc; porventura fa&ccedil;a ao seu videogame ou at&eacute; a voc&ecirc; 
mesmo, seu tapete, seu sof&aacute;, sua casa, sua namorada, seu cachorro, seu 
irm&atilde;o mais novo ou coisa que o valha, seguindo as instru&ccedil;&otilde;es deste 
t&oacute;pico. Tenha a absoluta certeza do que est&aacute; fazendo antes de tentar 
seguir os procedimentos aqui descritos. Depois n&atilde;o diga que eu n&atilde;o 
avisei.</span></p>






<p style="font-weight: bold; text-align: center;"><span style="font-weight: normal;">_________________________________________________________________________________</span></p>






<p style="font-weight: bold; text-align: justify;"><span style="font-weight: normal;">Crian&ccedil;ada, hoje resolvi dar uma de Agro e aproveitar um pouco meus 
consoles. O fato de que estou semi-imobilizado e com a coluna parecendo 
um S tamb&eacute;m contribuiu muito para isso. S&oacute; que aparentemente, hoje n&atilde;o 
era meu dia... Primeiro liguei o SNES, e foi um custo fazer qualquer 
jogo funcionar. Ele estava com isso j&aacute; fazia um tempo, mas nas &uacute;ltimas 
vezes em que o liguei no final do ano passado estava realmente 
irritante. Depois passei pela mesma coisa com o Master, que sempre 
apresentou esse problema (al&eacute;m dele ser o modelo III, cujo conector n&atilde;o &eacute;
 aquela maravilha que era o dos dois primeiros modelos) mas 
aparentemente foi na onda do SNES e resolveu piorar. Limpei conector, 
limpei cartuchos, mas raramente algo funcionava - j&aacute; n&atilde;o aguentava mais o
 </span><span style="font-style: italic; font-weight: normal;">tanananam tanananan</span><span style="font-weight: normal;"> do </span><span style="font-style: italic; font-weight: normal;">AKMW</span><span style="font-weight: normal;"> da mem&oacute;ria no lugar do jogo que queria. Enchi o saco e fui jogar </span><span style="font-style: italic; font-weight: normal;">Sonic</span><span style="font-weight: normal;">
 no Mega, ou pelo menos tentar... Tive de tirar e colocar o cartucho 
meia d&uacute;zia de vezes at&eacute; pegar (e quando pegou, dei de cara com umas 
benditas listras). Testei depois com mais jogos,
 todos impecavelmente limpos a exemplo do conector, e o resultado foi 
mais ou menos o mesmo. Quando o modelo 1 do Mega, aquele tanque de 
guerra disfar&ccedil;ado de videogame e que nunca tinha me deixado na m&atilde;o at&eacute; 
hoje, come&ccedil;a a refugar cartucho, &eacute; o fim dos tempos. S&oacute; podia ser 
problema de conector, j&aacute; que os cartuchos dos tr&ecirc;s estavam entrando e 
saindo com uma facilidade incr&iacute;vel, mais do que o normal. Como eu j&aacute; 
tinha resolvido abrir os bichinhos para ver a quest&atilde;o do mod, resolvi 
arriscar e aplicar um procedimento que eu havia visto na net fazia uns 
anos...&nbsp;</span></p>
<p style="font-weight: bold; text-align: center;"><a href="http://www.mmmonkey.co.uk/console/sega/md1-loose-cart.htm" target="_blank">MMMonkey MD1 - Fixing Loose Fitting Carts</a></p>
<p style="text-align: justify;">Ele &eacute; de autoria do mmmonkey (que tem uma p&aacute;gina excelente sobre mods, 
n&atilde;o deixem de explorar o site), e consiste basicamente em aproximar os 
contatos do conector apertando-os um pouco para baixo. Como eles s&atilde;o 
curvados, esse empurr&atilde;o aumenta o arco da "barriga" deles, fazendo com 
que pressionem os contatos do cartucho com mais intensidade. Com o 
tempo, esses contatos tendem mesmo a ficarem mais folgados, seja pelo 
tira e p&otilde;e de cartuchos (e tem gente que deixa o jogo sempre espetado no
 console, piorando a situa&ccedil;&atilde;o), seja pelo uso de adaptadores e cartuchos
 piratas, que em alguns casos tem a placa mais grossa do que o normal - o
 NES &eacute; um excelente exemplo disso. Eu sempre tive certo receio de mexer 
nesses contatos, primeiro porque j&aacute; havia testado isso no meu Master 
antigo e parei logo nos primeiros pinos, j&aacute; que n&atilde;o &eacute; uma opera&ccedil;&atilde;o muito
 divertida de ser feita (daqui a pouco explico o porqu&ecirc;). Fora que logo 
que comprei meu NES, passei um susto desgra&ccedil;ado ao estreitar os contatos
 dele, j&aacute; que ele n&atilde;o funcionava direito depois - mas ap&oacute;s regular 
certinho, ele pega qualquer cartucho de cara at&eacute; hoje. Como me irritei 
demais com os consoles hoje, resolvi arriscar e compartilhar os 
resultados com voc&ecirc;s. Mas antes deles, algumas considera&ccedil;&otilde;es:<br />
<br />
<span style="font-weight: bold;">&raquo; cuidado com a for&ccedil;a aplicada nos contatos,</span> &eacute; s&oacute; um empurr&atilde;ozinho m&iacute;nimo.
 Eles s&atilde;o fr&aacute;geis pra cacete, qualquer for&ccedil;a a mais que voc&ecirc; coloque a 
mais ali periga empenar o danado ou mesmo quebr&aacute;-lo. Tenha isso em mente
 ao faz&ecirc;-lo.<br />
<span style="font-weight: bold;">&raquo; n&atilde;o corra para fazer isso</span>, v&aacute; com calma, sen&atilde;o possivelmente vai dar bode.<br />
<span style="font-weight: bold;">&raquo;</span>&nbsp;<span style="font-weight: bold;">n&atilde;o precisa encostar os contatos das duas filas uns nos outros</span>, o 
pr&oacute;prio mmmonkey adverte que o Sega CD pode n&atilde;o funcionar se tiver coisa
 se tocando ali no conector. S&oacute; um leve deslocamento j&aacute; &eacute; suficiente.<br />
<span style="font-weight: bold;">&raquo;</span>&nbsp;<span style="font-weight: bold;">use um objeto met&aacute;lico bem pequeno para fazer a opera&ccedil;&atilde;o</span>, como uma 
chave de fenda. Eu usei um estilete de precis&atilde;o. E novamente, cuidado 
com a for&ccedil;a.<br />
<span style="font-weight: bold;">&raquo; </span>o console mais indicado para se aplicar isso &eacute; o Mega 
1, porque os "chifrinhos" de cada contato s&atilde;o unidos, basta pressionar e
 v&atilde;o todos para mais ou menos o mesmo lugar e fica tudo harm&ocirc;nico e 
lindo como nas fotos do mmmonkey. No caso do Master III e do SNES, a 
coisa pode virar uma bagun&ccedil;a - o resultado vai ficar meio feio 
visualmente, j&aacute; que cada contato se birfurca em dois (voc&ecirc; vai ter que 
for&ccedil;ar a ambos) e &eacute; raro que fiquem na mesma posi&ccedil;&atilde;o. Olhando a coisa 
pronta, eles ficam algo tortos, mas possivelmente funcionando. Ah, n&atilde;o 
se assuste se ao apertar um dos chifrinhos se dobrar um pouco para 
frente e sair da sua casinha pl&aacute;stica, basta coloc&aacute;-lo de novo para 
dentro. Entretanto, perceba que voc&ecirc; possivelmente usou for&ccedil;a demais. 
Foi isso que me fez desistir da primeira vez com o Master, por sinal.<br />
<span style="font-weight: bold;">&raquo; </span>embora d&ecirc; para fazer isso com o console fechado, vale a pena abr&iacute;-lo 
para facilitar o seu trabalho - no caso do SNES, isso &eacute; obrigat&oacute;rio.<br />
<span style="font-weight: bold;">&raquo; lembre de fazer isso com as duas fileiras de contatos.</span><br />
<span style="font-weight: bold;">&raquo;</span>&nbsp;sim, &eacute; um procedimento chato pacas, mas vale a pena.<br />
<span style="font-weight: bold;">&raquo;</span>&nbsp;n&atilde;o fa&ccedil;am isso no dia em que estiverem com a coluna ruim, v&atilde;o por mim; 
ficar curvado sobre um console aberto n&atilde;o ajuda muito a situa&ccedil;&atilde;o.<br />
<span style="font-weight: bold;">&raquo;</span>&nbsp;aproveite para
esfregar um &aacute;lcool isoprop&iacute;lico ou subst&acirc;ncia da
sua prefer&ecirc;ncia nos contatos, eles agradecem.</p>
<div style="text-align: center;"><img style="width: 330px; height: 248px;" alt="" src="imagens/reparo_conector_cartuchos_00.jpg" /><img style="width: 329px; height: 248px;" alt="" src="imagens/reparo_conector_cartuchos_01.jpg" /><br />
<span style="font-weight: bold; color: rgb(255, 0, 0);">Antes...<img style="width: 15px; height: 15px;" alt="" src="../images/icones/icon_loser.gif" hspace="1" />durante...</span><img style="width: 15px; height: 15px;" alt="" src="../images/icones/icon_confused.gif" /><br />
</div>
<p style="text-align: justify;">Bem,
 aos resultados... Crian&ccedil;as, &eacute; realmente impressionante: os consoles 
passaram a aceitar TODOS os cartuchos de cara. Fiquei todo bobo trocando
 cartuchos e mais cartuchos para v&ecirc;-los funcionando de primeira. Eu j&aacute; 
estava com a id&eacute;ia no final do ano de comprar outro SNES, achando que 
este estava nas &uacute;ltimas. Eventualmente um ou outro pode n&atilde;o entrar, mas &eacute;
 prov&aacute;vel que n&atilde;o tenha se encaixado direito, por conta de um efeito 
colateral: a press&atilde;o dos contatos, que aumenta inacreditavelmente. Sem 
qualquer exagero, eu posso agora pegar qualquer um dos tr&ecirc;s consoles, 
segurando-os pelo cartucho, e BALAN&Ccedil;&Aacute;-LOS de um lado para outro sem que o
 jogo saia. Com isso, voc&ecirc; precisa fazer um pouquinho mais de for&ccedil;a para
 que o jogo entre, mas nada que exija uma marreta ou coisa do tipo, d&aacute; 
perfeitamente para sacar o tanto. Agora, tir&aacute;-los &eacute; mais complicado... 
Lembram do primeiro Master System logo que sa&iacute;a da caixa, daquele 
conector que precisava quase de um p&eacute;-de-cabra para tirar o cartucho? 
Nesse n&iacute;vel. &Eacute; s&oacute; quest&atilde;o de faz&ecirc;-lo devagar, sem pressa. No meu caso, o
 Eject do meu SNES agora eleva apenas alguns mil&iacute;metros o cartucho 
(juro, acho que nele eu exagerei), sendo necess&aacute;rio uma ajuda da outra 
m&atilde;o puxando e balan&ccedil;ando de leve at&eacute; que saia - s&oacute; a alavanca agora 
definitivamente n&atilde;o d&aacute; conta. Acho que &eacute; um pre&ccedil;o pequeno a se pagar, j&aacute;
 que al&eacute;m de estar demorando para funcionar, o cartucho era ejetado 
antigamente quase como uma torrada, da quase total falta de contato ali 
dentro.</p>
<div style="text-align: center;"><img style="width: 403px; height: 302px;" alt="" src="imagens/reparo_conector_cartuchos_02.jpg" /><br />
<span style="font-weight: bold; color: rgb(255, 0, 0);">Depois</span><img style="width: 15px; height: 15px;" alt="" src="../images/icones/icon_biggrin.gif" hspace="1" /><br />
</div>
<p style="text-align: justify;">&Eacute; isso, espero que seja &uacute;til a mais algu&eacute;m num momento de
 desespero com um console refugando jogos. Vale lembrar novamente que 
apesar de simples, &eacute; um procedimento delicado, ent&atilde;o todo cuidado &eacute; 
pouco. Se seu console est&aacute; aceitando tudo de cara, nem mexa com isso, v&aacute;
 jogar alguma coisa nele e ser feliz.</p>
<br />
<p style="font-weight: bold; text-align: center;"><big><big><span style="font-weight: bold; color: rgb(255, 0, 0); text-decoration: underline;"></span></big></big><big><big><span style="font-weight: bold; color: rgb(255, 0, 0); text-decoration: underline;"></span></big></big>



</p>




<p style="font-weight: bold; text-align: center;"><span style="font-weight: bold;">Acesse o <a href="http://gigacom.freeforums.org/index.php" target="_blank">Trombone</a> e comente sobre essa mat&eacute;ria!</span>
</p>




















&nbsp;&nbsp;<big><span style="font-weight: bold;"></span></big>









































	</div>


















































	
<div id="left">
	
<div id="left_top"><br />





















</div>


















































	
			
<div style="text-align: center;"><big><a href="../index.html"><big><span style="font-weight: bold; font-style: italic; text-decoration: underline;"></span></big></a></big>
























				<big><img style="width: 200px; height: 20px;" alt="" src="../images/botoes/indice.png" /><br />























<br />























<a href="../index.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/home.png" /></a><br />























</big><a href="../artigosdiversos/a_artigosdiversos.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/diversos.png" /></a><br />























<br />























<a href="../deunarevista/a_deunarevista.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/deunarevista.png" /></a><br />























<a href="../gambiarra/a_gambiarra.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/gambiarra.png" /></a><br />























<a href="../necroterio/a_necroterio.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/necroterio.png" /></a><br />























<a href="a_oficina.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/oficina.png" /></a><br />

























<a href="http://gigacom.freeforums.org/index.php"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/trombone.png" /></a><br />























<br />

























<a href="../8bits/a_8bits.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/8bits.png" /></a><br />

























<a href="../16bits/a_16bits.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/16bits.png" /></a><br />

























<a href="../32bits/a_32bits.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/3264bits.png" /></a><br />

























<a href="../portateis/a_portateis.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/portateis.png" /></a><br />























<br />























<a href="../downloads/a_downloads.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/downloads.png" /></a><br />

























<a href="../links/a_links.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/linksafiliados.png" /></a><br />

























<a href="../historico.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/historico.png" /></a><big><a href="../gambiarra/a_gambiarra.html"><big><span style="font-weight: bold; font-style: italic; text-decoration: underline;"></span></big></a></big><br />

























<big><a href="../32bits/a_32bits.html"><big><span style="font-weight: bold; font-style: italic; text-decoration: underline;"></span></big></a></big></div>

























<br />























<div style="text-align: center;"><img style="width: 200px; height: 20px;" alt="" src="../images/botoes/vertambem.png" /><br />



















</div>























<big><big><span style="font-weight: bold; font-style: italic;"></span></big></big>
<div class="comnews">
			
<div class="comnews">
			<span style="font-weight: bold; font-style: italic; text-decoration: underline;">Restaurando controle de SNES</span><span style="font-weight: normal;"><br />






 Aqui, vou apresentar a
restaura&ccedil;&atilde;o de um controle de SNES que comprei em p&eacute;ssimo
estado numa feirinha da minha cidade, e que agora est&aacute; lindinho
funcionando perfeitamente. Confira as dicas, e fa&ccedil;a uma
restaura&ccedil;&atilde;o voc&ecirc; tamb&eacute;m<img style="width: 15px; height: 15px;" alt="" src="../images/icones/icon_biggrin.gif" hspace="2" />.</span>
















&nbsp;<br />




<div style="text-align: right;"><a href="oficina_restaurar_controle_snes.html">leia mais</a><br />




</div>




<br />




<span style="font-weight: bold; font-style: italic;">Restaurando um controle de PSX</span><br />




Peguei o mais feinho e judiado dos
controles para fazer esse artigo. O coitado estava encardido na parte
de cima, e debaixo dele encontrei arranh&otilde;es nas partes de apoio
da m&atilde;o, e bastante sujeira acumulada nas inscri&ccedil;&otilde;es.
O conector do cabo estava muito arranhado e sujo tambem, o cabo
ent&atilde;o nem se fala... sujava a m&atilde;o s&oacute; de pegar














<div style="text-align: right;">&nbsp;<a href="oficina_psx_restaurar_controle.html">leia mais</a><br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




</div>



















</div>



















</div>


















































	
<div class="comnews">
			<a href="#"></a><br />



















</div>





























</div>











































































<div id="footer">
<p>Gigacom Old Games!</p>

































<p>Tudo sobre&nbsp;jogos mais antiguinhos e outras coisitas mais.</p>

































<br />

































</div>

















































</div>


















































</div>


















































<!-- footer ends-->
</body>
</html>
