<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>











































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <meta http-equiv="content-type" content="text/html; charset=UTF-8" />












































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <title>Gigacom Old Games!</title>
  <meta name="keywords" content="" />











































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <meta name="description" content="Tudo sobre jogos e video games antigos" />











































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <link href="styles.css" rel="stylesheet" type="text/css" media="screen" />









































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <meta content="Gigacom" name="author" />
</head>


<body>











































<div id="content">
<div id="main">
	
<div id="right">
	
<div id="header">
	
<div style="font-style: italic; font-family: Comic Sans MS;" id="logo"><big>
		
</big>
<h1><big><big><a href="../index.html"><br />





















</a></big></big></h1>




























<big>














		





	</big></div>











































	
<div id="menu">
		
<ul>











































			<li id="button1"><a href="../gambiarra/a_gambiarra.html" title="">Gambiarra</a></li>











































			<li id="button2"><a href="a_oficina.html" title="">Oficina do Giga</a></li>











































			<li id="button3"><a href="../necroterio/a_necroterio.html" title="">Necrot&eacute;rio</a></li>











































			<li id="button4"><a href="../deunarevista/a_deunarevista.html" title="">Deu na revista!</a></li>











































			<li id="button5"><a target="_blank" href="http://gigacom.freeforums.org/index.php" title="">Trombone</a></li>











































		
</ul>











































	</div>











































	</div>











































	
<h4 style="font-weight: bold;">Phantom System - Ressucitando o Fantasma<br />













</h4>



































<p style="text-align: justify;"><img style="width: 54px; height: 80px; float: left;" alt="" src="../images/avatares/avatar_agrobel.jpg" hspace="2" /><span style="font-weight: bold;">:::.</span><span style="font-style: italic;"> </span><span style="text-decoration: underline; font-weight: bold;">Por Agrobel </span><span style="font-weight: bold;">-
Tempos atr&aacute;s, o Agro comentou no forum Sega Brasil, que estava
com um Phantom System morto e enterrado na caixa dele dentro do guarda
roupas, desde mil novescentos e n&atilde;o sei quanto. Ent&atilde;o eu
falei, "que tal voc&ecirc; tentar reviver o fantasma?". T&aacute;,
n&atilde;o foram bem essas palavras, mas foi algo do tipo. Trocamos
umas id&eacute;ias r&aacute;pidas sobre como ressucitar video games, e
ele encarou o desafio. Confiram<span style="text-decoration: underline;"></span></span><a style="font-weight: bold;" href="http://www.sega-brasil.com.br/forum/viewtopic.php?f=1&amp;t=1640" target="_blank"></a><span style="font-weight: bold;">.</span></p>



<p style="text-align: center;"><span style="font-weight: bold;">________________________________________________________________________________________</span></p>



<p style="text-align: justify;">Fala, pessoal!</p>
<p style="text-align: justify;">

Comecei a escrever esse t&oacute;pico na segunda-feira, ent&atilde;o
considerem as cita&ccedil;&otilde;es do texto para segunda-feira.<br />


Os
 Fara&oacute;s bem que tentaram, mas nunca conseguiram voltar do mundo dos 
mortos. Seus corpos mumificados passaram muito tempo &agrave; espera do retorno
 de suas almas, mas isso acabou nunca acontecendo, pelo menos at&eacute; hoje..
 hehe.<br />


Domingo passado, eu abri um sarc&oacute;fago para ajudar um colega do
 f&oacute;rum Sega Brasil, que precisava saber como era o esquema de pinagem 
original do controle do Phantom System. <br />


Meu Phantom System estava 
dentro de seu sarc&oacute;fago, falecido desde mais ou menos 1995, entre caixas
 de outros consoles que est&atilde;o, alguns, em pleno funcionamento, outros 
n&atilde;o t&atilde;o pleno, mas ainda em funcionamento.<br />


A dificuldade de tir&aacute;-lo de sua tumba foi algo que exigiu uma espera de alguns dias.. Mas domingo esse dia chegou.<br />


<br />


A&iacute; est&aacute; o sarc&oacute;fago.</p>


<p style="text-align: justify;"><img style="width: 266px; height: 202px;" alt="" src="imagens/phantom_ressucitando_phantom_00.jpg" /></p>


<p style="text-align: justify;">Ao abr&iacute;-lo, o corpo mumificado
de meu Phantom System e seus controles.&nbsp;At&eacute; que ele
est&aacute; mais completo do que eu lembrava que estivesse, apesar de
n&atilde;o ter fonte nem cabo RF ou AV.</p>


<p style="text-align: center;"><img style="width: 320px; height: 240px;" alt="" src="imagens/phantom_ressucitando_phantom_01.jpg" /><img style="width: 320px; height: 240px;" alt="" src="imagens/phantom_ressucitando_phantom_02.jpg" /></p>


<p style="text-align: justify;">Bom, separei os controles, para fazer as devidas observa&ccedil;&otilde;es e medi&ccedil;&otilde;es.
 Na hora de tirar da caixa, tive uma desagrad&aacute;vel constata&ccedil;&atilde;o: a 
borracha dos cabos est&aacute; meio que derretendo, o que tirou alguns daqueles
 mini gomos do isopor, e um pouco de tinta da contracapa do manual... 
Nosso amigo Corredor X j&aacute; esclareceu que isso se chama vulcaniza&ccedil;&atilde;o da 
borracha. Mas continuo tendo a impress&atilde;o de que esse processo n&atilde;o 
acontecia da mesma forma que acontece hoje, sugerindo que houve alguma 
mudan&ccedil;a no ar.</p>


<p style="text-align: justify;">Com o controle aberto, anotei a nomenclatura e fiz o mapeamento da 
pinagem de acordo com as cores dos fios, que recebem um c&oacute;digo na placa 
do controle (suas cores em ingl&ecirc;s, exceto para o fio verde, que &eacute; 
indicado como W. Provavelmente o projeto original previa um fio branco 
no lugar do verde). Repeti o processo no segundo controle, para ter 
certeza da configura&ccedil;&atilde;o.</p>


<p style="text-align: center;"><img style="width: 550px; height: 227px;" alt="" src="imagens/phantom_ressucitando_phantom_04.jpg" /></p>


<p style="text-align: justify;">Com o controle aberto, anotei a nomenclatura e fiz o mapeamento da 
pinagem de acordo com as cores dos fios, que recebem um c&oacute;digo na placa 
do controle (suas cores em ingl&ecirc;s, exceto para o fio verde, que &eacute; 
indicado como W. Provavelmente o projeto original previa um fio branco 
no lugar do verde). Repeti o processo no segundo controle, para ter 
certeza da configura&ccedil;&atilde;o.</p>


<p style="text-align: center;"><img style="width: 507px; height: 279px;" alt="" src="imagens/phantom_ressucitando_phantom_05.jpg" /></p>


<p style="text-align: justify;">J&aacute; aproveitei para fazer uma limpeza nas placas, nas carca&ccedil;as dos 
controles, e nos carv&otilde;es que fazem os contatos, apesar de estarem em 
relativo bom estado.&nbsp;Com um pano e &aacute;lcool comum 46&deg;, fiz a limpeza dos fios. Saiu um caldinho
 amarelado. Preocupante. Mas ficaram bons, lisinhos, n&atilde;o &aacute;speros e 
grudentos como estavam antes.</p>


<p style="text-align: center;"><img style="width: 427px; height: 281px;" alt="" src="imagens/phantom_ressucitando_phantom_06.jpg" /></p>


<p style="text-align: justify;">Postei as informa&ccedil;&otilde;es para o nosso colega, e mandei as fotos que ele precisava. Na
 segunda, pela manh&atilde;, quando fui conferir a foto que tirei no dia 
anterior, vi que estava muito fora de foco. Decidi tirar outra, com 
resolu&ccedil;&atilde;o e ilumina&ccedil;&atilde;o melhores.</p>


<p style="text-align: center;"><img style="width: 417px; height: 440px;" alt="" src="imagens/phantom_ressucitando_phantom_07.jpg" /></p>


<p style="text-align: justify;">Depois de mexer com os controles, fiquei pensando no que o amigo 
Gigacom sugeriu&nbsp;quando recuperei o Turbo Game. Ele 
deu a id&eacute;ia de tentar reviver a m&uacute;mia. Eu j&aacute; tinha tentado fazer isso 
uns anos atr&aacute;s, sem sucesso. Na ocasi&atilde;o, troquei um componente queimado,
 identificado por um amigo que &eacute; t&eacute;cnico de laborat&oacute;rio de eletr&ocirc;nica, 
na escola em que eu trabalhava, e manja de consertar coisas 
eletr&ocirc;nicas.. hehe.<br />


Eu mesmo fiz a troca, e o &uacute;nico resultado que 
obtive na &eacute;poca foi que ele voltou a acender o LED que indica estar 
ligado. Ainda na &eacute;poca, tentei faz&ecirc;-lo funcionar com uma fonte mais do 
que gen&eacute;rica daquelas que vc seleciona a tens&atilde;o e at&eacute; a polaridade. S&oacute; 
que essas fontes s&atilde;o muito fracas, n&atilde;o conseguem fornecer a corrente 
necess&aacute;ria sem uma grande perda de tens&atilde;o. Essas fontes s&oacute; servem para 
aparelhos que consomem muito pouca energia.<br />


Mesmo assim, fiquei com aquilo na cabe&ccedil;a. J&aacute; que eu
estava com a m&atilde;o na massa mesmo, porque n&atilde;o dar uma nova
olhada na m&uacute;mia? Preparei a mesa branca e trouxe o "Fantasma"
para a se&ccedil;&atilde;o esp&iacute;rita! Hehe.&nbsp;Por fora ele
est&aacute; muito bonito! Deu at&eacute; d&oacute; de estar queimado.</p>


<p style="text-align: center;"><img style="width: 613px; height: 396px;" alt="" src="imagens/phantom_ressucitando_phantom_08.jpg" /></p>


<p style="text-align: center;"><img style="width: 640px; height: 480px;" alt="" src="imagens/phantom_ressucitando_phantom_09.jpg" /></p>


<p style="text-align: justify;">E l&aacute; estava a plaquinha. Como fiquei surpreso a primeira vez que a vi, 
uns 15 anos atr&aacute;s. Achei bem pequena. Hoje que conhe&ccedil;o a placa do Turbo 
Game da CCE, sei que &eacute; menor que ela, embora fa&ccedil;a a mesma coisa, com um 
pouco mais de qualidade.<br />


O procedimento foi o padr&atilde;o: primeiro fiz 
alguns testes de continuidade com o mult&iacute;metro, para ver se tinha algum 
curto, ou alguma solda mal feita, j&aacute; que na &eacute;poca, al&eacute;m de menos 
pr&aacute;tica, eu n&atilde;o tinha mult&iacute;metro para testar. Depois dei aquela lavada 
com &aacute;lcool isoprop&iacute;lico, e mandei o spray de &aacute;lcool tamb&eacute;m, nos lugares 
mais dif&iacute;ceis de alcan&ccedil;ar. Escovei com a escova velha, limpei com 
cotonete...<br />


Ficou
 limpinha. Antes tinha umas pequenas manchas, parecia zinabe, mas tinha 
bem pouco. Fiquei naquela curiosidade "Ser&aacute; que agora funcionaria?".</p>


<p style="text-align: center;"><img style="width: 468px; height: 358px;" alt="" src="imagens/phantom_ressucitando_phantom_10.jpg" /></p>


<p style="text-align: justify;">Depois de fechado, lembrei do problema da fonte. A entrada da placa para
 a fonte n&atilde;o &eacute; bem padr&atilde;o. O pino central &eacute; maior que a maioria das 
fontes. A fonte do Mega, por exemplo, n&atilde;o serve apenas por esse detalhe.
 E eu n&atilde;o tenho a menor id&eacute;ia de onde esteja aquela fonte multitens&atilde;o 
vagabunda que eu tinha. Est&aacute; guardada, mas n&atilde;o sei onde. &Ocirc;, ansiedade!</p>


<p style="text-align: center;"><img style="width: 483px; height: 371px;" alt="" src="imagens/phantom_ressucitando_phantom_11.jpg" /></p>


<p style="text-align: justify;">Bateu aquela indigna&ccedil;&atilde;o de estar com o console lind&atilde;o e n&atilde;o poder nem 
testar. Ent&atilde;o resolvi procurar alguma fonte que servisse. Primeiro, 
claro, tentei usar a do Mega, que &eacute; de 9V. Eu n&atilde;o tenho certeza se o 
Phantom usa fonte de 9V, mas console com menos de 9V &eacute; dif&iacute;cil. Al&eacute;m 
disso eu, sem no&ccedil;&atilde;o em 95, usava uma fonte de 12V, e ele funcionava. Mas
 a sobrecarga &eacute; que deve ter fritado o Phantom aos poucos (vai 
entender..).<br />


Nada do plugue do Mega encaixar no Phantom. Resolvi 
tentar a fonte do Nes, que nunca tinha tentado antes. A tens&atilde;o era de 9V
 tamb&eacute;m, ent&atilde;o pensei "Beleza, com essa tens&atilde;o e uma corrente nominal de
 1,3A, d&aacute; e sobra at&eacute; mais que a do Mega". O encaixe foi perfeito, no 
plugue, mas o Phantom n&atilde;o dava nenhum sinal. Nem o LED, que antes 
acendia, n&atilde;o estava acendendo. <br />


Fiquei preocupado. Ser&aacute; que tinha 
queimado outra vez? Ser&aacute; que tinha prejudicado a fonte do Nes? Peguei o 
mult&iacute;metro e fui testar se estava tudo ok com a fonte do Nes. "Estranho,
 t&aacute; marcando uma tens&atilde;o quase zero! O que ser&aacute;?" O comportamento era 
parecido com o que se v&ecirc; quando se tenta medir uma tens&atilde;o alternada em 
escala para tens&atilde;o cont&iacute;nua. Eu disse: "Ser&aacute;? N&atilde;o pode ser!" Mas 
coloquei na escala alternada para ter certeza..........<br />


Tava l&aacute;: 10V 
(em aberto). 10V alternada!!!!!!!! A&iacute; olhei com mais aten&ccedil;&atilde;o as 
informa&ccedil;&otilde;es da fonte e estava l&aacute; "Output: AC 9V" !!!! "Meu, s&oacute; a 
Nintendo pra fazer uma dessa...... Agora estava tudo explicado. A fonte 
do Nes provavelmente s&oacute; tem transformador l&aacute; dentro. O retificador s&oacute; 
pode estar dentro do console.. Consequ&ecirc;ncia: nada feito com a fonte de 
Nes...<br />


Comecei a pensar num jeito de fazer algum tipo de adaptador.. 
Como eu conseguiria fazer contato com aquele pino central? Pensei em 
algum tubinho daquele di&acirc;metro, mas nada me veio como possibilidade. Foi
 a&iacute; que comecei a pensar ao contr&aacute;rio. Ao inv&eacute;s de adaptar uma fonte ao 
console, adaptar o console a uma fonte. Coisa n&atilde;o muito f&aacute;cil de fazer, 
mas ou era isso, ou ficar sem saber sobre a reencarna&ccedil;&atilde;o do Phantasma.<br />


Abri
 o Phantom denovo, e comecei a estudar o conector da fonte. Os 
componentes sugeriam que o pino central era o p&oacute;lo negativo, e a chapa 
do contato externo o p&oacute;lo positivo. Peguei um par de fios r&iacute;gidos com 
garras jacar&eacute;, que costumo usar para testes, e fiz uma conex&atilde;o &agrave;s pernas
 de dois componentes diretamente ligados aos conectores. Prendi bem os 
fios para evitar xab&uacute;, e tchanam! Agora meu Phantom System tinha o 
conector mais universal do mundo! hehe</p>


<p style="text-align: center;"><img style="width: 571px; height: 370px;" alt="" src="imagens/phantom_ressucitando_phantom_12.jpg" /></p>


<p style="text-align: center;"><img style="width: 547px; height: 293px;" alt="" src="imagens/phantom_ressucitando_phantom_14.jpg" /></p>


<p style="text-align: justify;">A gambiarra das gambiarras..
hehehe.&nbsp;Bom, j&aacute; que eu estava me aprofundando na
improviza&ccedil;&atilde;o, porque n&atilde;o fazer uma fonte? Assim eu
poderia medir a tens&atilde;o e a corrente mesmo durante o uso.
Preparativos finais para o teste.</p>


<p style="text-align: center;"><img style="width: 593px; height: 350px;" alt="" src="imagens/phantom_ressucitando_phantom_16.jpg" /></p>


<p style="text-align: justify;">Primeiro teste: tela azul! Oh oh.. Tela
azul?? Isso aqui n&atilde;o &eacute; Windows!! N&atilde;o me lembrava
de tela azul quando n&atilde;o pegava cartucho. Estava receoso, mas
arrisquei mais um pouco, recolocando o cartucho (adivinhem
qual...).&nbsp;Pelo menos o LED estava aceso.&nbsp;De repente.....
UAU!!!!!!!!!!!!! Eu n&atilde;o achei que ele voltaria a funcionar
depois de 15 anos parado!!! Valeu, GIGA!!!!!!</p>


<p style="text-align: justify;"><img style="width: 335px; height: 480px;" alt="" src="imagens/phantom_ressucitando_phantom_18.jpg" /><img style="width: 308px; height: 480px;" alt="" src="imagens/phantom_ressucitando_phantom_17.jpg" /></p>


<p style="text-align: justify;">Fiquei muito contente mesmo, parecia o
resultado de um vestibular!!!! Me senti poderoso!! Hehe. Eu poderia
controlar a natureza!! haha!&nbsp;Claro que eu n&atilde;o podia deixar
de lado o jogo que me fez comprar esse Phantom... Era
inacredit&aacute;vel rever essa imagem, gerada por esse console.
Ali&aacute;s, tive a impress&atilde;o de que a imagem &eacute; mais
n&iacute;tida e mais colorida do que no Turbo Game, que por sua vez
&eacute; mais colorida que no pr&oacute;prio Nes Playtronic. O som do
Phantom tamb&eacute;m &eacute; menos ardido do que no VG 9000T.</p>


<p style="text-align: center;"><img style="width: 347px; height: 462px;" alt="" src="imagens/phantom_ressucitando_phantom_19.jpg" /></p>


<p style="text-align: justify;">Bom, foi isso. Fiquei muito feliz! Hehehe.. Viva a &aacute;gua benta, digo, o isoprop&iacute;lico! hehe.</p>


<p style="text-align: justify;">        </p>




<p style="text-align: justify;"></p>




<div style="text-align: center;"><span style="font-weight: bold;">Acesse o <a href="http://gigacom.freeforums.org/index.php" target="_blank">Trombone</a> e comente sobre essa mat&eacute;ria!</span></div>




<p style="text-align: justify;">



</p>

















<br />

















<br />



































<div style="clear: both;">
	</div>













































	</div>











































	
<div id="left">
	
<div id="left_top"><br />














</div>











































	
			
<div style="text-align: center;"><big><a href="../index.html"><big><span style="font-weight: bold; font-style: italic; text-decoration: underline;"></span></big></a></big>
























				<big><img style="width: 200px; height: 20px;" alt="" src="../images/botoes/indice.png" /><br />
















<br />
















<a href="../index.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/home.png" /></a><br />
















</big><a href="../artigosdiversos/a_artigosdiversos.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/diversos.png" /></a><br />
















<br />
















<a href="../deunarevista/a_deunarevista.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/deunarevista.png" /></a><br />
















<a href="../gambiarra/a_gambiarra.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/gambiarra.png" /></a><br />
















<a href="../necroterio/a_necroterio.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/necroterio.png" /></a><br />
















<a href="a_oficina.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/oficina.png" /></a><br />


















<a href="http://gigacom.freeforums.org/index.php"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/trombone.png" /></a><br />
















<br />


















<a href="../8bits/a_8bits.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/8bits.png" /></a><br />


















<a href="../16bits/a_16bits.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/16bits.png" /></a><br />


















<a href="../32bits/a_32bits.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/3264bits.png" /></a><br />


















<a href="../portateis/a_portateis.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/portateis.png" /></a><br />
















<br />
















<a href="../downloads/a_downloads.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/downloads.png" /></a><br />


















<a href="../links/a_links.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/linksafiliados.png" /></a><br />


















<a href="../historico.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/historico.png" /></a><big><a href="../gambiarra/a_gambiarra.html"><big><span style="font-weight: bold; font-style: italic; text-decoration: underline;"></span></big></a></big><br />


















<big><a href="../32bits/a_32bits.html"><big><span style="font-weight: bold; font-style: italic; text-decoration: underline;"></span></big></a></big></div>


















<br />
















<div style="text-align: center;"><img style="width: 200px; height: 20px;" alt="" src="../images/botoes/vertambem.png" /><br />












</div>
















<big><big><span style="font-weight: bold; font-style: italic;"></span></big></big>
<div class="comnews">
			
<div class="comnews">
			<a href="../16bits/a_16bits.html#"><span style="font-weight: bold; font-style: italic;">construindo - construindo</span></a>
<span style="font-weight: bold; font-style: italic;">construindo - construindo -</span><span style="font-weight: bold; font-style: italic;">construindo - construindo -</span><span style="font-weight: bold; font-style: italic;">construindo - construindo -</span><span style="font-weight: bold; font-style: italic;">construindo - construindo -</span><span style="font-weight: bold; font-style: italic;">construindo - construindo ...</span><br />












<div style="text-align: right;">&nbsp;<a href="../16bits/a_16bits.html#">leia mais</a></div>












</div>












</div>











































	
<div class="comnews">
			<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />

<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />












</div>






















</div>




































































<div id="footer">
<p>Gigacom Old Games!</p>


























<p>Tudo sobre&nbsp;jogos mais antiguinhos e outras coisitas mais.</p>


























<br />


























</div>










































</div>











































</div>











































<!-- footer ends-->
</body>
</html>
