<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>








































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <meta http-equiv="content-type" content="text/html; charset=UTF-8" />









































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <title>Gigacom Old Games!</title>
  <meta name="keywords" content="" />








































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <meta name="description" content="Tudo sobre jogos e video games antigos" />








































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <link href="styles.css" rel="stylesheet" type="text/css" media="screen" />






































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <meta content="Gigacom" name="author" />
</head>


<body>








































<div id="content">
<div id="main">
	
<div id="right">
	
<div id="header">
	
<div style="font-style: italic; font-family: Comic Sans MS;" id="logo"><big>
		
</big>
<h1><big><big><a href="../index.html"><br />


















</a></big></big></h1>

























<big>














		





	</big></div>








































	
<div id="menu">
		
<ul>








































			<li id="button1"><a href="../gambiarra/a_gambiarra.html" title="">Gambiarra</a></li>








































			<li id="button2"><a href="../oficina/a_oficina.html" title="">Oficina do Giga</a></li>








































			<li id="button3"><a href="../necroterio/a_necroterio.html" title="">Necrot&eacute;rio</a></li>








































			<li id="button4"><a href="../deunarevista/a_deunarevista.html" title="">Deu na revista!</a></li>








































			<li id="button5"><a target="_blank" href="http://gigacom.freeforums.org/index.php" title="">Trombone</a></li>








































		
</ul>








































	</div>








































	</div>








































	
<h4 style="font-weight: bold;">Dreamcast - A lenda de Leonan<br />










</h4>




















<p style="font-weight: bold; text-align: left;"><span style="font-weight: bold;"><img style="width: 77px; height: 79px; float: left;" alt="" src="../images/avatares/avatar_gigacom.jpg" hspace="2" /></span>Ha muito tempo
atr&aacute;s, quando o Dreamcast ainda era produzido e vendido &agrave;
pre&ccedil;os exorbitantes, surge Leonan, um carinha que ficou famoso
por conseguir estragar o seu amado (e caro...) Dreamcast de uma maneira
nada comum... confiram a historinha abaixo, que rolou naquela
&eacute;poca em um forum:</p>




<p class="MsoNormal"></p>






<p align="justify" class="MsoNormal" style="font-weight: bold; text-decoration: underline;">QUEBREI MEU DREAMCAST - PARTE 1<o:p>&nbsp;</o:p></p>










<p align="justify" class="MsoNormal">Quebrei meu dreamcast de bobeira, meu nome &eacute; Leonan
tenho 13 anos, parece brincadeira mas &eacute; a pura verdade, tudo come&ccedil;ou quando
estava jogando Craxy Taxi pirata passou um tempo fui trocar o cd ent&atilde;o
desliguei o dreamcast tirei o crazy taxi e deixei a tampa aberta(meu erro) para
colocar o cd de boot, mas a&iacute; o pessoal de casa resolveu sair ent&atilde;o fiquei sozinho
em casa, pintou aquela vontade de tocar sonfona, o meu dreamcast fica na mesma
mesa do computador, ent&atilde;o liguei o micro acessei uma p&aacute;gina (que vi neste
forum...) e to l&aacute;, em frente ao micro vcs sabem n&eacute;...ent&atilde;o chegou aquela
press&atilde;o n&atilde;o pude segurar mas como eu tava na frente do computador para n&atilde;o
sujar o monitor e o teclado meu reflexo foi de virar para a esquerda justamente
onde tava meu dreamcast com a tampa aberta (**** falta de sorte)...isso mesmo
galera <img style="width: 15px; height: 15px;" alt="" src="../images/icones/icon_eek.gif" />&nbsp;<span style="font-weight: bold; text-decoration: underline;"> ...EJACULEI NO MEU DREAMCAST...</span> <img style="width: 15px; height: 15px;" alt="" src="../images/icones/icon_eek.gif" />&nbsp;riam
deste cara sem sorte, n&atilde;o sei se rio ou choro, a lente sujou
toda, limpei o quanto pude mas em cima da lente a gosma secou. Agora o
que &eacute; que
eu fa&ccedil;o? fiz de tudo para ganhar este dreamcast n&atilde;o tem
um m&ecirc;s direito e j&aacute; estragou minha m&atilde;e vai me matar
quando descobrir que ela pagou
750 reias e eu j&aacute; quebrei, t&aacute; na garantia ainda mas o que
eu falo pro cara da
loja? Como fa&ccedil;o para limpar a lente agora? me ajudem por favor !
Nunca mais me masturbo na minha vida<img style="width: 20px; height: 15px;" alt="" src="../images/icones/icon_cry_death.gif" hspace="2" />!<br />




_________________________________________________________________________<br />





<br />




<span style="font-weight: bold; text-decoration: underline;">
QUEBREI MEU DREAMCAST - PARTE 2</span><br />





<br />




<span style="font-weight: bold; font-style: italic;">
Recapitulando : Depois de acidentalmente gozar em cima da lente de seu dreamcast e
n&atilde;o conseguir limp&aacute;-la , nosso amiguinho punheteiro volta de escola decidido a
novamente tentar ligar para a tectoy (representante da</span><span style="font-weight: bold; font-style: italic;"> sega no Brasil) para tentar saber se seu dreamcast ainda tem salva&ccedil;&atilde;o ...</span></p>






<p align="justify" class="MsoNormal">
Cheguei em casa depois da escola hoje de manh&atilde;...vim correndo quando abri
a porta at&eacute; ofegante..adivinhem com quem encontro de cara "MINHA M&Atilde;E"(parece
um general) com meu dreamcast no colo sentada no sof&aacute; da sala me esperando com
cara de querer me matar...gelei do p&eacute; at&eacute; a cabe&ccedil;a na hora,ent&atilde;o a 1&ordf; COISA QUE
DISSE FOI: <span style="font-weight: bold;"><img style="width: 15px; height: 17px;" alt="" src="../images/icones/icon_evil.gif" hspace="2" />LEONAM...O QUE FOI QUE VOC&Ecirc; DERRAMOU NESTE VIDEOGAME<img style="width: 15px; height: 17px;" alt="" src="../images/icones/icon_evil.gif" hspace="2" />? </span>quase cai pra
tr&aacute;s A&iacute; eu perguntei...POR QUE M&Atilde;E... ELA DISSE GRITANDO: <span style="font-weight: bold;"><img style="width: 15px; height: 17px;" alt="" src="../images/icones/icon_evil.gif" hspace="2" />POR QUE EU LEVEI O
VIDEOGAME NA LOCADORA ONDE EU COMPREI E O VENDEDOR ABRIU ! TINHA MANCHA DE
ALGUMA COISA L&Aacute; DENTRO...VAI FALANDO AGORA...(SUEI FRIO AT&Eacute; GAGUEJEI), VOC&Ecirc;
DERRAMOU CAF&Eacute; COM LEITE NESTE VIDEOGAME LEONAM? N&Atilde;O ACREDITO QUE TE DOU UM
BRINQUEDO CARO DESTES E VOC&Ecirc; J&Aacute; QUEBROU<img style="width: 15px; height: 17px;" alt="" src="../images/icones/icon_evil.gif" hspace="2" />!</span> A&iacute; eu falei N&Atilde;O DERRAMEI NADA A&Iacute; N&Atilde;O,
ent&atilde;o ela falou: <span style="font-weight: bold;">QUE
CHEIRO DE QUEIJO &Eacute; ESSE AQUI DENTRO!ALGUMA COISA VOC&Ecirc;
DEIXOU CAIR AQUI? A GARANTIA N&Atilde;O COBRE ISSO SABIA LEONAM</span>...
(sabem como &eacute; tremer as pernas pois &eacute; t&ocirc;
assim at&eacute; agora)Corri e me tranquei no quarto t&ocirc; aqui
at&eacute; agora, com uma ****
fome, peguei o telefone e liguei pra tectoy, antes de falar com o cara
prometi
que n&atilde;o era um trote at&eacute; jurei, VOC&Ecirc;S ACREDITAM QUE
O CARA DO ATENDIMENTO RIU
DE MIN! PARECE INGRA&Ccedil;ADO MAS EU T&Ocirc; NO SAL! V&Ocirc; LEVAR
A MAIOR COSSA! A PROPOSITO
ELE DISSE PARA N&Atilde;O RASPAR A LENTE E LEVAR MEU DREAMCAST NA
ASSISTENCIA T&Eacute;CNICA,
E FALAR A VERDADE PRO CARA DA ASSITENCIA PRA ELE N&Atilde;O MEXER ONDE
DEVE, MAS COMO
EU CONTO AQUILO NO BALC&Atilde;O (algo como...&ocirc; mo&ccedil;o gozei
no meu dreamcast!) Acho que
minha m&atilde;e j&aacute; sacou,o que eu fa&ccedil;o? Claro que ela
sabe que cheiro &eacute; aquele...toda
ter&ccedil;a e quinta ela e meu pai mandam ver a noite toda! Ela
s&oacute; quer que eu fale para
poder ter um motivo para quebrar minha cara! Eu acho que vou contar pro
meu
pai...se eu tivesse irm&atilde;o menor eu colocava a culpa nele mas
n&atilde;o tenho...fazer o que? t&ocirc; ficando maluco! MINHA ULTIMA
CHANCE S&Atilde;O VOC&Ecirc;S... OU EU
MESMO LIMPO A LENTE COM ALCOL OU AGUA OU MINHA M&Atilde;E VAI ACABAR
COMIGO! ME AJUDEM
AMIGOS COMO TIRAR ESPERMA DA LENTE SEM ESTRAGAR MEU DREMCAST?<br />





<br />




<span style="font-weight: bold; font-style: italic;">
E agora , o que ir&aacute; acontecer ? Conseguir&aacute; nosso amiguinho punheteiro salvar-se
dessa situa&ccedil;&atilde;o constrangedora ? Sua m&atilde;e j&aacute; est&aacute; desconfiada, &eacute; uma corrida
contra o tempo !</span><br />





_________________________________________________________________________<br />





<br />




<span style="font-weight: bold; text-decoration: underline;">
QUEBREI MEU DREAMCAST - PARTE 3</span><br />





<br />




<span style="font-weight: bold; font-style: italic;">
Recapitulando : ap&oacute;s estragar e lente de leitura do seu dreamcast com seu esperma
, nosso her&oacute;i leonam falhou duas vezes em conseguir socorro no telefone de
ajuda da tectoy , mais tarde sua m&atilde;e descobriu que o filho</span><br style="font-weight: bold; font-style: italic;" />




<span style="font-weight: bold; font-style: italic;">
estragara o DC , e &eacute; poss&iacute;vel que ela j&aacute; desconfie de de que l&iacute;quido &eacute; aquele
no Dreamcast ... o que ser&aacute; do her&oacute;i punheteiro ? Ao pedir amparo em v&aacute;rios
f&oacute;runs , Leonam consegue ajuda de dois seres , Erik e Francisco</span><br style="font-weight: bold; font-style: italic;" />




<span style="font-weight: bold; font-style: italic;">
. por&eacute;m , ao entrar no quarto...</span><br />




<br />




Olha Erik e Francisco obrigado por estarem me ajudando isto tudo
&eacute; verdade
eu juro! Tenho uma coisa a dizer... primeiramente j&aacute; que
est&atilde;o sendo gente boa
comigo, Quebrei minha promessa, &eacute; mais forte que eu, parece
vicio, toquei uma hoje enquanto tava trancado dentro do
quarto...desculpem....desta
vez mirei direto e n&atilde;o acertei nada! Pelo menos isso! Nando
j&aacute; que voc&ecirc; n&atilde;o
pode ajudar n&atilde;o piore as coisas tente fazer voc&ecirc; [quanto
mais idiota melhor 3] ou [ejaculacao precose o retorno],at&eacute;
parece que voc&ecirc; nunca passou aperto por causa da "pomba
branca"... e Francisco
lopez o cara da TECTOY disse para min que para limpar lentes existe um
CD LIMPADOR aqui em casa tem, sabe...aquele que tem uma
m&uacute;sicas em v&aacute;rias linguas com uma micro
escovinha...enquanto se ouve a m&uacute;sica
ele limpa a lente... mas o problema &eacute; o seguinte o CD LIMPADOR
limpa s&oacute; poeira,
sujeiras leves, n&atilde;o "gosmas" que j&aacute; secaram! Eu tentei
passar mas n&atilde;o
deu , o console t&aacute; seguinho n&atilde;o l&ecirc; nada ! Lestat
n&atilde;o tentei comer meu dreamcast
e tambem n&atilde;o comecei a gozar agora n&atilde;o j&aacute; &eacute;
a 5&ordf; vez &eacute; o que isso tem a ver?
Francisco prefiro n&atilde;o dizer o bairro onde moro por que as coisas
podem piorar,
tem um cara at&eacute; querendo colocar isto tudo em uma p&aacute;gina
imagina se descobrem
onde eu moro...vou sofrer pro resto da vida! (nunca pensei que uma
punheta fosse acabar comigo<img style="width: 15px; height: 15px;" alt="" src="../images/icones/icon_sad.gif" hspace="2" />!),
contei isso que t&aacute; acontecendo comigo pros meus colegas e na
minha classe j&aacute; me
colocaram at&eacute; apelido "GONZAGUINHA" sabem por que
n&eacute;!?...aquele sanfoneiro! Quem poder me ajudar, respondam esta
mensagem neste
forum, eu agrade&ccedil;o, e quanto a minha m&atilde;e para voc&ecirc;s
terem id&eacute;ia eu tenho de
apagar o hist&oacute;rico do meu computador por que ela checa tudo,
j&aacute; pensou se ela
entra neste site e descobre tudo? que vergonha e que cossa que eu vou
tomar...voc&ecirc;s podem at&eacute; me achar infantil mas s&oacute;
tenho 13 anos t&ocirc; descobrindo
as coisas agora! &Eacute; errando que se aprende, voc&ecirc;s acham que
ia fazer isso logo
no meu dreamcast ! Ajuda &eacute; s&oacute; isso que t&ocirc;
precisando.<br />





<br />




<span style="font-weight: bold; font-style: italic;">
E agora , s&oacute; falta uma parte e Leonam ainda n&atilde;o conseguiu resolver seu problema
com o dreamcast ! Conseguir&aacute; ele consertar seu dreamcast e fazer com que sua m&atilde;e
n&atilde;o descubra toda a verdade ? Pior ainda , conseguir&aacute; ele se conter e parar de
bater punheta , prevenindo que estrague ainda mais seu dreamcast ou otra coisa
de seu quarto ?</span><br />





<br />





_________________________________________________________________________<br />





<br />




<span style="font-weight: bold; text-decoration: underline;">
QUEBREI MEU DREAMCAST - PARTE 4</span><br />





<br />




<span style="font-weight: bold; font-style: italic;">
Sem mais rodeio, devaneios e reacapitula&ccedil;&otilde;es, assistam agora ao final da mini-s&eacute;rie
"QUEBREI O MEU DREAMCAST" protagonizada pelo gal&atilde; do momento(o primeiro
gal&atilde; da hist&oacute;ria que &eacute; reconhecido como punheteiro!) , Leonam!</span></p>




<p align="justify" class="MsoNormal">
Galera finalmente meu terror chegou ao fim...gra&ccedil;as a Deus...n&atilde;o apanhei mas
foi muito mais pior eu juro!Passei pela situa&ccedil;&atilde;o mais embara&ccedil;ante da minha vida
Como eu tava vendo que o trem ia ficar pro meu lado... abri o jogo com o meu
pai...foi assim depois que cheguei da escola chamei meu pai no quarto encostei
a porta e contei tudo(minha cara rachou de tanta vergonha...)falei "<span style="font-weight: bold;">PAI
PELO AMOR DE DEUS, O SENHOR JURA QUE SE EU TE CONTAR UMA COISA O SENHOR N&Atilde;O
CONTA PRA MAIS NINGUEM</span>" ele concordou...(eu acreditei...<img style="width: 15px; height: 15px;" alt="" src="../images/icones/icon_rolleyes.gif" hspace="2" />)ent&atilde;o fechei os
olhos e contei: PAI FOI EU QUE QUEBREI O VIDEOGAME MAS FOI SEM QUERER, EU <span class="posthilit">ESPORREI</span> NELE! Ele riu, riu de chorar, a&iacute; eu falei: <span style="font-weight: bold;">FOI
SEM QUERER T&Ocirc; MORRENDO DE VERGONHA MAS FOI ISSO QUE ACONTECEU</span> <img style="width: 20px; height: 15px;" alt="" src="../images/icones/icon_blush.gif" hspace="2" />,
at&eacute; a&iacute; tudo bem,
ele disse que ia dar um jeito de concertar,me deu uma bronca por ter
acessado o
site XXX,nunca mais entro em site de sexo eu prometo !, voltamos para
mesa
almo&ccedil;amos e eu tava j&aacute; at&eacute; um pouco
ali*****...voc&ecirc;s sabem pai sempre da um
jeito em tudo, MAS N&Atilde;O PENSEI QUE ELE FOSSE FAZER DESTE JEITO!
SABEM O QUE ELE
FEZ...CONTOU PRA MINHA M&Atilde;E...eu tava l&aacute; no quarto deitado
na cama jogando meu
gameboy(STREET FIGHTER2 ADORO !) quando entra minha m&atilde;e COM UM
SORRIZINHO
SACANA de m&atilde;o dada com meu pai ent&atilde;o ela disse: LEO EU E
SEU PAI PRECISAMOS
CONVERSAR COM VOC&Ecirc;(acho que minha alma saiu do corpo naquela
hora,t&ocirc; sem jeito
de olhar para minha m&atilde;e at&eacute; agora!), A&Iacute;
COME&Ccedil;OU A SE&Ccedil;&Atilde;O DE EDUCA&Ccedil;&Atilde;O
SEXUAL... (olha
que palha&ccedil;ada): <span style="font-weight: bold;">VOC&Ecirc; LEO AGORA T&Aacute; VIRANDO RAPAZINHO</span>
(minhas orelhas ficaram
pegando fogo de vergonha) T&Aacute; DEIXANDO DE SER
CRIAN&Ccedil;A...SEU CORPO AGORA VAI
COME&Ccedil;AR TER MUDAN&Ccedil;AS SUA VOZ J&Aacute; T&Aacute;
COME&Ccedil;ANDO A MUDAR,V&Atilde;O CRESCER PELOS NO SEU CORPO (eu
s&oacute; olhei pra cara do meu pai<img style="width: 15px; height: 15px;" alt="" src="../images/icones/icon_confused.gif" hspace="2" />)
SABE LEO VOC&Ecirc; T&Aacute; VIRANDO UM ADOLESCENTE (como eu
n&atilde;o soubesse na escola j&aacute; passaram aquela fita dos
coelhos TICO E TICA sabem
aquela baboseira dois coelhos mongoloides que crescem e transam na
maior pureza..."olha a TICA ta crescendo
seios e menstrua" "olha o TICO t&aacute; ficando com a voz grossa e com
p&ecirc;los por todo o corpo... &ocirc; meu Deus o que &eacute; aquilo
que o TICO est&aacute; fazendo professora pergunta TICA ele est&aacute;
se MASTURBANDO TINA...mas o que &eacute;
masturba&ccedil;&atilde;o...e por a&iacute; vai...") Minha m&atilde;e
ainda disse: QUANDO DER VONTADE
DE FAZER AQUILO...VAI NO BANHEIRO FILHO ASSIM VOC&Ecirc; N&Atilde;O
CORRE O RISCO DE SUJAR
COISAS QUE N&Atilde;O DEVE, (minha vontade era de explodir), DEPOIS QUE
VOC&Ecirc; FAZER
AQUILO LAVE AS M&Atilde;OS PARA N&Atilde;O SUJAR AS COISAS DE
ESPERMA(voc&ecirc;s podem imaginar como estou agora ) o pior ainda
est&aacute; por vir...
Voc&ecirc;s n&atilde;o acreditam o que minha m&atilde;e fez: ...LIGOU
PARA TODAS MINHAS TIAS(6) E
CONTOU QUE J&Aacute; ME MASTURBO(meu DEUS o que ela queria com isso?)
AT&Eacute; PARA MINHA V&Oacute;
QUE MORA NO RIO ELA LIGOU,CONTOU AT&Eacute; PRA MO&Ccedil;A QUE
TRABALHA AQUI EM CASA <img style="width: 15px; height: 15px;" alt="" src="../images/icones/icon_ooooh.gif" hspace="2" />(que &eacute;
gatinha!<img style="width: 15px; height: 17px;" alt="" src="../images/icones/icon_mrgreen.gif" hspace="2" />)....(agora mais ou menos as 16:45 minha v&oacute; me ligou para me encher dizendo que isso &eacute; feio pra min parar de fazer
isto <span style="font-weight: bold;">ESTOU SEM MORAL COM MINHA FAMILIA</span><img style="width: 15px; height: 17px;" alt="" src="../images/icones/icon_cry.gif" hspace="2" />, minha m&atilde;e me expos ao ridiculo! Minhas
tias do jeito que s&atilde;o j&aacute; devem ter contado pros meus primos...t&ocirc; ferrado, <span style="font-weight: bold;">CONCLUS&Atilde;O
DESSE ROLO: MEU PAI DEPOIS DO SERVI&Ccedil;O PASSOU NA LOCADORA E DEIXOU MEU DREAMCAST
PARA CONCERTO,MAS OLHEM QUE ABSURDO, O CARA DISSE QUE A LENTE J&Aacute; ERA E UMA NOVA
ADVINHEM QUANTO CUSTA... 450 REIAS SEM A M&Atilde;O DE OBRA DO LADR&Atilde;O DO T&Eacute;CNICO<img style="width: 15px; height: 15px;" alt="" src="../images/icones/icon_eek.gif" hspace="2" /></span>(mas
ele deixou para concertar acho que &eacute; para n&atilde;o me
desapontar,vou dar a id&eacute;ia de comprar
um console Japon&ecirc;s acho que t&aacute; nesse pre&ccedil;o...
&eacute; bem melhor n&eacute;?), MAS MESMO ASSIM ME PASSOU UM
SAB&Atilde;O PARA TER MAIS CUIDADO QUANDO FOR FAZER AQUILO (eu t&ocirc;
com complexo de masturba&ccedil;&atilde;o... toda hora que pinta
vontade...fico
na maior paranoia de estragar alguma coisa de sujar alguma coisa...acho
que
isso marcou minha vida pra sempre!)" PARA TODAS AS PESSOAS DESTE FORUM
QUE
TENTARAM ME AJUDAR "OBRIGADO" N&Atilde;O SE MASTURBEM PERTO DE
VIDEOGAME PODE QUEBRAR (isto tinha que vir no manual do aparelho)
Valeu amigos!<br />





<br />




<span style="font-style: italic; font-weight: bold;">
E assim termina a saga ... &Eacute; s&oacute; !</span><br />





<br />




<br />
</p>





<p style="font-weight: bold; text-align: center;"></p>





<p style="font-weight: bold; text-align: center;">Acesse o <a href="http://gigacom.freeforums.org/index.php" target="_blank">Trombone</a> e comente sobre essa mat&eacute;ria!<br />


</p>














<br />














<br />
































<div style="clear: both;">
	</div>










































	</div>








































	
<div id="left">
	
<div id="left_top"><br />











</div>








































	
			
<div style="text-align: center;"><big><a href="../index.html"><big><span style="font-weight: bold; font-style: italic; text-decoration: underline;"></span></big></a></big>
























				<big><img style="width: 200px; height: 20px;" alt="" src="../images/botoes/indice.png" /><br />













<br />













<a href="../index.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/home.png" /></a><br />













</big><a href="a_artigosdiversos.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/diversos.png" /></a><br />













<br />













<a href="../deunarevista/a_deunarevista.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/deunarevista.png" /></a><br />













<a href="../gambiarra/a_gambiarra.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/gambiarra.png" /></a><br />













<a href="../necroterio/a_necroterio.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/necroterio.png" /></a><br />













<a href="../oficina/a_oficina.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/oficina.png" /></a><br />















<a href="http://gigacom.freeforums.org/index.php"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/trombone.png" /></a><br />













<br />















<a href="../8bits/a_8bits.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/8bits.png" /></a><br />















<a href="../16bits/a_16bits.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/16bits.png" /></a><br />















<a href="../32bits/a_32bits.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/3264bits.png" /></a><br />















<a href="../portateis/a_portateis.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/portateis.png" /></a><br />













<br />













<a href="../downloads/a_downloads.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/downloads.png" /></a><br />















<a href="../links/a_links.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/linksafiliados.png" /></a><br />















<a href="../historico.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/historico.png" /></a><big><a href="../gambiarra/a_gambiarra.html"><big><span style="font-weight: bold; font-style: italic; text-decoration: underline;"></span></big></a></big><br />















<big><a href="../32bits/a_32bits.html"><big><span style="font-weight: bold; font-style: italic; text-decoration: underline;"></span></big></a></big></div>















<br />













<div style="text-align: center;"><img style="width: 200px; height: 20px;" alt="" src="../images/botoes/vertambem.png" /><br />









</div>













<big><big><span style="font-weight: bold; font-style: italic;"></span></big></big>
<div class="comnews">
			






























	

			<a href="../oficina/oficina_entendendo_dreamcast.html"><span style="font-weight: bold; font-style: italic; text-decoration: underline;">Entendendo o Dreamcast</span></a><br />

<span style="font-weight: normal;">Vou explicar aqui da melhor forma
poss&iacute;vel, como o Dreamcast pode ser desmontado e reparado, sem
ser danificado, assim como as principais fun&ccedil;&otilde;es de cada
componente.</span>







<div style="text-align: right;"><a href="../oficina/oficina_entendendo_dreamcast.html">leia mais</a><br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />




<br />



<br />


<br />


<br />




<br />




<br />




</div>









</div>









<span style="text-decoration: underline;"><span style="font-weight: bold;"><br />









<br />









</span></span></div>

































































<div id="footer">
<p>Gigacom Old Games!</p>























<p>Tudo sobre&nbsp;jogos mais antiguinhos e outras coisitas mais.</p>























<br />























</div>







































</div>








































</div>








































<!-- footer ends-->
</body>
</html>
