<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>




  
  
  
  <meta http-equiv="content-type" content="text/html; charset=UTF-8" />



  


  
  
  
  
  
  <title>Gigacom Old Games!</title>
  <meta name="keywords" content="" />




  
  
  
  <meta name="description" content="Tudo sobre jogos e video games antigos" />




  
  
  
  <link href="styles.css" rel="stylesheet" type="text/css" media="screen" />




  
  
  
  <meta content="Gigacom" name="author" />
</head>


<body>




<div id="content">
<div id="main">
<div id="right">
<div id="header">
<div style="font-style: italic; font-family: Comic Sans MS;" id="logo"><big> </big>
<h1><big><big><a href="../index.html"><br />




</a></big></big></h1>




<big> </big></div>




<div id="menu">
<ul>




  <li id="button1"><a href="../gambiarra/a_gambiarra.html" title="">Gambiarra</a></li>




  <li id="button2"><a href="../oficina/a_oficina.html" title="">Oficina do Giga</a></li>




  <li id="button3"><a href="../necroterio/a_necroterio.html" title="">Necrot&eacute;rio</a></li>




  <li id="button4"><a href="../deunarevista/a_deunarevista.html" title="">Deu
na revista!</a></li>




  <li id="button5"><a target="_blank" href="http://gigacom.freeforums.org/index.php" title="">Trombone</a></li>




</ul>




</div>




</div>




<h4 style="font-weight: bold;">Lynx - Conhe&ccedil;a o Atari Lynx <br />




</h4>





<p style="font-weight: bold; text-align: justify;"><img style="width: 77px; height: 79px; float: left;" alt="" src="../images/avatares/avatar_gigacom.jpg" hspace="2" />:::. <span style="text-decoration: underline;">Por Gigacom</span>
-<span style="font-weight: normal;">
<span style="font-style: italic; font-weight: bold;">Na segunda metade
da d&eacute;cada de 80, uma empresa que at&eacute; ent&atilde;o era
apenas uma softhouse, estava dando vida a um novo e
revolucion&aacute;rio console.&nbsp;A Atari ficou de olho nesse
projeto, e quando notou que essa empresa estava passando por
dificuldades financeiras, resolveu fazer uma oferta e comprar o projeto
do console. E foi assim que nasceu o Atari Lynx.</span></span><span style="font-weight: normal;"></span></p>


<p style="font-weight: bold; text-align: center;">___________________________________________________________________</p>


<p style="text-align: justify;">Voc&ecirc; j&aacute; ouviu falar da
Epyx com toda certeza. Acha que n&atilde;o? Pois ent&atilde;o me diga,
quem foi que criou o t&atilde;o famoso Jogos de Ver&atilde;o? Pois
&eacute;, foi ela. A Epyx era uma empresa norte americana, uma
softhouse por excel&ecirc;ncia. Ela criou diversos jogos de sucesso, e
Jogos de Ver&atilde;o (tamb&eacute;m conhecido como California Games)
foi o que mais se destacou tanto aqui como no exterior.</p>

<p style="text-align: center;"><img src="images/lynx_conheca_44.gif" alt="" height="87" width="400" /></p>

<p style="text-align: justify; text-decoration: underline;"><strong>Hist&oacute;ria</strong></p>

<p style="text-align: justify;">Em meados de 86, ela inicou o projeto
de um novo console com capacidades promissoras. Um sistema com CPU de 8
bits, por&eacute;m tendo um processador gr&aacute;fico de 16 bits. De
inicio, o projeto previa a constru&ccedil;&atilde;o de um console de
mesa como os conhecidos at&eacute; ent&atilde;o, por&eacute;m a Epyx
teve a id&eacute;ia de lan&ccedil;ar um video game port&aacute;til aos
moldes como os conhecemos hoje (o que at&eacute; ent&atilde;o era
praticamente in&eacute;dito) evitando concorrer diretamente com o NES
da Nintendo, e quem sabe revolucionar novamente a industria dos video
games. No final de 87 o projeto estava pronto, recebeu o nome de Handy
e no ano seguinte foi dado inicio aos planos da empresa de fabricar em
larga escala e vender o console nos Estados Unidos. Em janeiro de 89 o
console foi apresentado na CES de inverno, causando boas
impress&otilde;es. Por&eacute;m, a Epyx n&atilde;o possuia o dinheiro
necess&aacute;rio para iniciar de fato a produ&ccedil;&atilde;o do
console, e a Atari Corp. sabendo disso, fez uma proposta de compra do
projeto do console e contrata&ccedil;&atilde;o da Epyx para a
produ&ccedil;&atilde;o de jogos para o mesmo. Ap&oacute;s algumas
pequenas modifica&ccedil;&otilde;es feitas pela Atari, o console passou
para a linha de produ&ccedil;&atilde;o e naquele mesmo ano, na CES de
ver&atilde;o, a Atari apresentou o Lynx como o primeiro console
portatil com tela colorida do mundo, custando a bagatela de $ 189,95
(se hoje isso j&aacute; &eacute; uma soma consider&aacute;vel, imagine
ent&atilde;o naquela &eacute;poca).</p>

<p style="text-align: justify;">
  <object classid="clsid:D27CDB6E-AE6D-11cf-96B8-444553540000" codebase="http://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=7,0,0,0" height="547" width="674">
    <param name="flash_component" value="ImageViewer.swc" />
    <param name="movie" value="images/lynx_conheca_00.swf" />
    <param name="quality" value="high" />
    <param name="FlashVars" value="flashlet={imageLinkTarget:'_blank',captionFont:'Verdana',titleFont:'Verdana',showControls:true,frameShow:false,slideDelay:5,captionSize:10,captionColor:#000000,titleSize:10,transitionsType:'Iris',titleColor:#000000,slideAutoPlay:false,imageURLs:['images/lynx_conheca_00.jpg','images/lynx_conheca_01.jpg','images/lynx_conheca_09.jpg','images/lynx_conheca_08.jpg','images/lynx_conheca_02.jpg','images/lynx_conheca_03.JPG','images/lynx_conheca_04.JPG','images/lynx_conheca_05.jpg','images/lynx_conheca_06.JPG','images/lynx_conheca_07.JPG','images/lynx_conheca_00.jpg'],slideLoop:false,frameThickness:2,imageLinks:['http://macromedia.com/','http://macromedia.com/','http://macromedia.com/'],frameColor:#000000,bgColor:#000000,imageCaptions:[]}" />
    
<embed src="images/lynx_conheca_00.swf" quality="high" flashvars="flashlet={imageLinkTarget:'_blank',captionFont:'Verdana',titleFont:'Verdana',showControls:true,frameShow:false,slideDelay:5,captionSize:10,captionColor:#000000,titleSize:10,transitionsType:'Iris',titleColor:#000000,slideAutoPlay:false,imageURLs:['images/lynx_conheca_00.jpg','images/lynx_conheca_01.jpg','images/lynx_conheca_09.jpg','images/lynx_conheca_08.jpg','images/lynx_conheca_02.jpg','images/lynx_conheca_03.JPG','images/lynx_conheca_04.JPG','images/lynx_conheca_05.jpg','images/lynx_conheca_06.JPG','images/lynx_conheca_07.JPG','images/lynx_conheca_00.jpg'],slideLoop:false,frameThickness:2,imageLinks:['http://macromedia.com/','http://macromedia.com/','http://macromedia.com/'],frameColor:#000000,bgColor:#000000,imageCaptions:[]}" pluginspage="http://www.macromedia.com/shockwave/download/index.cgi?P1_Prod_Version=ShockwaveFlash" type="application/x-shockwave-flash" height="547" width="674"> 
  </object>
</p>

<p style="text-align: justify;">Por&eacute;m no mesmo ano que o Lynx
apareceu, o Game Boy estreou custando $100,00 a menos, e apesar dele
ser tecnicamente inferior ao Lynx, obteve muito mais sucesso e apoio de
softhouses, e consequentemte dominou o mercado de portat&eacute;is.
Mesmo assim, o Lynx obteve um bom desempenho no come&ccedil;o, e a
Atari passou a lucrar at&eacute; que em 91, quando a Sega lan&ccedil;ou
o Game Gear no mercado americano, acompanhado de uma extensiva campanha
publicit&aacute;ria, o mercado de portat&eacute;is mudou, tendo o Game
Boy em primeiro lugar, o Game Gear meio longe mas nem tanto do Game
Boy, e l&aacute; atr&aacute;s engolindo poeira de todo mundo, estava o
Lynx j&aacute; com uma seten&ccedil;a de abandono estampada na testa.
Mas curiosamente, o Lynx n&atilde;o morreu...</p>

<p style="text-align: justify;">A Atari continuou a dar suporte ao seu
pequeno-mas-nem-tanto console. Uma revisada no hardware e no sistema de
fabrica&ccedil;&atilde;o do console, deu origem ao Lynx II j&aacute; em
91. Era uma vers&atilde;o um pouco menor, mais enxuta, menos engolidora
de pilhas, vinha numa caixinha diferente e de quebra reapareceu no
mundo com uma bela campanha publicit&aacute;ria. O Lynx at&eacute; que
ganhou folego para continuar correndo, mas infelizmente n&atilde;o com
o mesmo vigor que seus concorrentes.</p>

<p style="text-align: justify;">Eu diria que nesses dias o Lynx teve um
desempenho igual ao daqueles maratonistas que ficam na muvuca da
S&atilde;o Silvestre. Eles n&atilde;o s&atilde;o os primeiros a largar,
ficam se arrastando durante o caminho todo, e quando chegam no final os
vencedores j&aacute; est&atilde;o em casa com os p&eacute;s de molho em
&aacute;gua quente com sal. Apesar de ter sido descontinuada a sua
fabrica&ccedil;&atilde;o em meados de 93, foi mais ou menos desse modo
que o Lynx seguiu sua carreira. Ele continuou presente e viu o Game
Gear morrer bem diante de seus olhos, viveu tamb&eacute;m para ver o
Jaguar, o filho mais novo da Atari, conhecer a ascenss&atilde;o e o
fracasso no decorrer dos anos (o que pode ter sido bom para o ego desse
console, j&aacute; que ele foi deixado de lado quando a Atari investiu
pesado no Jaguar). E apesar da Atari ter matado "oficialmente" a sua
produ&ccedil;&atilde;o de jogos para o Lynx (que estava parada desde 93
tamb&eacute;m), em 97 ele ainda recebia jogos de outras softhouses,
joguinhos at&eacute; bons diga-se de passagem. E em 99, a Hasbro pegou
da Atari v&aacute;rios de seus projetos na justi&ccedil;a e passou a
ser dona do Lynx, assim como de outras coisas da Atari. Assim, a Hasbro
tornou os direitos de produ&ccedil;&atilde;o e publica&ccedil;&atilde;o
de jogos para o Lynx em dom&iacute;nio publico. Desde ent&atilde;o,
diversos f&atilde;s do console ao redor do mundo, e at&eacute; mesmo
algumas empresas, tem esporadicamente lan&ccedil;ado alguns jogos para
esse console.</p>

<p style="text-align: justify;"><strong><span style="text-decoration: underline;">O console</span> </strong></p>

<p style="text-align: justify;">O Lynx em si &eacute; um
consolez&atilde;o. Acreditem, o bicho &eacute; grande, quase da largura
de um caderno, e s&oacute; d&aacute; para carreg&aacute;-lo ou numa
mochila ou no bolso de um bermud&atilde;o de funkeiro. Ele usa 6 pilhas
do tipo AA, que d&atilde;o uma autonomia m&eacute;dia de 4-5 horas.
Pode parecer pouco, mas era um consumo aceit&aacute;vel para o mercado
norte americano. Os cartuchinhos apesar de finos, eram de um tamnho
digamos... metade do de um cartucho de Master ou Mega Drive. Da&iacute;
vem a quest&atilde;o... era para o console realmente ser
port&aacute;til ou n&atilde;o? Acreditem, apesar de bem l&aacute; no
inicio os projetistas da Epyx terem planejado criar um console de mesa,
logo o mesmo foi focado para virar um portatil bem avan&ccedil;ado. A
tecnologia usada para fabricar a placa m&atilde;e do Lynx &eacute;
bastante semelhante a usada no SNES (chips pequenos, minituarizados,
com baixo consumo de energia), por&eacute;m o que mais consome energia
obviamente &eacute; o conjunto da tela LCD do console. O LCD sozinho
n&atilde;o consume muito, por&eacute;m a l&acirc;mpada que fica
atr&aacute;s da tela, essa sim &eacute; que consome. Essa l&acirc;mpada
&eacute; que d&aacute; o brilho e ilumina&ccedil;&atilde;o da tela, sem
ela o Lynx ficaria semelhante (ou pior) que o Game Boy Color por
exemplo, ou seja, ruim de se jogar.</p>

<p style="text-align: justify;">
  <object classid="clsid:D27CDB6E-AE6D-11cf-96B8-444553540000" codebase="http://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=7,0,0,0" height="547" width="674">
    <param name="flash_component" value="ImageViewer.swc" />
    <param name="movie" value="images/lynx_conheca_01.swf" />
    <param name="quality" value="high" />
    <param name="FlashVars" value="flashlet={imageLinkTarget:'_blank',captionFont:'Verdana',titleFont:'Verdana',showControls:true,frameShow:false,slideDelay:5,captionSize:10,captionColor:#000000,titleSize:10,transitionsType:'Iris',titleColor:#000000,slideAutoPlay:false,imageURLs:['images/lynx_conheca_41.JPG','images/lynx_conheca_42.JPG','images/lynx_conheca_43.JPG','images/lynx_conheca_41.JPG'],slideLoop:false,frameThickness:2,imageLinks:['http://macromedia.com/','http://macromedia.com/','http://macromedia.com/'],frameColor:#000000,bgColor:#000000,imageCaptions:[]}" />
    
<embed src="images/lynx_conheca_01.swf" quality="high" flashvars="flashlet={imageLinkTarget:'_blank',captionFont:'Verdana',titleFont:'Verdana',showControls:true,frameShow:false,slideDelay:5,captionSize:10,captionColor:#000000,titleSize:10,transitionsType:'Iris',titleColor:#000000,slideAutoPlay:false,imageURLs:['images/lynx_conheca_41.JPG','images/lynx_conheca_42.JPG','images/lynx_conheca_43.JPG','images/lynx_conheca_41.JPG'],slideLoop:false,frameThickness:2,imageLinks:['http://macromedia.com/','http://macromedia.com/','http://macromedia.com/'],frameColor:#000000,bgColor:#000000,imageCaptions:[]}" pluginspage="http://www.macromedia.com/shockwave/download/index.cgi?P1_Prod_Version=ShockwaveFlash" type="application/x-shockwave-flash" height="547" width="674"> 
  </object>
</p>

<p style="text-align: justify;">J&aacute; o layout do console a
primeira vista engana, pois o que parece ser um video game bem bacana,
chateia um pouco na hora de jogar. Ele tem 4 bot&otilde;es de disparo,
que sabe Deus por ideia de quem, ficam separados pelo auto-falante do
console, o mais engra&ccedil;ado &eacute; que na verdade esses quatro
tem a fun&ccedil;&atilde;o de apenas 2 bot&otilde;es, acredito que a
id&eacute;ia era facilitar na hora de jogar com o console na
posi&ccedil;&atilde;o vertical (sim, curiosamente alguns games
s&atilde;o jogados dessa maneira). H&aacute; mais 6 pequenos
bot&otilde;es, 3 de cada lado da tela, com fun&ccedil;&otilde;es de
ligar/desligar o console, controlar o brilho da tela, dois para uso em
jogo com fun&ccedil;&otilde;es semelhantes ao Start/Select de outros
consoles e uma diferente que &eacute; a Restart. O volume do
auto-falante tamb&eacute;m &eacute; muito bom, chegando a ficar
par-a-par com o do Game Gear, e muito melhor que o do Game Boy. </p>

<p style="text-align: justify;">Os jogos do Lynx variam bastante em
qualidade, partindo dos "p&eacute;ssimos" financiados pela Atari (bem
ao estilo Jaguar), at&eacute; mesmo alguns bem notav&eacute;is de
outras empresas, como California Games, Todds Adventure, Papperboy e o
incrivel Shadow of the Beast da Eletronic Arts.</p>

<p style="text-align: justify;">De uma maneira geral, o Lynx tinha um
hardware invej&aacute;vel. Apesar de ser um console de 8-bits, era
possivel fazer jogos para ele com gr&aacute;ficos bem superiores
at&eacute; mesmo que os do Master System. A qualidade dos efeitos
sonoros que o console era capaz de executar tamb&eacute;m n&atilde;o
deixavam nada a desejar, apesar do som lembrar bastante aqueles que
vemos nos Atari 2600/5200/7800. </p>

<p style="text-align: justify;">Aqui no Brasil esse console
simplesmente passou despercebido. Praticamente o que se conhecia aqui
em mat&eacute;ria de portat&eacute;is eram apenas o Game Gear e o Game
Boy. No resto do mundo o console apesar de ser conhecido, pouco foi
comercializado. Somente nos Estados Unidos &eacute; que o console se
popularizou, mas n&atilde;o chegou perto nem mesmo do Game Gear. </p>

<p style="text-align: justify; text-decoration: underline;"><strong>Os jogos</strong></p>

<p style="text-align: justify;">Um video game n&atilde;o &eacute; um
bom video game se n&atilde;o tiver jogos bons. Felizmente o Lynx possui
v&aacute;rios jogos de &oacute;tima qualidade! Para quem n&atilde;o
&eacute; familiarizado com a biblioteca desse console, eu recomendaria
que desse uma olhada ao menos nesses aqui:</p>

<p style="text-align: justify; text-decoration: underline;"><strong>California Games</strong></p>

<p style="text-align: justify;">Qu&ecirc;? Achou que aquele Jogos de
Ver&atilde;o do Master s&oacute; podia ser superado pelo do Mega Drive?
Merm&atilde;o &eacute; que tu n&atilde;o conheceu o California Games
para o Lynx. Gra&ccedil;as ao chip gr&aacute;fico de 16 bits, essa
vers&atilde;o para Lynx possuia uma resolu&ccedil;&atilde;o
gr&aacute;fica excelente. Os efeitos de anima&ccedil;&atilde;o do jogo
est&atilde;o muito melhores do que em qualquer outro console onde esse
game apareceu, e apesar de apenas 4 modalidades estarem disponiveis as
mesmas s&atilde;o primorosas tanto em termos gr&aacute;ficos como claro
em divers&atilde;o. A jogabilidade no surf &eacute; de longe a melhor,
&eacute; facil executar qualquer 360 e outras manobras dificilimas que
em outros consoles s&atilde;o um parto de se fazer. No halfpipe (skate)
rola um efeito de zoom enquanto voc&ecirc; faz as manobras ou pega
velocidade. No footbag, os detalhes da cidade ao fundo s&atilde;o bem
interessantes, com pr&eacute;dios que a primeira vista lembram muito
Manhatan, mas a vista &eacute; da California mesmo. E por fim, BMX
&eacute; de embasbacar os olhos, as pista tem muitos obstaculos mas
&eacute; bem mais legal que a do Master System. Eu tentei tirar alguns
prints das manobras fodasticas que fiz, como o mortal triplo pra
tr&aacute;s de pesco&ccedil;o quebrado no BMX, ou o 360 quadruplo
dentro da onda no surf... mas &eacute; que ficou meio complicado tirar
os prints e jogar ao mesmo tempo... abaixo, algumas fotos do jogo:</p>

<p style="text-align: center;">
  <object classid="clsid:D27CDB6E-AE6D-11cf-96B8-444553540000" codebase="http://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=7,0,0,0" height="325" width="400">
    <param name="flash_component" value="ImageViewer.swc" />
    <param name="movie" value="images/lynx_conheca_02.swf" />
    <param name="quality" value="high" />
    <param name="FlashVars" value="flashlet={imageLinkTarget:'_blank',captionFont:'Verdana',titleFont:'Verdana',showControls:true,frameShow:false,slideDelay:5,captionSize:10,captionColor:#000000,titleSize:10,transitionsType:'Iris',titleColor:#000000,slideAutoPlay:false,slideLoop:false,frameThickness:2,imageLinks:['http://macromedia.com/','http://macromedia.com/','http://macromedia.com/'],frameColor:#000000,bgColor:#000000,imageCaptions:[],imageURLs:['images/lynx_conheca_20.JPG','images/lynx_conheca_28.JPG','images/lynx_conheca_21.JPG','images/lynx_conheca_22.JPG','images/lynx_conheca_23.JPG','images/lynx_conheca_24.JPG','images/lynx_conheca_25.JPG','images/lynx_conheca_26.JPG','images/lynx_conheca_27.JPG','images/lynx_conheca_28.JPG','images/lynx_conheca_20.JPG']}" />
    
<embed src="images/lynx_conheca_02.swf" quality="high" flashvars="flashlet={imageLinkTarget:'_blank',captionFont:'Verdana',titleFont:'Verdana',showControls:true,frameShow:false,slideDelay:5,captionSize:10,captionColor:#000000,titleSize:10,transitionsType:'Iris',titleColor:#000000,slideAutoPlay:false,slideLoop:false,frameThickness:2,imageLinks:['http://macromedia.com/','http://macromedia.com/','http://macromedia.com/'],frameColor:#000000,bgColor:#000000,imageCaptions:[],imageURLs:['images/lynx_conheca_20.JPG','images/lynx_conheca_28.JPG','images/lynx_conheca_21.JPG','images/lynx_conheca_22.JPG','images/lynx_conheca_23.JPG','images/lynx_conheca_24.JPG','images/lynx_conheca_25.JPG','images/lynx_conheca_26.JPG','images/lynx_conheca_27.JPG','images/lynx_conheca_28.JPG','images/lynx_conheca_20.JPG']}" pluginspage="http://www.macromedia.com/shockwave/download/index.cgi?P1_Prod_Version=ShockwaveFlash" type="application/x-shockwave-flash" height="325" width="400"> 
  </object>
</p>

<p style="text-align: justify; text-decoration: underline;"><strong>Batman Returns</strong></p>

<p style="text-align: justify;">O filme que virou game para
v&aacute;rios consoles, fez sua estr&eacute;ia tamb&eacute;m no Lynx. O
jogo &eacute; dificil pacacete, at&eacute; porque o Batman aqui
s&oacute; tem uma &uacute;nica vida e tem que dar porrada numa
infinidade de inimigos. O interessante &eacute; que v&aacute;rios
badguys do filme aparecem aqui em detalhes. Os motoqueiros com
cabe&ccedil;a de caveira, os palha&ccedil;os, os adestradores de
macacos, todos est&atilde;o no game e d&atilde;o bastante trabalho para
o morceg&atilde;o. N&atilde;o cheguei a conhecer qualquer outra
vers&atilde;o de Batman Returns que fosse parecida com essa aqui. As
anima&ccedil;&otilde;es s&atilde;o muito boas, a trilha sonora &eacute;
bem legal e a jogabilidade tamb&eacute;m &eacute; muito boa, com
respostas r&aacute;pidas e bem precisas. </p>

<p style="text-align: center;">
  <object classid="clsid:D27CDB6E-AE6D-11cf-96B8-444553540000" codebase="http://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=7,0,0,0" height="325" width="400">
    <param name="flash_component" value="ImageViewer.swc" />
    <param name="movie" value="images/lynx_conheca_03.swf" />
    <param name="quality" value="high" />
    <param name="FlashVars" value="flashlet={imageLinkTarget:'_blank',captionFont:'Verdana',titleFont:'Verdana',showControls:true,frameShow:false,slideDelay:5,captionSize:10,captionColor:#000000,titleSize:10,transitionsType:'Iris',titleColor:#000000,slideAutoPlay:false,imageURLs:['images/lynx_conheca_10.JPG','images/lynx_conheca_11.JPG','images/lynx_conheca_12.JPG','images/lynx_conheca_13.JPG','images/lynx_conheca_35.JPG','images/lynx_conheca_10.JPG'],slideLoop:false,frameThickness:2,imageLinks:['http://macromedia.com/','http://macromedia.com/','http://macromedia.com/'],frameColor:#000000,bgColor:#000000,imageCaptions:[]}" />
    
<embed src="images/lynx_conheca_03.swf" quality="high" flashvars="flashlet={imageLinkTarget:'_blank',captionFont:'Verdana',titleFont:'Verdana',showControls:true,frameShow:false,slideDelay:5,captionSize:10,captionColor:#000000,titleSize:10,transitionsType:'Iris',titleColor:#000000,slideAutoPlay:false,imageURLs:['images/lynx_conheca_10.JPG','images/lynx_conheca_11.JPG','images/lynx_conheca_12.JPG','images/lynx_conheca_13.JPG','images/lynx_conheca_35.JPG','images/lynx_conheca_10.JPG'],slideLoop:false,frameThickness:2,imageLinks:['http://macromedia.com/','http://macromedia.com/','http://macromedia.com/'],frameColor:#000000,bgColor:#000000,imageCaptions:[]}" pluginspage="http://www.macromedia.com/shockwave/download/index.cgi?P1_Prod_Version=ShockwaveFlash" type="application/x-shockwave-flash" height="325" width="400"> 
  </object>
</p>

<p style="text-align: justify; text-decoration: underline;"><strong>STUN Runner</strong></p>

<p style="text-align: justify;">Apesar de muita gente dizer que esse
&eacute; um dos melhores jogos do Lynx, eu diria que &eacute; apenas um
dos bem trabalhados mas mal acabados games desse video game. O jogo
t&eacute; que tem uma anima&ccedil;&atilde;o bem legal, que simula um
ambiente 3D. H&aacute; vozes digitalizadas, efeitos sonoros bons para
um port&aacute;til mas quanto a divers&atilde;o... bem, &eacute; nisso
que ele peca. Se tivessem investido um pouquinho mais nesse jogo, para
torn&aacute;-lo bem legal, com certeza teria feito muito mais sucesso,
quem sabe o suficiente at&eacute; para despontar em outros consoles.</p>

<p style="text-align: center;"> 
  <object classid="clsid:D27CDB6E-AE6D-11cf-96B8-444553540000" codebase="http://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=7,0,0,0" height="325" width="400">
    <param name="flash_component" value="ImageViewer.swc" />
    <param name="movie" value="images/lynx_conheca_04.swf" />
    <param name="quality" value="high" />
    <param name="FlashVars" value="flashlet={imageLinkTarget:'_blank',captionFont:'Verdana',titleFont:'Verdana',showControls:true,frameShow:false,slideDelay:5,captionSize:10,captionColor:#000000,titleSize:10,transitionsType:'Iris',titleColor:#000000,slideAutoPlay:false,imageURLs:['images/lynx_conheca_29.JPG','images/lynx_conheca_30.JPG','images/lynx_conheca_31.JPG','images/lynx_conheca_32.JPG','images/lynx_conheca_29.JPG'],slideLoop:false,frameThickness:2,imageLinks:['http://macromedia.com/','http://macromedia.com/','http://macromedia.com/'],frameColor:#000000,bgColor:#000000,imageCaptions:[]}" />
    
<embed src="images/lynx_conheca_04.swf" quality="high" flashvars="flashlet={imageLinkTarget:'_blank',captionFont:'Verdana',titleFont:'Verdana',showControls:true,frameShow:false,slideDelay:5,captionSize:10,captionColor:#000000,titleSize:10,transitionsType:'Iris',titleColor:#000000,slideAutoPlay:false,imageURLs:['images/lynx_conheca_29.JPG','images/lynx_conheca_30.JPG','images/lynx_conheca_31.JPG','images/lynx_conheca_32.JPG','images/lynx_conheca_29.JPG'],slideLoop:false,frameThickness:2,imageLinks:['http://macromedia.com/','http://macromedia.com/','http://macromedia.com/'],frameColor:#000000,bgColor:#000000,imageCaptions:[]}" pluginspage="http://www.macromedia.com/shockwave/download/index.cgi?P1_Prod_Version=ShockwaveFlash" type="application/x-shockwave-flash" height="325" width="400"> 
  </object>
</p>

<p style="text-align: justify; text-decoration: underline;"><strong>Blue Lightining</strong></p>

<p style="text-align: justify;">Ta&iacute; um joguinho que mostra a
capacidade do hardware desse console. Blue Lightining usa
gr&aacute;ficos vetoriais, simulando um ambiente 3D. Voc&ecirc; pilota
um F-18 pintado de azul, e sua miss&atilde;o &eacute; derrubar o
m&aacute;ximo de avi&otilde;es inimigos. Os efeitos gr&aacute;ficos
s&atilde;o muito bons, os avi&otilde;es quando atingidos explodem em
v&aacute;rios pedacinhos que voam pegando fogo para todos os lados. Os
efeitos sonoros &eacute; que s&atilde;o fracos, bem fraquinhos na
verdade. Algumas coisas do game lembram After Burner, como a mira para
atirar misseis e o sistema de contagem de muni&ccedil;&atilde;o. O jogo
lhe d&aacute; bastante liberdade de movimento, voc&ecirc; pode ascender
at&eacute; as nuvens ou dar um razante bem baixo, proximo ao solo.
Apesar disso tudo, falta mais a&ccedil;&atilde;o no jogo, o que
prejudica a divers&atilde;o. Para a &eacute;poca claro que o game do
jeito que est&aacute; era um prato cheio para qualquer jogador
(gr&aacute;ficos 3D s&oacute; se via em computadores dos mais poderosos
e caros), e querendo ou n&atilde;o foi um joguinho bastante vendido
para o Lynx. </p>

<p style="text-align: center;">
  <object classid="clsid:D27CDB6E-AE6D-11cf-96B8-444553540000" codebase="http://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=7,0,0,0" height="325" width="400">
    <param name="flash_component" value="ImageViewer.swc" />
    <param name="movie" value="images/lynx_conheca_05.swf" />
    <param name="quality" value="high" />
    <param name="FlashVars" value="flashlet={imageLinkTarget:'_blank',captionFont:'Verdana',titleFont:'Verdana',showControls:true,frameShow:false,slideDelay:5,captionSize:10,captionColor:#000000,titleSize:10,transitionsType:'Iris',titleColor:#000000,slideAutoPlay:false,slideLoop:false,frameThickness:2,imageLinks:['http://macromedia.com/','http://macromedia.com/','http://macromedia.com/'],frameColor:#000000,bgColor:#000000,imageCaptions:[],imageURLs:['images/lynx_conheca_45.JPG','images/lynx_conheca_46.JPG','images/lynx_conheca_47.JPG','images/lynx_conheca_48.JPG','images/lynx_conheca_49.JPG','images/lynx_conheca_50.JPG','images/lynx_conheca_45.JPG']}" />
    
<embed src="images/lynx_conheca_05.swf" quality="high" flashvars="flashlet={imageLinkTarget:'_blank',captionFont:'Verdana',titleFont:'Verdana',showControls:true,frameShow:false,slideDelay:5,captionSize:10,captionColor:#000000,titleSize:10,transitionsType:'Iris',titleColor:#000000,slideAutoPlay:false,slideLoop:false,frameThickness:2,imageLinks:['http://macromedia.com/','http://macromedia.com/','http://macromedia.com/'],frameColor:#000000,bgColor:#000000,imageCaptions:[],imageURLs:['images/lynx_conheca_45.JPG','images/lynx_conheca_46.JPG','images/lynx_conheca_47.JPG','images/lynx_conheca_48.JPG','images/lynx_conheca_49.JPG','images/lynx_conheca_50.JPG','images/lynx_conheca_45.JPG']}" pluginspage="http://www.macromedia.com/shockwave/download/index.cgi?P1_Prod_Version=ShockwaveFlash" type="application/x-shockwave-flash" height="325" width="400"> 
  </object>
</p>

<p style="text-align: justify; text-decoration: underline;"><strong>Rygar</strong></p>

<p style="text-align: justify;">Anos atr&aacute;s, quando o MAME tinha
acabado de aparecer, testei esse jogo e simplesmente adorei. Foi uma
grata surpresa quando descobri que Rygar havia saido tamb&eacute;m para
o Lynx em uma &oacute;tima convers&atilde;o. O jogo conta a
hist&oacute;ria de uma terra que foi arrasada e dominada por milenios
por criaturas das trevas, e um rei dessa antiga terra retorna para
expulsar esse mal e restaurar seu reino. Se for comparar mesmo esta
vers&atilde;o com a do arcade, logo se v&ecirc; que este se trata
praticamente de um jogo novo, com uma engine e sprites novos adaptados
para o console. O que aconteceu aqui foi mais ou menos o que ocorreu
com as convers&otilde;es de arcade da Sega para o Mega Drive, jogos com
o mesmo titulo, mas completamente refeitos. De qualquer forma, a
jogabilidade, divers&atilde;o e som foram mantidos, e os
gr&aacute;ficos n&atilde;o deixam nada a desejar. Algumas coisas novas
foram adicionadas nessa vers&atilde;o, o que considero um melhoramento.
Esse &eacute; um jog&atilde;o mesmo, e vale pela aventura.</p>

<p style="text-align: center;">
  <object classid="clsid:D27CDB6E-AE6D-11cf-96B8-444553540000" codebase="http://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=7,0,0,0" height="325" width="400">
    <param name="flash_component" value="ImageViewer.swc" />
    <param name="movie" value="images/lynx_conheca_06.swf" />
    <param name="quality" value="high" />
    <param name="FlashVars" value="flashlet={imageLinkTarget:'_blank',captionFont:'Verdana',titleFont:'Verdana',showControls:true,frameShow:false,slideDelay:5,captionSize:10,captionColor:#000000,titleSize:10,transitionsType:'Iris',titleColor:#000000,slideAutoPlay:false,imageURLs:['images/lynx_conheca_36.JPG','images/lynx_conheca_37.JPG','images/lynx_conheca_38.JPG','images/lynx_conheca_39.JPG','images/lynx_conheca_40.JPG','images/lynx_conheca_36.JPG'],slideLoop:false,frameThickness:2,imageLinks:['http://macromedia.com/','http://macromedia.com/','http://macromedia.com/'],frameColor:#000000,bgColor:#000000,imageCaptions:[]}" />
    
<embed src="images/lynx_conheca_06.swf" quality="high" flashvars="flashlet={imageLinkTarget:'_blank',captionFont:'Verdana',titleFont:'Verdana',showControls:true,frameShow:false,slideDelay:5,captionSize:10,captionColor:#000000,titleSize:10,transitionsType:'Iris',titleColor:#000000,slideAutoPlay:false,imageURLs:['images/lynx_conheca_36.JPG','images/lynx_conheca_37.JPG','images/lynx_conheca_38.JPG','images/lynx_conheca_39.JPG','images/lynx_conheca_40.JPG','images/lynx_conheca_36.JPG'],slideLoop:false,frameThickness:2,imageLinks:['http://macromedia.com/','http://macromedia.com/','http://macromedia.com/'],frameColor:#000000,bgColor:#000000,imageCaptions:[]}" pluginspage="http://www.macromedia.com/shockwave/download/index.cgi?P1_Prod_Version=ShockwaveFlash" type="application/x-shockwave-flash" height="325" width="400"> 
  </object>
</p>

<p style="text-align: justify;">&nbsp;</p>

<p style="text-align: justify; text-decoration: underline;"><strong>Conclus&atilde;o</strong></p>

<p style="text-align: justify;">O Handy/Lynx foi um console no minimo
revolucion&aacute;rio. Grande poder de processamento, aliado com uma
telinha colorida de alta defini&ccedil;&atilde;o, a possibilidade de se
ligar v&aacute;rios aparelhos para jogar um jogo e outras coisas,
formavam uma receita certa para o sucesso. Mas, como apareceu no mundo
a um pre&ccedil;o muito salgado, logo o Game Boy tomou conta do mercado
com seu sistema mais simples e barato. Hoje um Lynx em bom estado
costuma ser vendido entre uns $60,00-$100,00 completo l&aacute; no
Ebay. No Mercado Livre &eacute; meio complicado de achar um para
vender, e quando se acha s&atilde;o vendidos por horrores, mesmo quando
se &eacute; oferecido apenas o console sem mais nada.</p>

<p style="text-align: justify;">Se voc&ecirc; ficou curioso e t&aacute;
a fim de ver como esse console se comportava, poder&aacute; baixar na
nossa se&ccedil;&atilde;o de Downloads um set completo com emulador e
roms desse video game. Por&eacute;m j&aacute; aviso que a
emula&ccedil;&atilde;o do som ainda n&atilde;o chegou nem perto do que
&eacute; de verdade, mas j&aacute; d&aacute; para ter uma boa
no&ccedil;&atilde;o da qualidade desse console. </p>

<p style="text-align: justify;">&nbsp;</p>

<p style="text-align: center;" align="center"><span style="font-weight: bold;">Acesse o <a href="http://gigacom.freeforums.org/index.php" target="_blank">Trombone</a> e comente sobre essa mat&eacute;ria!</span>&nbsp;&nbsp;<big><span style="font-weight: bold;"></span></big><br />

</p>

<br />




<br />




<br />




<div style="clear: both;"> </div>




</div>




<div id="left">
<div id="left_top"><br />




</div>




<div style="text-align: center;"><big><a href="../index.html"><big><span style="font-weight: bold; font-style: italic; text-decoration: underline;"></span></big></a></big>
<big><img style="width: 200px; height: 20px;" alt="" src="../images/botoes/indice.png" /><br />




<br />




<a href="../index.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/home.png" /></a><br />




</big><a href="../artigosdiversos/a_artigosdiversos.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/diversos.png" /></a><br />




<br />




<a href="../deunarevista/a_deunarevista.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/deunarevista.png" /></a><br />




<a href="../gambiarra/a_gambiarra.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/gambiarra.png" /></a><br />




<a href="../necroterio/a_necroterio.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/necroterio.png" /></a><br />




<a href="../oficina/a_oficina.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/oficina.png" /></a><br />




<a href="http://gigacom.freeforums.org/index.php"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/trombone.png" /></a><br />




<br />




<a href="../8bits/a_8bits.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/8bits.png" /></a><br />




<a href="../16bits/a_16bits.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/16bits.png" /></a><br />




<a href="../32bits/a_32bits.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/3264bits.png" /></a><br />




<a href="../portateis/a_portateis.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/portateis.png" /></a><br />




<br />




<a href="../downloads/a_downloads.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/downloads.png" /></a><br />




<a href="../links/a_links.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/linksafiliados.png" /></a><br />




<a href="../historico.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/historico.png" /></a><big><a href="../gambiarra/a_gambiarra.html"><big><span style="font-weight: bold; font-style: italic; text-decoration: underline;"></span></big></a></big><br />




<big><a href="../32bits/a_32bits.html"><big><span style="font-weight: bold; font-style: italic; text-decoration: underline;"></span></big></a></big></div>




<br />




<img style="width: 200px; height: 20px;" alt="" src="../images/botoes/vertambem.png" /><br />




<big><big><span style="font-weight: bold; font-style: italic;"></span></big></big>
<div class="comnews"> <a href="#">Como
concertar o seu controle</a><br />




<span style="font-weight: bold; font-style: italic;">Um
problema
bastante comum em controles antigos &eacute; o mal funcionamento de
um
ou outro bot&atilde;o. A boa noticia &eacute; que tem como
arrumar isso
de um jeito facil facil :D</span><br />




<div style="text-align: right;"><a href="#">leia
mais</a><br />




</div>




</div>




<div class="comnews"> <a href="#">Especial:
controles do Mega Drive</a>
<div style="text-align: left;"><span style="font-weight: bold; font-style: italic;">O
controle do Mega de 3 bot&otilde;es &eacute; pra l&aacute;
de
conhecido, serviu de inspira&ccedil;&atilde;o para outros
consoles, e
faz sucesso at&eacute; hoje pelo seu estil&atilde;o
&uacute;nico. Mas
nem s&oacute; de bumerangue vive o Mega, tem muitos outros
controles
para ele...</span><br />




<div style="text-align: right;"><a href="#">leia
mais</a></div>




</div>




</div>




</div>




<div id="footer">
<p>Gigacom Old Games!</p>




<p>Tudo sobre&nbsp;jogos mais antiguinhos e outras coisitas
mais.</p>




<br />




</div>




</div>




</div>




<!-- footer ends-->
</body>
</html>
