<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>







































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <meta http-equiv="content-type" content="text/html; charset=UTF-8" />








































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <title>Gigacom Old Games!</title>
  <meta name="keywords" content="" />







































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <meta name="description" content="Tudo sobre jogos e video games antigos" />







































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <link href="styles.css" rel="stylesheet" type="text/css" media="screen" />





































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <meta content="Gigacom" name="author" />
</head>


<body>







































<div id="content">
<div id="main">
	
<div id="right">
	
<div id="header">
	
<div style="font-style: italic; font-family: Comic Sans MS;" id="logo"><big>
		
</big>
<h1><big><big><a href="../index.html"><br />

















</a></big></big></h1>
























<big>














		





	</big></div>







































	
<div id="menu">
		
<ul>







































			<li id="button1"><a href="a_gambiarra.html" title="">Gambiarra</a></li>







































			<li id="button2"><a href="../oficina/a_oficina.html" title="">Oficina do Giga</a></li>







































			<li id="button3"><a href="../necroterio/a_necroterio.html" title="">Necrot&eacute;rio</a></li>







































			<li id="button4"><a href="../deunarevista/a_deunarevista.html" title="">Deu na revista!</a></li>







































			<li id="button5"><a target="_blank" href="http://gigacom.freeforums.org/index.php" title="">Trombone</a></li>







































		
</ul>







































	</div>







































	</div>







































	
<h4 style="font-weight: bold;">Conceitos de instala&ccedil;&atilde;o de sa&iacute;da AV em video games<br />









</h4>









<p style="font-weight: bold; text-align: justify; font-style: italic;"><img style="width: 77px; height: 79px; float: left;" alt="" src="../images/avatares/avatar_gigacom.jpg" hspace="3" />:::. Por Gigacom!</p>









<p style="text-align: justify;"></p>






<p style="text-align: justify;"><br />




&Eacute; comum eu encontrar pessoas que querem saber tin-tin por
tin-tin como se instala uma sa&iacute;da de audio/video em um video
game antigo. A boa noticia &eacute; que essa opera&ccedil;&atilde;o
pouco difere entre os consoles, bastando apenas ter um minimo de
conhecimento sobre os componentes internos da placa do video game, e
sobre como utilizar algumas ferramentas e componentes. &nbsp;Logo, com
uma informa&ccedil;&atilde;o mais ou menos gen&eacute;rica, qualquer um
com um minimo de intelig&ecirc;ncia consegue por si pr&oacute;prio
instalar essas sa&iacute;das em qualquer console, sem ficar preso ao
Google. Continue lendo, e descubra como!</p>




<p style="text-align: justify; font-weight: bold; text-decoration: underline;">Chip decodificador</p>




<p style="text-align: justify;">Todo console tem um chip
respons&aacute;vel por codificar e decodificar os sinais de video para
um formato compat&iacute;vel com um determinado sistema de TV. Falei
grego? Explico: internamente, os sinais de video enviados pelos
processadores de video dos video games, v&atilde;o no formato RGB,
semelhante &agrave; esse que &eacute; utilizado em computadores. O chip
codificador, pega esses sinais RGB e converte para um sinal
compat&iacute;vel com a&nbsp;televis&atilde;o. Normalmente, esses chips
operam apenas com tr&ecirc;s sinais: NTSC (utilizado nos Estados
Unidos), NTSC-J (Jap&atilde;o) e PAL (Europeu).</p>




<p style="text-align: justify;">Os consoles fabricados no Brasil, onde o sistema de cores &eacute; PAL-M, normalmente
vem com um chip codificador configurado para enviar sinais NTSC,
por&eacute;m esses sinais em NTSC s&atilde;o interceptados e
convertidos para o padr&atilde;o PAL-M por um circuito adicional
instalado na placa m&atilde;e do console.&nbsp;</p>




<p style="text-align: justify;">Outra caracter&iacute;stica
interessante desses chips, &eacute; a intercepta&ccedil;&atilde;o e
modifica&ccedil;&atilde;o de sinais de audio. Alguns pegam os sinais de
audio est&eacute;reo e convertem para mono, outros simplesmten pegam os
sinais por um lado, e enviam os mesmos sinais por outro canto. Qual a
raz&atilde;o disso, eu ainda n&atilde;o sei, mas &eacute; assim que
acontece...</p>





<p style="text-align: justify;"><span style="font-weight: bold; text-decoration: underline;">Modelos de chips</span><br />



</p>




<p style="text-align: justify;"><a href="imagens/data_sheet_cxa1145.png"><img style="border: 2px solid ; width: 105px; height: 151px; float: right;" alt="" src="imagens/data_sheet_cxa1145.png" hspace="3" /></a>Cada chip codificador possui uma
identifica&ccedil;&atilde;o, que indica o modelo e as
caracter&iacute;sticas que possue.&nbsp;Essa
identifica&ccedil;&atilde;o vem impressa nos chips, e ajuda muito na
hora de fazer as soldagens, pois com ela &eacute; possivel pesquisar na
internet o datasheet do chip, e assim saber precisamente quais as
fun&ccedil;&otilde;es de cada sa&iacute;da do&nbsp;codificador. Falei
grego de novo? Ah t&aacute;... vamos l&aacute; ent&atilde;o: quando a
gente vai soldar um fio em um desses chips para criar uma sa&iacute;da
A/V, na verdade estamos soldando fios onde os sinais de video e som,
que s&atilde;o aceitos por TVs, saem do chip. Como &eacute; muito chato
e nem sempre confi&aacute;vel ficar testando perninha por perninha do
chip, &eacute; mais pr&aacute;tico pegar a identifica&ccedil;&atilde;o
do&nbsp;pretinho, jogar l&aacute; no Google, e pesquisar pelo esquema
que mostra as fun&ccedil;&otilde;es e identifica as sa&iacute;das do
chip. Esse esquema tambem &eacute; chamado de datasheet. &nbsp;Nesse
quadradado ao lado, &eacute; mostrado um exemplo de datasheet do
CXA1145, encontrado em alguns consoles da SEGA como o Master System e
Mega Drive. Clique nele para ampliar e ver melhor.Com o datasheet, fica muito mais
f&aacute;cil identificar os pontos&nbsp;onde ser&atilde;o feitas as
soldas, evitando assim retrabalho (ou cagadas fatais...). </p>




<p style="text-align: justify; font-weight: bold; text-decoration: underline;">Uso de capacitores, resistores, simpatias...</p>




<p style="text-align: justify;"><img style="width: 95px; height: 95px; float: right;" alt="" src="imagens/capacitor.jpg" />Ainda assim, por vezes &eacute;
nescess&aacute;rio utilizar um conjunto de componentes para adaptar os
sinais de video que saem desses chips, para poderem ser exibidos
corretamente na televis&atilde;o. Em geral, &eacute; utilizado um
sisteminha simples de dois resistores e um capacitor, em outros casos
menos que isso &eacute; nescess&aacute;rio. O problema mesmo &eacute;
que quase nunca isso d&aacute; bons resultados... a imagem costuma
ficar bem ruim, e n&atilde;o h&aacute; santo que d&ecirc; jeito, ah
n&atilde;o ser que voc&ecirc; esteja disposto a desenbolsar uma boa
grana com uma simpatizeira profissional, para pedir ajuda ao
al&eacute;m.</p>




<p style="text-align: justify;"><img style="width: 95px; height: 95px; float: left;" alt="" src="imagens/resistor.jpg" hspace="3" />De qualquer forma, esses componentes
extras s&atilde;o os responsav&eacute;is por dar um ajuste final aos
sinais de video (&eacute;, gra&ccedil;as &agrave; Godi os sinais de
audio n&atilde;o precisam disso), e sem eles a imagem fica
p&eacute;ssima, ruim pra cacete. Claro, vale lembrar que &eacute;
s&oacute; em alguns casos que &eacute; preciso utilizar isso, nos
outros a liga&ccedil;&atilde;o dos fios com a sa&iacute;da de video
&eacute; direta mesmo.</p>


<p style="text-align: justify;"></p>




<p style="text-align: justify; font-weight: bold; text-decoration: underline;">Furando o console</p>




<p style="text-align: justify;">Tendo uma id&eacute;ia boa de como e
onde soldar os fios, a pior parte de tudo &eacute; onde colocar os
conectores RCA no console. Comumente, o povo usa o ferro de solda para
derreter e fazer buracos horrendos no coitado do video game. O
resultado &agrave;s vezes &eacute; bom, outras nem tanto, e comumente
d&aacute; em merda. Para evitar espetar o ferro quente no console e
acabar com o traseiro do coitado (sem malicia povo, sem malicia),
recomendo fortemente utilizar aquelas brocas de miniretifica. &Eacute;
muito mais pr&aacute;tico e confi&aacute;vel, e no final o acabamento
fica profissional.</p>


<p style="text-align: center;"><img style="width: 384px; height: 207px;" alt="" src="imagens/mini_retifica.jpg" /></p>




<p style="text-align: justify;">Mas &eacute; claro, nem todo mundo tem
ou est&aacute; disposto a gastar grana com isso s&oacute; para fazer
uns 3 furinhos num video game. Nesse caso, pode-se utilizar outra
coisa, mas preferencialmente com a ajuda de um adulto. Qu&ecirc;?
T&aacute; achando que &eacute; brincadeira? Ent&atilde;o tente sozinho
furar um console com uma furadeira para ver o que acontece. Sim, uma furadeira tambem pode ser usada para fazer os furinhos no
console, e deixar o acabamento quase t&atilde;o bom quanto ficaria com
uma miniretifica, desde que seja usada corretamente &eacute; claro.
Lembre apenas de que est&aacute; furando um pl&aacute;stico fino, e
n&atilde;o a parede do seu quarto. A ajuda de outra pessoa &eacute;
mais que nescess&aacute;ria, pois voc&ecirc; ir&aacute; precisar de
algu&eacute;m para segurar o console, enquanto as suas m&atilde;os
estar&atilde;o ocupadas com a opera&ccedil;&atilde;o. Na hora de ligar
a furadeira, n&atilde;o aperte o bot&atilde;o dela at&eacute; o fundo,
aperte apenas de leve, para que ela ligue e fique em baixa
rota&ccedil;&atilde;o, assim ela ir&aacute; furar o console, sem
derret&ecirc;-lo ou fazer voc&ecirc; perder o controle da ferramenta.</p>


<p style="text-align: justify; font-weight: bold; text-decoration: underline;">Onde instalar os conectores RCA</p>


<p style="text-align: justify;">Ainda h&aacute; mais uma coisita a se
notar na instala&ccedil;&atilde;o dos conectores RCA. Alguns video
games possuem add-ons proprios, que poder&atilde;o na se encaixar no
console se a sa&iacute;da RCA ficar no lugar onde a pe&ccedil;a se
encaixaria. Esse tipo de situa&ccedil;&atilde;o a gente encontra no
Mega Drive por exemplo, onde o Master Converter ocupa uma parte da
parte traseira do console. Para evitar isso, &eacute; &oacute;bvio que
voc&ecirc; deve instalar a sa&iacute;da RCA em outra parte.</p>


<p style="text-align: center;"><img style="width: 560px; height: 420px;" alt="" src="imagens/genesis_mod_02.jpg" /></p>



<p style="text-align: justify;">
Basicamente &eacute; isso
crian&ccedil;as. Como diz o t&iacute;tulo, esse texto aborda apenas
conceitos e n&atilde;o a opera&ccedil;&atilde;o toda. Para cada console
h&aacute; um esquema, mas n&atilde;o costuma ter muita diferen&ccedil;a
na instala&ccedil;&atilde;o de um para outro. O que recomendo
al&eacute;m de tudo isso, &eacute; calma e certeza do que se
est&aacute; fazendo. &Eacute; preciso ter habilidade com solda, se
voc&ecirc; n&atilde;o tem essa pericia, ent&atilde;o treine um bocado
em aparelhos velhos antes de tentar fazer algo no seu precioso video
game. Duvidas e sugest&otilde;es j&aacute; sabem onde ir (l&aacute; no Trombone).</p>


<p style="text-align: center;"></p>



<span style="font-weight: bold;"></span><span style="font-weight: bold;"></span><span style="font-weight: bold;"></span><span style="font-weight: bold;"></span>

<p style="text-align: center;"><span style="font-weight: bold;">Acesse o <a href="http://gigacom.freeforums.org/index.php" target="_blank">Trombone</a> e comente sobre essa mat&eacute;ria!</span><br />





</p>













<br />













<br />































<div style="clear: both;">
	</div>









































	</div>







































	
<div id="left">
	
<div id="left_top"><br />










</div>







































	
			
<div style="text-align: center;"><big><a href="../index.html"><big><span style="font-weight: bold; font-style: italic; text-decoration: underline;"></span></big></a></big>
























				<big><img style="width: 200px; height: 20px;" alt="" src="../images/botoes/indice.png" /><br />












<br />












<a href="../index.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/home.png" /></a><br />












</big><a href="../artigosdiversos/a_artigosdiversos.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/diversos.png" /></a><br />












<br />












<a href="../deunarevista/a_deunarevista.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/deunarevista.png" /></a><br />












<a href="a_gambiarra.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/gambiarra.png" /></a><br />












<a href="../necroterio/a_necroterio.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/necroterio.png" /></a><br />












<a href="../oficina/a_oficina.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/oficina.png" /></a><br />














<a href="http://gigacom.freeforums.org/index.php"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/trombone.png" /></a><br />












<br />














<a href="../8bits/a_8bits.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/8bits.png" /></a><br />














<a href="../16bits/a_16bits.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/16bits.png" /></a><br />














<a href="../32bits/a_32bits.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/3264bits.png" /></a><br />














<a href="../portateis/a_portateis.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/portateis.png" /></a><br />












<br />












<a href="../downloads/a_downloads.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/downloads.png" /></a><br />














<a href="../links/a_links.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/linksafiliados.png" /></a><br />














<a href="../historico.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/historico.png" /></a><big><a href="../gambiarra/a_gambiarra.html"><big><span style="font-weight: bold; font-style: italic; text-decoration: underline;"></span></big></a></big><br />














<big><a href="../32bits/a_32bits.html"><big><span style="font-weight: bold; font-style: italic; text-decoration: underline;"></span></big></a></big></div>














<br />












<div style="text-align: center;"><img style="width: 200px; height: 20px;" alt="" src="../images/botoes/vertambem.png" /><br />








</div>












<big><big><span style="font-weight: bold; font-style: italic;"></span></big></big>
<div class="comnews">
			






























	

			<span style="font-weight: bold; font-style: italic; text-decoration: underline;">Visite o Trombone</span><br />


O Trombone &eacute; o forum de discurss&atilde;o do site, onde
voc&ecirc; pode postar as suas duvidas, elogios ou qualquer outra coisa
que queira falar. Visite agora mesmo!!!<br />


<div style="text-align: right;">
<div style="text-align: center;"><a href="http://gigacom.freeforums.org/index.php" target="_blank"><span style="text-decoration: underline;"><span style="font-weight: bold;">Clique aqui para abrir o Trombone!</span></span></a><br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />


<br />

<br />

<br />

<br />

<br />

<br />
<br />
<br />

<br />

<br />

<br />

</div>

</div>








</div>








</div>
































































<div id="footer">
<p>Gigacom Old Games!</p>






















<p>Tudo sobre&nbsp;jogos mais antiguinhos e outras coisitas mais.</p>






















<br />






















</div>






































</div>







































</div>







































<!-- footer ends-->
</body>
</html>
