<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>




































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <meta http-equiv="content-type" content="text/html; charset=UTF-8" />





































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <title>Gigacom Old Games!</title>
  <meta name="keywords" content="" />




































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <meta name="description" content="Tudo sobre jogos e video games antigos" />




































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <link href="styles.css" rel="stylesheet" type="text/css" media="screen" />


































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <meta content="Gigacom" name="author" />
</head>


<body>




































<div id="content">
<div id="main">
	
<div id="right">
	
<div id="header">
	
<div style="font-style: italic; font-family: Comic Sans MS;" id="logo"><big>
		
</big>
<h1><big><big><a href="../index.html"><br />














</a></big></big></h1>





















<big>














		





	</big></div>




































	
<div id="menu">
		
<ul>




































			<li id="button1"><a href="../gambiarra/a_gambiarra.html" title="">Gambiarra</a></li>




































			<li id="button2"><a href="../oficina/a_oficina.html" title="">Oficina do Giga</a></li>




































			<li id="button3"><a href="../necroterio/a_necroterio.html" title="">Necrot&eacute;rio</a></li>




































			<li id="button4"><a href="../deunarevista/a_deunarevista.html" title="">Deu na revista!</a></li>




































			<li id="button5"><a target="_blank" href="http://gigacom.freeforums.org/index.php" title="">Trombone</a></li>




































		
</ul>




































	</div>




































	</div>




































	
<h4 style="font-weight: bold;">Velhinhos 8-bits<br />






</h4>









<p style="font-weight: bold;"><img style="width: 77px; height: 79px; float: left;" alt="" src="../images/avatares/avatar_gigacom.jpg" hspace="3" /><span style="font-weight: bold;">:::.</span> Por Gigacom</p>






<p style="font-weight: bold;"></p>



<p style="font-weight: bold;"></p>



<p style="font-weight: bold; text-align: justify;"><span style="font-weight: normal;">Desde
que me entendo por gente, a disputa entre SEGA e Nintendo nos idos anos
80 e 90, gerava discurs&otilde;es infindav&eacute;is, brigas de
col&eacute;gio, separa&ccedil;&atilde;o de namorados e as vezes
at&eacute; morte. Na verdade podemos dizer que essa quest&atilde;o
ainda permanece viva, e gera t&oacute;picos imensos em forums de
discurs&atilde;o com tudo quanto &eacute; tipo de opni&atilde;o de
diversos f&atilde;s em todos os lugares.<br />

De
qualquer forma, n&atilde;o h&aacute; um melhor que todos no mundo dos
video games, nunca nem houve. Existem consoles e consoles, um voltado
para um publico, outro mais direcionado &agrave; um pequeno nicho de
pessoas. &Eacute; claro que tanto Nintendo quanto Sega trabalhavam para
alcan&ccedil;ar &agrave;s alturas e derrotar a concorrente, mas nenhuma
conseguiu isso. Mas para saber quem realmente era o melhor 8-bits,
&eacute; preciso ao menos conhecer a historia de cada um, ent&atilde;o
vamos l&aacute;:</span></p>

<table style="width: 100px; text-align: left; margin-left: auto; margin-right: auto;" border="1" cellpadding="2" cellspacing="2">

  <tbody>

    <tr>

      <td nowrap="nowrap"><img style="border: 2px solid ; width: 331px; height: 242px;" alt="" src="imagens/boxe_caras.jpg" /></td>

    </tr>

    <tr align="center">

      <td nowrap="nowrap"><span style="font-weight: bold; color: rgb(255, 0, 0);">A briga das duas gigantes foi feia que nem essa luta a&eacute;</span></td>

    </tr>

  
  </tbody>
</table>

<span style="font-weight: normal;"></span>

<p style="text-decoration: underline; font-weight: bold;"><span style="font-weight: normal;"><span style="font-weight: bold;">O surpreendente NES</span></span></p>



<p style="font-weight: bold; text-align: justify;"><span style="font-weight: normal;">Quase
ninguem sabe. Mas l&aacute; pelo meio dos anos 80, video game era
considerado um negocio antiquado e ultrapassado. O Atari, o principal
console que revolucionou a forma de se divertir em frente &agrave; uma
TV, foi tambem o algoz que enterrou essa mesma revolu&ccedil;&atilde;o.
Quando a Time Warner comprou a Atari ainda no inicio do seu sucesso,
ela resolveu permitir e incentivar o lan&ccedil;amento de qualquer
porquera de jogo para o Atari 2600. Ent&atilde;o uma enxurrada de jogos
novos invadiam as prateleiras americanas &agrave; cada semana, sendo
que de cada <span style="font-weight: bold;">10</span> jogos, <span style="font-weight: bold;">11</span> eram ruins, <span style="font-weight: bold;">12</span>
pess&iacute;mos e o restante injogav&eacute;l. Resultado: o povo
can&ccedil;ou de comprar joguinho do Atari (at&eacute; ent&atilde;o
praticamente o &uacute;nico video game do mundo), e o publico voltou o
seu interesse para outra novidade mais chamativa, os computadores
caseiros.</span></p>

<table style="text-align: left; margin-left: auto; margin-right: auto; width: 637px; height: 297px;" border="0" cellpadding="2" cellspacing="2">

  <tbody>

    <tr>

      <td style="white-space: nowrap;"><img style="width: 340px; height: 200px;" alt="" src="imagens/atari_et.png" /></td>

      <td nowrap="nowrap"><img style="width: 260px; height: 244px;" alt="" src="imagens/atari_et_01.jpg" /></td>

    </tr>

    <tr align="center">

      <td colspan="2" rowspan="1" nowrap="nowrap"><span style="font-weight: bold; color: rgb(255, 0, 0);">O cartucho do E.T. para Atari, &eacute; conhecido como um dos piores jogos de todos os tempos. Houveram muitos<br />

&nbsp;outros que</span> <span style="font-weight: bold; color: rgb(255, 0, 0);">ajudaram a enterrar o Atari, assim como o resto da industria de video games no inicio da d&eacute;cada de 80...</span></td>

    </tr>

  
  </tbody>
</table>



<p style="font-weight: bold;"><span style="font-weight: normal;"><br />

Int&atilde;o, quando ninguem mais queria saber de video games, aparece a Nintendo, com o incrivel Famicom.<span style="font-weight: bold;"> </span>A
id&eacute;ia do Famicom era em principio simples, mas audaciosa. Ele
deveria ser um console potente suficiente para refazer a roda, para
fazer as pessoas esquecerem os jogos simples do Atari e experimentarem
uma nova sensa&ccedil;&atilde;o de interatividade e divers&atilde;o.
Com um conjunto de chips poderosos para aqueles dias, o Famicom fez um
sucesso estrondoso no Jap&atilde;o, e logo em seguida &nbsp;uma
vers&atilde;o dele foi preparada para ser lan&ccedil;ada nos EUA.</span></p>



<p style="font-weight: bold; text-align: justify;"><span style="font-weight: normal;"><img style="border: 2px solid ; float: left; width: 253px; height: 189px;" alt="" src="imagens/famicom_nes.jpg" hspace="2" />Na
Am&eacute;rica, o Famicom n&atilde;o poderia aparecer como se fosse
mais um brinquedo, ele tinha que ter algo mais, algo que pudesse
despertar o interesse daquelas pessoas que procuravam cada vez mais
eletronicos avan&ccedil;ados, ent&atilde;o o design do Famicom foi
refeito, e surgiu assim o Nintendo Entertainment System, ou abriviando
NES.</span></p>



<p style="font-weight: bold; text-align: justify;"><span style="font-weight: normal;">Com o
jeit&atilde;o quadrad&atilde;o, mas que chamava aten&ccedil;&atilde;o,
ainda assim poucas lojas abriram as portas para o novo aparelho.
Inicialmente, apenas algumas lojinhas l&aacute; em Nova Yorque
apresentaram o NES aos americanos, e nem precisaram de muito tempo para
que logo o console da Nintendo ganhasse mat&eacute;rias em jornais e na
TV. Pronto, o sucesso j&aacute; estava &agrave; caminho, e a industria
do video game ressurgiu. Como a
Nintendo nunca foi besta, tratou logo de preparar duas coisas que
garantiriam o sucesso do NES por muito tempo:</span></p>

<p style="text-align: justify; font-weight: bold;"><span style="font-weight: normal;"><span style="font-weight: bold;">1&ordm;</span>
Todo jogo do NES teria que ser projetado e feito de acordo com um rol
imenso de regras e diretrizes da Nintendo. Tudo para impedir que
conte&uacute;do inadequado ou jogos imprest&aacute;veis fossem para as
prateleiras.</span></p>

<p style="text-align: justify; font-weight: bold;"><span style="font-weight: normal;"><span style="font-weight: bold;">2&ordm;</span>
Jogo publicado para o NES, &eacute; s&oacute; do NES. Esse &eacute; o
fim dos famosos contratos de exclusividade que a Nintendo fez com as
maiores softhouses daqueles dias, o que garantiu que os melhores jogos
do NES fossem publicados somente para ele, e n&atilde;o para um ou
outro video game da concorr&ecirc;ncia que pudesse aparecer.</span></p>



<p style="font-weight: bold; text-align: justify;"><span style="font-weight: normal;">Com isso a Nintendo preveniu que os motivos que mataram o Atari voltassem a ressugir, e como
havia dito, em pouquissimo tempo o NES ganhou a midia e o sucesso, mas
gra&ccedil;as &agrave; inova&ccedil;&atilde;o do jeito de jogar,
j&aacute; que joguinhos como Mario Bross mostraram ao mundo um jogo
formado com gr&aacute;ficos em sprites (n&atilde;o, n&atilde;o &eacute;
aquele refri de lim&atilde;o, s&atilde;o imagens mesmo) e trilha sonora
ao fundo, ao contr&aacute;rio dos simples quadradinhos do Atari, e os
barulhinos de bipe que ele emitia, sem falar nas v&aacute;rias fazes
que os jogos de NES possuiam, ao contr&aacute;rio de cen&aacute;rios
est&aacute;ticos t&atilde;o usados no Atari.</span></p>



<p style="text-align: justify; font-weight: bold; text-decoration: underline;"><span style="font-weight: normal;"><span style="font-weight: bold;">Master System: o arcade em sua casa</span></span></p>



<p style="font-weight: bold; text-align: justify;"><span style="font-weight: normal;">Enquanto
que o video game j&aacute; estava enterrado, sepultado e&nbsp;comido
pelos vermes no ocidente, l&aacute; na terra dos homi com olhos
puxados o mesmo n&atilde;o acontecera. Claro, vale ressaltar que no
mundo todo (com excess&atilde;o de uns atrasados como o Brasil) ainda
se divertia com arcades, que eram muito mais avan&ccedil;ados que o
Atari. Ent&atilde;o, l&aacute; no Jap&atilde;o principalmente, os jogos
eletr&ocirc;nicos n&atilde;o deixaram mesmo de existir, e muito menos
de ter seu publico fiel. T&aacute; certo que o Atari l&aacute; nem fez
tanta coisa assim, mas o espa&ccedil;o proporcionado por ele abriu
caminho para o aparecimento do Famicom logo no inicio dos anos 80, e
consequentemente permitiu que outras empresas tambem projetassem e
lan&ccedil;assem seus proprios video games. Esse &eacute; o
cen&aacute;rio em que se via a Sega. Ela fez alguns testes de mercado,
lan&ccedil;ando o SG-1000, um tat&aacute;rav&ocirc; do Master System,
que n&atilde;o fedeu e nem cheirou. Depois ela apresentou o SG-1000 II,
uma reformula&ccedil;&atilde;o do console anterior, com alguns
acess&oacute;rios que o tornavam um hibrido, podendo servir de
computador e video game. Como a coisa j&aacute; tava come&ccedil;ando a
caminhar, mas ainda muito limitada por conta do hardware, a Sega refez
o projeto, e lan&ccedil;ou o fodastico <span style="font-weight: bold;">SEGA MARK III</span>. Mais mem&oacute;ria
RAM, um processador de video mais aprumado, umas portas &agrave; mais
para acess&oacute;rios, e assim surgiu o console mais-mais-mais tchan!&nbsp;daqueles
dias, que digamos de passagem, era MUITO superior tecnicamente ao NES,
deixando-o no chinelo em TODOS os quesitos. Posteriormente, o Mark III
recebeu uma nova cara e um chip de som diferente (o Yamaha YM2413), dai
&eacute; que veio o Sega Master System, lan&ccedil;ado em 87 em todo o
mundo.</span></p>
<table style="width: 100px; text-align: left; margin-left: auto; margin-right: auto;" border="0" cellpadding="2" cellspacing="2">
  <tbody>
    <tr>
      <td colspan="1" rowspan="1" nowrap="nowrap"><img style="width: 499px; height: 232px;" alt="" src="imagens/master_1_3_mark.jpg" /></td>
    </tr>
    <tr>
      <td colspan="1" rowspan="1" style="white-space: nowrap;"><span style="color: rgb(255, 0, 0); font-weight: bold;">O Sega Mark III (o branquinho a&iacute; em cima) recebeu uma cara nova e virou o Master System</span><br style="color: rgb(255, 0, 0); font-weight: bold;" />
      <span style="color: rgb(255, 0, 0); font-weight: bold;">(pretinho ao lado) que mais pra frente recebeu outras revis&otilde;es, como o 3&ordm; console da foto.</span></td>
    </tr>
  </tbody>
</table>
<p style="text-align: justify; font-weight: bold;"><span style="font-weight: normal;"></span></p>



<p style="text-align: justify; font-weight: bold;"><span style="font-weight: normal;">Mesmo
antes do SG-1000, a Sega era bastante conhecida pelos seus jogos de
pinball e arcades, que renderam rios de dinheiro para a empresa, e
criou o mito SEGA. O Master System era para ser o console que
possibilitaria aos gamers jogarem aqueles grandes sucessos do arcade em
casa, al&eacute;m de muitos outros jogos tecnicamente superiores ao
NES. Sendo assim, os principais jogos de arcade da SEGA tiveram suas
vers&otilde;es para o console de 8-bits, jogos como Hang-On, Space
Harrier, Shinobi e outros. T&aacute; certo que alguns ficaram muito
parecidos com as vers&otilde;es originais, mas outros ficaram
completamente diferentes...</span></p>



<p style="font-weight: bold; text-align: center;"><span style="font-weight: normal;"></span><span style="text-decoration: underline;">T&aacute;, e agora, qual &eacute; o melhor?</span></p>


<p style="text-align: justify; font-weight: bold;"><span style="font-weight: normal;">Agora
que voc&ecirc; conhece mais ou menos a historia inicial de cada um,
chegou o momento de saber qual dos dois &eacute; melhor. E o melhor
&eacute;... &eacute;... &Eacute;... Nenhum dos dois. Costumo dizer que
o que faz um video game bom s&atilde;o seus jogos, mas tambem o que o
torna melhor depende mais do gosto de cada um. Por exemplo, os jogos do
Master todos tem uma qualidade imensa, praticamente toda a biblioteca
de jogos dele &eacute; feita s&oacute; de jog&atilde;o, apesar dessa
biblioteca n&atilde;o ser t&atilde;o grande assim... do outro lado,
temos o NES, que possui uma quantidade muito maior de jogos, sendo que
a grande maioria &eacute;&nbsp;simplesmente viciante e fazem a alegria
de muita gente at&eacute; hoje.</span></p>
<p style="text-align: justify; font-weight: bold;"><span style="font-weight: normal;">Comparando
a qualidade dos jogos de um e outro, percebe-se facilmente que em
quest&atilde;o de gr&aacute;ficos e som os jogos do Master s&atilde;o
muito melhores, por&eacute;m o NES tem jogos que esbanjam originalidade
e divers&atilde;o. Mas o Master tem o Phantasy Star, que em
v&aacute;rios conceitos &eacute; muito melhor que Final Fantasy do NES,
por&eacute;m o Mario 3 &eacute; muito mais divertido que Alex Kidd.</span></p>
<p style="text-align: justify; font-weight: bold;"><span style="font-weight: normal;">Enfim,
h&aacute; gosto e gostos, tem gente que odeia o NES, outros j&aacute; o
adoram a ponto de seguirem uma religi&atilde;o (tem uma seita que
&eacute; at&eacute; famosa, a do NES INVISIVEL!). Outros amam o Master
de paix&atilde;o e nem t&atilde;o a&iacute; pro NES. De qualquer forma,
ambos os consoles tem suas qualidades e limita&ccedil;&otilde;es, mas
os dois foram feitos para divertir, o que invariavelmente conseguem
fazer ainda hoje.</span></p>
<p style="text-align: justify; font-weight: bold;"><span style="font-weight: normal;"></span></p>
<p style="font-weight: bold; text-align: center;">Acesse o <a href="http://gigacom.freeforums.org/index.php" target="_blank">Trombone</a> e comente sobre essa mat&eacute;ria!&nbsp;<br />
</p>






<br />










<br />










<br />




























<div style="clear: both;">
	</div>






































	</div>




































	
<div id="left">
	
<div id="left_top"><br />







</div>




































	
			
<div style="text-align: center;"><big><a href="../index.html"><big><span style="font-weight: bold; font-style: italic; text-decoration: underline;"></span></big></a></big>
























				<big><img style="width: 200px; height: 20px;" alt="" src="../images/botoes/indice.png" /><br />









<br />









<a href="../index.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/home.png" /></a><br />









</big><a href="../artigosdiversos/a_artigosdiversos.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/diversos.png" /></a><br />









<br />









<a href="../deunarevista/a_deunarevista.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/deunarevista.png" /></a><br />









<a href="../gambiarra/a_gambiarra.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/gambiarra.png" /></a><br />









<a href="../necroterio/a_necroterio.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/necroterio.png" /></a><br />









<a href="../oficina/a_oficina.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/oficina.png" /></a><br />











<a href="http://gigacom.freeforums.org/index.php"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/trombone.png" /></a><br />









<br />











<a href="a_8bits.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/8bits.png" /></a><br />











<a href="../16bits/a_16bits.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/16bits.png" /></a><br />











<a href="../32bits/a_32bits.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/3264bits.png" /></a><br />











<a href="../portateis/a_portateis.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/portateis.png" /></a><br />









<br />









<a href="../downloads/a_downloads.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/downloads.png" /></a><br />











<a href="../links/a_links.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/linksafiliados.png" /></a><br />











<a href="../historico.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/historico.png" /></a><big><a href="../gambiarra/a_gambiarra.html"><big><span style="font-weight: bold; font-style: italic; text-decoration: underline;"></span></big></a></big><br />











<big><a href="../32bits/a_32bits.html"><big><span style="font-weight: bold; font-style: italic; text-decoration: underline;"></span></big></a></big></div>











<br />









<div style="text-align: center;"><img style="width: 200px; height: 20px;" alt="" src="../images/botoes/vertambem.png" /><br />





</div>









<big><big><span style="font-weight: bold; font-style: italic;"></span></big></big>
<div class="comnews">
			
<div class="comnews">
			<a href="../16bits/a_16bits.html#"><span style="font-weight: bold; font-style: italic;"></span></a>
<div class="comnews">
			<span style="font-weight: bold; font-style: italic; text-decoration: underline;">Ninja Gaiden para Mega Drive</span> <br />



Um dos erros mais imperdo&aacute;veis
da Sega. Em 90/91 mais ou menos, a Sega ganhou da Tecmo a oportunidade
de fazer umas vers&otilde;es do Ninja Gaiden para os seus consoles.
Essa chance &eacute; compar&aacute;vel ao que Deus fez quando deu o
mundo para Ad&atilde;o... bem, o final tanto de Ad&atilde;o quanto da
Sega nesse caso s&atilde;o semelhantes.








<div style="text-align: right;">&nbsp;<a href="../necroterio/necroterio_ninjagaiden_megadrive.html">leia mais</a><br />



<br />



<div style="text-align: left;"><span style="font-weight: bold; font-style: italic; text-decoration: underline;">Albert Odyssey para o SNES</span><br />



Albert Odyssey
&eacute; um dos jogos mais amados pelos f&atilde;s do Saturn. Com uma
hist&oacute;ria&nbsp;simples mas rica, dramatica e emocionante,
encantou muita gente que naquele inicio da era 32 bits, ainda
n&atilde;o estava acostumada com trilha sonora feita com instrumentos
de verdade e gr&aacute;ficos cheios de luz e efeitos. Mas, n&atilde;o
era para ser assim com esse jogo...<br />



<div style="text-align: right;"><a href="../necroterio/necroterio_snes_albert_odissey.html">leia mais</a><a href="../16bits/a_16bits.html#"></a><br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />





</div>



</div>



</div>












</div>
</div>
<div class="comnews">
<div style="text-align: left;">

























</div>










































	










		</div>





<span style="font-weight: bold; font-style: italic;"></span></div>





</div>





























































<div id="footer">
<p>Gigacom Old Games!</p>



















<p>Tudo sobre&nbsp;jogos mais antiguinhos e outras coisitas mais.</p>



















<br />



















</div>



































</div>




































</div>




































<!-- footer ends-->
</body>
</html>
