<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>










































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <meta http-equiv="content-type" content="text/html; charset=UTF-8" />











































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <title>Gigacom Old Games!</title>
  <meta name="keywords" content="" />










































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <meta name="description" content="Tudo sobre jogos e video games antigos" />










































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <link href="styles.css" rel="stylesheet" type="text/css" media="screen" />








































  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  
  <meta content="Gigacom" name="author" />
</head>


<body>










































<div id="content">
<div id="main">
	
<div id="right">
	
<div id="header">
	
<div style="font-style: italic; font-family: Comic Sans MS;" id="logo"><big>
		
</big>
<h1><big><big><a href="../index.html"><br />




















</a></big></big></h1>



























<big>














		





	</big></div>










































	
<div id="menu">
		
<ul>










































			<li id="button1"><a href="../gambiarra/a_gambiarra.html" title="">Gambiarra</a></li>










































			<li id="button2"><a href="../oficina/a_oficina.html" title="">Oficina do Giga</a></li>










































			<li id="button3"><a href="../necroterio/a_necroterio.html" title="">Necrot&eacute;rio</a></li>










































			<li id="button4"><a href="../deunarevista/a_deunarevista.html" title="">Deu na revista!</a></li>










































			<li id="button5"><a target="_blank" href="http://gigacom.freeforums.org/index.php" title="">Trombone</a></li>










































		
</ul>










































	</div>










































	</div>










































	
<h4 style="font-weight: bold;">Sega CD - Snacther<br />












</h4>





























<p style="text-align: justify;" class="MsoNormal"><span style="font-weight: bold;"><img style="width: 82px; height: 107px; float: left;" alt="" src="../images/avatares/avatar_corredor_x.gif" hspace="2" />:::. <span style="text-decoration: underline;">Corredor X</span> -&nbsp;</span>A primeira coisa que vem &agrave; mente quando se ouve falar <st1:personname productid="em Hideo Kojima" w:st="on">em <span style="font-weight: bold;">Hideo Kojima</span></st1:personname>,
obviamente, &eacute; <i style="font-weight: bold;">Metal Gear</i><span style="font-weight: bold;">.</span> Afinal, o sujeito, um desses casos raros de
criador de games cujo nome &eacute; conhecido por parte do grande p&uacute;blico, &eacute; pai desta
que &eacute; uma das melhores s&eacute;ries j&aacute; concebidas para qualquer console. Hist&oacute;rias
interessantes e repletas de reviravoltas, m&uacute;sicas e visuais marcantes para as
respectivas &eacute;pocas e uma influ&ecirc;ncia ineg&aacute;vel do cinema. Hideo tem v&aacute;rios outros
m&eacute;ritos no curr&iacute;culo com as mesmas caracter&iacute;sticas da saga de Solid Snake, mas
que infelizmente n&atilde;o s&atilde;o t&atilde;o conhecidas, principalmente por ainda permanecerem
obscurecidas e at&eacute; mesmo in&eacute;ditas no ocidente. Nessa categoria se encaixam o
&oacute;timo <i>Policenauts</i>, cuja vers&atilde;o de Playstation ganhou uma tradu&ccedil;&atilde;o em
ingl&ecirc;s de f&atilde;s, e o cultuado e n&atilde;o menos excelente <i style="font-weight: bold;">Snatcher</i>.</p>
<span style=""></span>
<div style="text-align: center;"><span style=""><img style="width: 512px; height: 153px;" alt="" src="imagens/scd_snatcher_08.jpg" />&nbsp;</span><br />

<span style=""></span></div>

<p class="MsoNormal" style="text-align: justify;"><span style="">
Lan&ccedil;ado originalmente para o PC-8801 (um daqueles computadores japoneses cheios
de jogos legais que nunca nem vimos o cheiro) e quase que simultaneamente para
o MSX2, <i>Snatcher</i> foi o segundo jogo feito por Hideo, logo depois do <i>MG</i>
original. Algum tempo depois, ganhou um port para o PC-Engine, cujo suporte ao
CD permitiu uma qualidade superior de imagem e som, al&eacute;m de vozes digitalizadas
&ndash; quem acompanhou a evolu&ccedil;&atilde;o dos jogos nos &uacute;ltimos vinte e poucos anos
lembra-se bem de como isso impressionava, na &eacute;poca. Essa vers&atilde;o turbinada foi a
base para outros ports de consoles posteriores, como o Saturn, Playstation e
tamb&eacute;m o Sega-CD, de cuja vers&atilde;o trata este review. <br />


<br />

<img style="width: 242px; height: 172px; float: left;" alt="" src="imagens/scd_snatcher_07.jpg" hspace="2" />A adapta&ccedil;&atilde;o do jogo para o add-on da Sega &eacute; basicamente a vers&atilde;o PC-Engine, mas
com ligeiras censuras aqui e ali (a maioria envolvendo seios e &oacute;rg&atilde;os internos
para fora de cad&aacute;veres) para se adaptar melhor ao tradicionalismo
estadunidense, al&eacute;m de adapta&ccedil;&otilde;es como a idade de uma das personagens e a
apar&ecirc;ncia dos rob&ocirc;s que d&atilde;o t&iacute;tulo ao jogo. Essa vers&atilde;o, a &uacute;nica oficialmente
lan&ccedil;ada em ingl&ecirc;s e exclusiva do ocidente, vendeu pouqu&iacute;ssimas c&oacute;pias nos EUA e
relegou <i>Snatcher</i> ao status de cult, sendo um dos jogos mais
inflacionados do console hoje em dia &ndash; aqueles que tentam te empurrar como RARO
&Uacute;NICO EXCLUSIVO no Mercado Livre, sabe? Essa fama tardia se deu muito em fun&ccedil;&atilde;o
do sucesso de<i> Metal Gear Solid</i> e do pr&oacute;prio Kojima, mas o jogo tem f&atilde;s
fi&eacute;is desde sempre.&nbsp;</span></p>

<p class="MsoNormal" style="text-align: justify;"><span style="">
Passada a li&ccedil;&atilde;ozinha de hist&oacute;ria, vamos ao que interessa: o que diabos esse tal
<i>Snatcher</i> tem para falarem t&atilde;o bem dele? O que leva pessoas - como este
que vos escreve &ndash; inclu&iacute;-lo insistentemente em suas listas de melhores do
console? O que separa a refer&ecirc;ncia/homenagem do pl&aacute;gio puro e simples?
Acompanhem, meus amigos.</span></p>

<p class="MsoNormal" style="text-align: justify;"><span style=""><img style="border: 1px solid ; float: right; width: 263px; height: 189px;" alt="" src="imagens/scd_snatcher_09.jpg" hspace="2" />
No meio dos anos 90, um desastre nuclear na R&uacute;ssia dizima praticamente metade
da popula&ccedil;&atilde;o mundial. Meio s&eacute;culo depois, na cidade de Neo Kobe, estranhos
rob&ocirc;s conhecidos como Snatchers aterrorizam a cidade de Neo Kobe, por se
passarem por seres humanos normais ap&oacute;s retirar a pele de suas v&iacute;timas e se
&ldquo;vestirem&rdquo; com ela - da&iacute; o apelido das criaturas, j&aacute; que &ldquo;snatch&rdquo; significa
arrancar &agrave; for&ccedil;a ou roubar. O her&oacute;i do jogo, Gillian Seed, faz parte da
organiza&ccedil;&atilde;o JUNKER, disposta a acabar com essa amea&ccedil;a. Encontrado junto &agrave;
esposa Jamie em sono criog&ecirc;nico na Sib&eacute;ria algum tempo antes e sofrendo de
total amn&eacute;sia, ele tenta descobrir mais sobre seu passado. <br />


<br />


&Eacute; praticamente imposs&iacute;vel n&atilde;o se lembrar de outras obras de fic&ccedil;&atilde;o simplesmente
ao ler esse relato do jogo, efeito que aumenta ao se jogar o mesmo. O plot em
si &eacute; uma cruza &oacute;bvia de <i>O Exterminador do Futuro</i> (a apar&ecirc;ncia dos
Snatchers no ocidente teve at&eacute; que ser modificada para diminuir a semelhan&ccedil;a), <i>Vampiros
de Almas/Invasores de Corpos</i> (o original e o remake s&atilde;o cl&aacute;ssicos, valem
uma conferida por quem n&atilde;o conhece) e <i>Blade Runner</i>. Este &uacute;ltimo, ali&aacute;s,
&eacute; o mais descarado: Gillian &eacute; uma c&oacute;pia quase fiel de Rick Deckard, da
apar&ecirc;ncia ao carro e equipamentos que usa, sendo que sua fun&ccedil;&atilde;o de ca&ccedil;ar
Snatchers &eacute; justamente chamada de Runner. Nesse mesmo estilo, outras obras
(inclusive videogames da Konami) ganham cita&ccedil;&atilde;o. Nas m&atilde;os de algu&eacute;m menos
criativo, essa mistura se configuraria num festival gratuito de pl&aacute;gios, mas
Kojima consegue transformar esse pastiche em um roteiro &aacute;gil e interessante.&nbsp;</span></p>

<div style="text-align: center;"><span style=""><img style="width: 254px; height: 224px;" alt="" src="imagens/scd_snatcher_02.jpg" /><img style="width: 256px; height: 224px;" alt="" src="imagens/scd_snatcher_00.gif" />
</span><br />

<span style="color: rgb(255, 0, 0); font-weight: bold;">Algumas cenas picantes e outras meio fortes... isso &eacute; Snacther </span><img style="width: 26px; height: 28px;" alt="" src="../images/icones/icon_rock1.gif" /><br />

<img style="width: 346px; height: 213px;" alt="" src="imagens/scd_snatcher_04.jpg" /><img style="width: 310px; height: 213px;" alt="" src="imagens/scd_snatcher_05.jpg" /><br />

<span style="font-weight: bold; color: rgb(255, 0, 0);">A primeira foto mostra uma tela onde o jogador deve tomar uma decis&atilde;o sobre o que Seed deve fazer.</span><br style="font-weight: bold; color: rgb(255, 0, 0);" />

<span style="font-weight: bold; color: rgb(255, 0, 0);">Na segunda foto, o robozinho Metal Gear (auxiliar de Seed) se espanta ao encontrar o esquelo de um Snacther.</span><br />

<br />

<span style=""></span></div>

<p class="MsoNormal" style="text-align: justify;"><span style="">
O estilo de <i>Snatcher</i> pode ser definido como &ldquo;visual novel&rdquo;. Voc&ecirc; n&atilde;o
comanda diretamente o personagem, apenas toma decis&otilde;es via menus que d&atilde;o
continuidade &agrave; hist&oacute;ria conforme as situa&ccedil;&otilde;es e mist&eacute;rios v&atilde;o sendo elucidados.
Eventualmente, acontecem cenas nas quais &eacute; necess&aacute;rio atirar nos oponentes, com
a tela dividindo-se em grids para indicar para onde vai o tiro.&nbsp;</span></p>

<div style="text-align: center;"><span style=""><img style="width: 513px; height: 298px;" alt="" src="imagens/scd_snatcher_06.jpg" />
</span><br />

<span style="font-weight: bold; color: rgb(255, 0, 0);">O grid com uma cena de tiro.</span><br />

<br />

<span style=""></span></div>

<p class="MsoNormal" style="text-align: justify;"><span style="">
Al&eacute;m da comodidade de estar em ingl&ecirc;s, a vers&atilde;o de Sega-CD tem mais alguns m&eacute;ritos,
desde o fato das cenas de tiro poderem se utilizar do bom e velho Justifier, o
famoso tr&ecirc;s-oit&atilde;o que acompanhava o cl&aacute;ssico <i>Lethal Enforcers</i>, at&eacute; o
fato de que a hist&oacute;ria do jogo est&aacute; completa. Explico o motivo disso ser um
diferencial: na vers&atilde;o original dos computadores, n&atilde;o existe o Terceiro Ato com
o final originalmente planejado, com o jogo terminando no Segundo Ato e
deixando algumas quest&otilde;es pendentes. S&oacute; no PC-Engine (e tamb&eacute;m <st1:personname productid="em SD Snatcher" w:st="on">em <i>SD Snatcher</i></st1:personname>, do
MSX mas falo deste aqui outro dia) em diante fomos ter o fechamento digno da
hist&oacute;ria.<br />


<br />


Meu veredicto &eacute; que, se voc&ecirc; tem o console ou &eacute; adepto da emula&ccedil;&atilde;o, vale muito
a pena experimentar <i>Snatcher</i>.</span></p>


<p style="text-align: justify;" class="MsoNormal"><br />




</p>






<br />







<div style="text-align: center;">




&nbsp;&nbsp;<big><span style="font-weight: bold;"></span></big><br />







<span style="font-weight: bold;">Acesse o <a href="http://gigacom.freeforums.org/index.php" target="_blank">Trombone</a> e comente sobre essa mat&eacute;ria!</span></div>
















<br />
















<br />


































<div style="clear: both;">
	</div>












































	</div>










































	
<div id="left">
	
<div id="left_top"><br />













</div>










































	
			
<div style="text-align: center;"><big><a href="../index.html"><big><span style="font-weight: bold; font-style: italic; text-decoration: underline;"></span></big></a></big>
























				<big><img style="width: 200px; height: 20px;" alt="" src="../images/botoes/indice.png" /><br />















<br />















<a href="../index.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/home.png" /></a><br />















</big><a href="../artigosdiversos/a_artigosdiversos.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/diversos.png" /></a><br />















<br />















<a href="../deunarevista/a_deunarevista.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/deunarevista.png" /></a><br />















<a href="../gambiarra/a_gambiarra.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/gambiarra.png" /></a><br />















<a href="../necroterio/a_necroterio.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/necroterio.png" /></a><br />















<a href="../oficina/a_oficina.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/oficina.png" /></a><br />

















<a href="http://gigacom.freeforums.org/index.php"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/trombone.png" /></a><br />















<br />

















<a href="../8bits/a_8bits.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/8bits.png" /></a><br />

















<a href="a_16bits.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/16bits.png" /></a><br />

















<a href="../32bits/a_32bits.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/3264bits.png" /></a><br />

















<a href="../portateis/a_portateis.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/portateis.png" /></a><br />















<br />















<a href="../downloads/a_downloads.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/downloads.png" /></a><br />

















<a href="../links/a_links.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/linksafiliados.png" /></a><br />

















<a href="../historico.html"><img style="border: 0px solid ; width: 180px; height: 30px;" alt="" src="../images/botoes/historico.png" /></a><big><a href="../gambiarra/a_gambiarra.html"><big><span style="font-weight: bold; font-style: italic; text-decoration: underline;"></span></big></a></big><br />

















<big><a href="../32bits/a_32bits.html"><big><span style="font-weight: bold; font-style: italic; text-decoration: underline;"></span></big></a></big></div>

















<br />















<img style="width: 200px; height: 20px;" alt="" src="../images/botoes/vertambem.png" /><br />















<big><big><span style="font-weight: bold; font-style: italic;"></span></big></big>
<div class="comnews">
			
<h4 style="font-weight: bold; font-style: italic; text-decoration: underline;">Mega Drive - Jogos com musicos famosos</h4>




Nos anos 90 percebi que a industria da musica e a industria do videogame 
estavam andando juntas, mesmo que de uma maneira discreta, ou seja, com 
pouca divulga&ccedil;&atilde;o, pelo menos por aqui no Brasil onde as informa&ccedil;&otilde;es eram
 obtidas atrav&eacute;s das revistas de games.<br />




<div style="text-align: right;"><a href="16bits_md_jogos_musicos.html">leia mais</a><br />




</div>




<h4 style="font-weight: bold; font-style: italic; text-decoration: underline;">Sonic the Hedgehog - A passagem de tempo</h4>





<h4 style="font-weight: normal; text-align: left;">Curiosidade que vejo pouco comentada, &eacute; que este
jogo tem uma esp&eacute;cie de
passagem de tempo. Cada fase por seu plano de fundo (background) mostrava
uma colora&ccedil;&atilde;o diferente
como se informa-se o hor&aacute;rio (manh&atilde; tarde e noite).</h4>





<span style="font-weight: bold; font-style: italic;"></span>




















<div style="text-align: right;"><a href="16bits_sonic_passagem_tempo.html">leia mais</a><br />
































</div>










































		</div>










































	
<div class="comnews">
			<span style="font-weight: bold; font-style: italic; text-decoration: underline;">Telebradesco</span>
<div style="text-align: left;"><span style="font-weight: normal;">Nos
prim&oacute;rdios da internet brasileira, quando os micros eram coisa
de luxo, e acesso &agrave; web era literalmente coisa de outro mundo, o
banco Bradesco em parceria com a Tec Toy fizeram uma grande
inova&ccedil;&atilde;o: </span><span style="font-weight: normal;">um cartucho especial fabricado com exclusividade pela Tec Toy para o
Bradesco.</span><span style="font-weight: bold; font-style: italic;"></span>




















<div style="text-align: right;"><a href="16bits_telebradesco.html">leia mais</a><br />



</div>
































</div>
















































	










		</div>





















</div>



































































<div id="footer">
<p>Gigacom Old Games!</p>

























<p>Tudo sobre&nbsp;jogos mais antiguinhos e outras coisitas mais.</p>

























<br />

























</div>









































</div>










































</div>










































<!-- footer ends-->
</body>
</html>
